/*----------------------------------------------------------------------*
 * File name	: cntget.c												*
 *----------------------------------------------------------------------*
 *$Header: p:/h8slib/drive/rsh/RCS/cntget.c 1.2 1970/01/01 00:00:00 yonetsu Exp $
 *$Log: cntget.c $
 * リビジョン 1.2  1970/01/01  00:00:00  yonetsu
 * 2001.01.08 15:20
 * BIOS の INCLUDE フォルダーの変更
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  yonetsu
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 2000, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(077) 553-4141											*/
/*----------------------------------------------------------------------*/
/* 説明                                                  				*/
/*		リフレッシュコントローラを使用したカウンター					*/
/*----------------------------------------------------------------------*/

#include	<bios2357\h8sbsc.h>
#include	<custom\custom.h>
#include	<drive\cntdrv.h>
#include	"cnt.h"

/*----------------------------------------------------------------------*/
/* カウンター値の取得													*/
/*																		*/
/* 引き数																*/
/*		counter_no :	カウンターの番号 ( 1 - 初期化時のカウンターの数	*/
/* 戻り値																*/
/*		現在のカンター値												*/
/*		読み出したカンターはクリアーされることに注意					*/
/*----------------------------------------------------------------------*/
int get_scnt(
	int	counter_no
	)
{
	int	cnt = 0;

	if(syscnt.enable_flag == 0)				return cnt;
	if(counter_no > syscnt.enable_flag)		return cnt;
	counter_no--;

	_disable();
	cnt = *(syscnt.cnt + counter_no);
	*(syscnt.cnt + counter_no) = 0;
	_enable();

	return cnt;
}
