/*======================================================================
 * File name    : bscuid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: bscuid.c $
 * リビジョン 1.6  1970/01/01  00:00:00  chimura
 * 2003/11/12
 * SH2のメイクファイルに-def=CPUSH2を追加
 * 
 * リビジョン 1.5  1970/01/01  00:00:00  chimura
 * 2003/09/25 19:00
 * TRAP中に割り込みを禁止していた処理をやめる。
 * 
 * リビジョン 1.4  1970/01/01  00:00:00  chimura
 * 2003/09/19 16:00
 * TRAP中は割り込み禁止とする。
 * TRAP中にハードウェア割り込みが発生すると暴走する。
 * 
 * リビジョン 1.3  1970/01/01  00:00:00  chimura
 * 2003/08/05 compiler ver7 vup
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/01/31 17:30
 * scubaudを追加する。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*bscuid = "$Header: p:/presto2/shlib_v7/biosif/scu/rcs/bscuid.c 1.6 1970/01/01 00:00:00 chimura Exp $";
