/*======================================================================
 * File name    : dvdpmid.c
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: dvdpmid.c $
 * リビジョン 1.3  1970/01/01  00:00:00  chimura
 * 2003/08/05 compiler ver7 vup
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/03/13 11:15
 * リード、ライトの境界が奇数アドレスにならないようにする。
 * 奇数アドレスにワード、ダブルワードアクセスすると例外処理（アドレスエラー）
 * が発生する。
 * 左辺のキャストをやめる。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/drive/vdpm/rcs/dvdpmid.c 1.2 1995/10/25 10:55:48 chimura
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

char	*dvdpmid = "$Header: p:/presto2/shlib_v7/drive/vdpm/RCS/dvdpmid.c 1.3 1970/01/01 00:00:00 chimura Exp $";

