/*======================================================================
 * File name    : rzi033.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	金属検出機テスト結果テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzi033.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi033.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzi033.c 1.2 1994/08/05 18:19:49 hiroe
 *Log: rzi033.c
 * リビジョン 1.2  1994/08/05  18:19:49  hiroe
 * answerをhtoc -> hex_asciiにする
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzi033.h>		/* Show Current		*/
#undef		STORAGE

/*----------------------------------------------------------------------*/
/*	rz_scan_metal_answer						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	金属検出機テスト結果テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_metal_answer(
	struct fmt_metal_answer	*buf
	)
{
	rzi033s.ch_id = ascii_hex(buf->ch_id);
	rzi033s.answer = ascii_hex(buf->answer);
	return(0);
}
