/*======================================================================
 * File name    : rzi037.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＤＣＡモニタ情報　テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzi037.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi037.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzi037.c 1.3 1996/07/15 15:24:25 hiroki
 *Log: rzi037.c
 * リビジョン 1.3  1996/07/15  15:24:25  hiroki
 * htoc -> htoi
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzi037.h>		/* Show Current		*/
#undef		STORAGE

/*----------------------------------------------------------------------*/
/*	rz_scan_dca_monitor						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ＤＣＡモニター・テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_dca_monitor(
	struct fmt_dca_monitor	*buf
	)
{
	rzi037s.dca_sum_cnt = htoi((char *)buf->dca_sum_cnt);
	rzi037s.bf_cbwt = htol((char *)buf->bf_cbwt);
	rzi037s.af_cbwt = htol((char *)buf->af_cbwt);

	return(0);
}
