/*======================================================================
 * File name    : rzi034.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	金属検出機テスト結果テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzi034.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi034.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/rcs/rzi034.c 1.1 1994/07/08 13:30:26 hiroe
 *Log: rzi034.c
 * リビジョン 1.1  1994/07/08  13:30:26  hiroe
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzi033.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_metal_answer						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	金属検出機テスト結果をテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_metal_answer)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_metal_answer(
	struct fmt_metal_answer	*txt,
	struct rzi033t		*pkt
	)
{

	txt->ch_id = hex_ascii(pkt->ch_id);
	txt->answer = hex_ascii(pkt->answer);
	return(++txt);
}
