/*======================================================================
 * File name    : rzi103.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	本体状態情報拡張パラメータテキスト解読（拡張２）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzi103.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi103.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzi103.c 1.2 1996/07/15 15:02:13 hiroki
 *Log: rzi103.c
 * リビジョン 1.2  1996/07/15  15:02:13  hiroki
 * 誤記修正
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzi103.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_dump_cnt						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	組み合わせ計量結果テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_dump_cnt(
	struct fmt_dump_cnt	*buf
	)
{
	rzi103s.dump_cnt = htoc( (char *)buf->dump_cnt);
	rzi103s.dump_flag = ascii_hex( buf->dump_flag);

	return(0);
}
