/*======================================================================
 * File name    : rzi104.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	組み合わせ計算結果拡張パラメータテキスト作成（拡張１）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzi104.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi104.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzi104.c 1.2 1996/07/15 15:28:31 hiroki
 *Log: rzi104.c
 * リビジョン 1.2  1996/07/15  15:28:31  hiroki
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzi103.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_dump_cnt						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	組み合わせ計算結果テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_dump_cnt)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_dump_cnt (
	struct fmt_dump_cnt	*txt,
	struct rzi103t		*pkt
	)
{
	ctoh( pkt->dump_cnt, (char *)&txt->dump_cnt);
	txt->dump_flag	= hex_ascii(pkt->dump_flag);

	return(++txt);
}
