/*======================================================================
 * File name    : rzr097.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	予約番号変更完了テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr097.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr097.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/rcs/rzr097.c 1.1 1998/05/13 16:25:21 chimura
 *Log: rzr097.c
 * リビジョン 1.1  1998/05/13  16:25:21  chimura
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr097.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_prenum_comp						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	予約番号変更完了テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_prenum_comp(
	struct fmt_prenum_comp	*buf
	)
{
	rzr097s.ch_id = ascii_hex(buf->ch_id);
	return(0);
}
