/*======================================================================
 * File name    : rzr074.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ダミー計量開始テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr074.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr074.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr074.c 1.1 1995/04/24 20:35:39 sakagami
 *Log: rzr074.c
 * リビジョン 1.1  1995/04/24  20:35:39  sakagami
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr073.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_dummy_weight						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ダミー計量開始構造体のデータをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_dummy_weight)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_dummy_weight(
	struct fmt_dummy_weight	*txt,
	struct rzr073t		*pkt
	)
{
	txt->ch_id = hex_ascii(pkt->ch_id);
	return(++txt);
}
