/*======================================================================
 * File name    : rzr067.c
 * Original	: rzr065.c Rev.1.1
 *----------------------------------------------------------------------
 * Function	:
 *	金属検出機テストのテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr067.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr067.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/rcs/rzr067.c 1.1 1994/07/08 13:30:41 hiroe
 *Log: rzr067.c
 * リビジョン 1.1  1994/07/08  13:30:41  hiroe
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr067.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_metal_text						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	金属検出機テストのテキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_metal_text(
	struct fmt_metal_text	*buf
	)
{
	rzr067s.ch_id = ascii_hex(buf->ch_id);
	rzr067s.nof_head = htoc((char *)&buf->nof_head);
	rzr067s.function = ascii_hex(buf->function);
	return(0);
}
