/*======================================================================
 * File name    : rzr066.c
 * Original	: rzr028.c Rev.2.1
 *----------------------------------------------------------------------
 * Function	:
 *	ユーザレベルのテキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr066.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr066.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr066.cv  1.2  94/06/14 13:22:46  hiroe
 *Log: p:/lib/rzcmdx/src/rcs/rzr066.cv
 * Revision 1.2  94/06/14 13:22:46  hiroe
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr065.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_usr_level						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ユーザレベルの構造体データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_usr_level)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_usr_level(
	struct fmt_usr_level	*txt,
	struct rzr065t		*pkt
	)
{
	txt->usr_level = hex_ascii(pkt->usr_level);
	return(++txt);
}
