/*======================================================================
 * File name    : rzr095.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *　マルチ連動拡張パラメータテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr095.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr095.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr095.c 1.2 1997/12/04 13:34:11 itami
 *Log: rzr095.c
 * リビジョン 1.2  1997/12/04  13:34:11  itami
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr095.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/* 	rz_scan_mlt_ext							*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	マルチ連動拡張パラメータのテキストを構造体にセーブする。   　　	*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_mlt_ext (
	struct fmt_mlt_ext	*buf
	)
{
	rzr095s.s_cmd	= ascii_hex( buf->s_cmd);
	rzr095s.p1	= htoc( (char *)buf->p1);
	rzr095s.p2	= htoc( (char *)buf->p2);
	rzr095s.p3	= htoc( (char *)buf->p3);
	rzr095s.p4	= htoc( (char *)buf->p4);

	return(0);
}
