/*======================================================================
 * File name    : rzr078.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＡＴＡ偏差　　　　テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr078.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr078.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr078.c 1.2 1996/07/12 19:41:00 hiroki
 *Log: rzr078.c
 * リビジョン 1.2  1996/07/12  19:41:00  hiroki
 * ATA96仕様（変更箇所無し）
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr077.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_ata_dev						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ＡＴＡ偏差　をテキストに変換する。 			   	*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_ata_dev)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_ata_dev (
	struct fmt_ata_dev     	*txt,
	struct rzr077t		*pkt
	)
{
	txt->ch_id = hex_ascii( pkt->ch_id );
	ltoh( (unsigned long)pkt->ata_dev, (char *)&txt->ata_dev );

	return(++txt);
}
