/*======================================================================
 * File name    : rzr070.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	サンプル排出仕様テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr070.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr070.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/rcs/rzr070.c 1.1 1994/09/23 20:18:00 hiroe
 *Log: rzr070.c
 * リビジョン 1.1  1994/09/23  20:18:00  hiroe
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr069.h>		/* Show Current		*/

/*----------------------------------------------------------------------*/
/*	rz_print_sample_dump						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	サンプル排出の構成仕様データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信テキスト・バッファへのポインタ    		*/
/*	*pkt	: パラメータ・パケットへのポインタ   			*/
/*									*/
/* 戻り値								*/
/*	int	: buf+sizeof(fmt_mch_construct)	･･･ 正常終了		*/
/*----------------------------------------------------------------------*/

void *
rz_print_sample_dump(
	struct fmt_sample_dump	*txt,
	struct rzr069t		*pkt
	)
{
	txt->ch_id = hex_ascii( pkt->ch_id );
	ltoh( pkt->sect_assign_ptn, (char *)txt->sect_assign_ptn );
	return(++txt);

}
