/*======================================================================
 * File name    : rzr084.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	シフトデータ参照（要求）仕様テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr084.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr084.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr084.c 1.1 1996/12/19 10:05:30 hiroki
 *Log: rzr084.c
 * リビジョン 1.1  1996/12/19  10:05:30  hiroki
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr083.h>		/* Show Current		*/

/*----------------------------------------------------------------------*/
/*	rz_print_shift_mon						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	シフトデータ参照（要求）仕様を構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信テキスト・バッファへのポインタ    		*/
/*	*pkt	: パラメータ・パケットへのポインタ   			*/
/*									*/
/* 戻り値								*/
/*	int	: buf+sizeof(fmt_mch_construct)	･･･ 正常終了		*/
/*----------------------------------------------------------------------*/

void *
rz_print_shift_mon(
	struct fmt_shift_mon	*txt,
	struct rzr083t		*pkt
	)
{
	txt->ch_id 	= hex_ascii(pkt->ch_id);
	txt->req_type 	= hex_ascii(pkt->req_type);
	ctoh( pkt->data_page, (char *)txt->data_page );
	return(++txt);
}
