/*======================================================================
 * File name    : rzr065.c
 * Original	: rzr027.c Rev.2.1
 *----------------------------------------------------------------------
 * Function	:
 *	ユーザレベルのテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr065.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr065.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr065.cv  1.2  94/06/14 13:19:26  hiroe
 *Log: p:/lib/rzcmdx/src/rcs/rzr065.cv
 * Revision 1.2  94/06/14 13:19:26  hiroe
 * ワーニング修正
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr065.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_usr_level						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ユーザレベルのテキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_usr_level(
	struct fmt_usr_level	*buf
	)
{
	rzr065s.usr_level = ascii_hex(buf->usr_level);
	return(0);
}
