/*======================================================================
 * File name    : rzr075.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *　ＤＣＡパラメータコマンド　　　　  テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr075.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr075.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr075.c 1.3 1996/07/12 19:19:54 hiroki
 *Log: rzr075.c
 * リビジョン 1.3  1996/07/12  19:19:54  hiroki
 * フリトパラをＤＣＡパラに変更
 * ATA96仕様
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr075.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/* 	rz_scan_dca_parm						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ＤＣＡパラメータコマンドのテキストを構造体にセーブする。    　　*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_dca_parm (
	struct fmt_dca_parm	*buf
	)
{
	rzr075s.dca_on_off = ascii_hex( buf->dca_on_off);
	rzr075s.dca_cycle  = htoi( (char *)buf->dca_cycle);
	rzr075s.dca_owf    = htoc( (char *)buf->dca_owf);
	rzr075s.dca_sdm    = htoc( (char *)buf->dca_sdm);

	return(0);
}
