/*======================================================================
 * File name    : rzr077.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *　ＡＴＡ偏差  テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr077.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr077.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr077.c 1.3 1996/07/12 19:31:37 hiroki
 *Log: rzr077.c
 * リビジョン 1.3  1996/07/12  19:31:37  hiroki
 * ATA96仕様（修正無し）
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr077.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/* 	rz_scan_ata_dev     						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ＡＴＡ偏差のテキストを構造体にセーブする。		    　　*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_ata_dev (
	struct fmt_ata_dev	*buf
	)
{
	rzr077s.ch_id	= ascii_hex( buf->ch_id);
	rzr077s.ata_dev	= htol( (char *)buf->ata_dev);

	return(0);
}
