/*======================================================================
 * File name    : rzr090.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	マルチ連動パラメータ1要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr090.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr090.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr090.c 1.2 1997/11/19 18:44:34 itami
 *Log: rzr090.c
 * リビジョン 1.2  1997/11/19  18:44:34  itami
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr089.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_mlt_p1req						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	マルチ連動パラメータ1要求構造体のデータをテキストに変換する。	*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_span_adj)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_mlt_p1req(
	struct fmt_mlt_p1req	*txt,
	struct rzr089t		*pkt
	)
{
	txt->ch_id = hex_ascii( pkt->ch_id );
	return(++txt);
}
