/*======================================================================
 * File name    : rzr194.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	マルチ連動パラメータ２拡張パラメータ（１）テキスト作成
 *	補正方向
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr194.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr194.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr194.c 1.1 1970/01/01 00:00:00 itami
 *Log: rzr194.c
 * リビジョン 1.1  1970/01/01  00:00:00  itami
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-SHI
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr193.h>		/* Show Current		*/

/*----------------------------------------------------------------------*/
/*	rz_print_mlt_parm2_ext						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	補正方向構造体データをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_prec_dump)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_mlt_parm2_ext(
	struct fmt_mlt_parm2_ext	*txt,
	struct rzr193t			*pkt
	)
{
	BYTE	*buf;
	int	i, j;

	ctoh(pkt->nof_mch, (char *)&txt->nof_mch);

	buf = (PTR)txt->node_id[0];
	for(i = pkt->nof_mch, j = 0 ; i ; i--, j++) {
		ctoh(pkt->node_id[j], (char *)buf);
		buf += sizeof(txt->node_id[0]);
	}
	return buf;
}
