/*======================================================================
 * File name    : rzr135.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	スパン調整テキスト解読（拡張）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr135.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr135.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/rcs/rzr135.c 1.1 1997/01/08 09:00:20 chimura
 *Log: rzr135.c
 * リビジョン 1.1  1997/01/08  09:00:20  chimura
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr135.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_span_date						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	スパン校正テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_span_date(
	struct fmt_span_date	*buf
	)
{
	rzr135s.date = htol((char *)&buf->date);
	rzr135s.time = htol((char *)&buf->time);
	return(0);
}
