/*======================================================================
 * File name    : rzr109.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計量特性テキスト解読（拡張１）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr109.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr109.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src//RCS/rzr109.c 1.2 1996/10/14 11:45:48 hiroki
 *Log: rzr109.c
 * リビジョン 1.2  1996/10/14  11:45:48  hiroki
 * 関数名がベースとなる関数名から変更されていなかった不具合を修正する。
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr109.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_left_weight						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	秤計量特性テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_left_weight(
	struct fmt_left_weight	*buf
	)
{
	rzr109s.left_weight_cnt = htoi( (char *)buf->left_weight_cnt );
	return(0);
}
