/*======================================================================
 * File name    : rzr136.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	スパン調整テキスト作成（拡張）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr136.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr136.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/rcs/rzr136.c 1.1 1997/01/08 09:00:23 chimura
 *Log: rzr136.c
 * リビジョン 1.1  1997/01/08  09:00:23  chimura
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr135.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_span_date						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	スパン校正構造体のデータをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_span_adj)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_span_date(
	struct fmt_span_date	*txt,
	struct rzr135t		*pkt
	)
{
	ltoh(pkt->date, (char *)&txt->date);
	ltoh(pkt->time, (char *)&txt->time);
	return(++txt);
}
