/*======================================================================
 * File name    : rzr209.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	拡張計量特性テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr209.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr209.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr209.c 1.2 1970/01/01 00:00:00 itami
 *Log: rzr209.c
 * リビジョン 1.2  1970/01/01  00:00:00  itami
 * 2000/12/12 自動零点間隔追加
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr209.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_ph_wei_spec						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	拡張秤計量特性テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_ph_wei_spec(
	struct fmt_ph_wei_spec	*buf
	)
{
	rzr209s.stable_time    	= htoi( (char *)buf->stable_time );
	rzr209s.empty_weight	= htoi( (char *)buf->empty_weight );
	rzr209s.zero_interval  	= htoc( (char *)buf->zero_interval );
	return(0);
}
