/*======================================================================
 * File name    : rzr223.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計量目標拡張パラメータ（２）テキスト解読
 *	特殊アベコン・サイクル／レート
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr223.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr223.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr223.c 1.1 1996/03/19 11:28:46 hiroki
 *Log: rzr223.c
 * リビジョン 1.1  1996/03/19  11:28:46  hiroki
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr223.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_avg_parm						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	特殊アベコン用テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_avg_parm(
	struct fmt_avg_parm	*buf
	)
{

	rzr223s.avg_cycle = htoc((char *)buf->avg_cycle);
	rzr223s.avg_ratio = htoc((char *)buf->avg_ratio);

	return 0;
}
