/*======================================================================
 * File name    : rzr224.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計量目標拡張パラメータ（２）テキスト作成
 *	特殊アベコン（サイクル、レート）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr224.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr224.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr224.c 1.1 1996/03/19 11:57:45 hiroki
 *Log: rzr224.c
 * リビジョン 1.1  1996/03/19  11:57:45  hiroki
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr223.h>		/* Show Current		*/

/*----------------------------------------------------------------------*/
/*	rz_print_avg_parm						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	アベレージ・サイクル／レートの構造体をテキストに変換する	*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_prec_dump)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_avg_parm(
	struct fmt_avg_parm 	*txt,
	struct rzr223t		*pkt
	)
{
	ctoh(pkt->avg_cycle, (char *)&txt->avg_cycle);
	ctoh(pkt->avg_ratio, (char *)&txt->avg_ratio);

	return(++txt);
}
