/*======================================================================
 * File name    : rzr212.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	組合せ計算拡張パラメータテキスト（２）作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr212.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr212.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr212.c 1.3 1994/09/20 10:25:26 hiroe
 *Log: rzr212.c
 * リビジョン 1.3  1994/09/20  10:25:26  hiroe
 * char -> short
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr211.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_approval_sub						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	検定に必要な構造体データをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_cbcal_spec)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_approval_sub(
	struct fmt_approval_sub	*txt,
	struct rzr211t		*pkt
	)
{
	itoh( pkt->e1_ad, (char *)txt->e1_ad );
	return(++txt);
}
