/*======================================================================
 * File name    : rzr017.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	タイミングテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr317.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr317.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src//RCS/rzr317.c 1.1 1996/11/22 19:10:54 hiroe
 *Log: rzr317.c
 * リビジョン 1.1  1996/11/22  19:10:54  hiroe
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr317.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_round_tmg						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	WH用のラウンディングテキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_round_tmg(
	struct fmt_round_tmg	*buf
	)
{
	int	i;

	rzr317s.nof_round    = ascii_hex( buf->nof_round );
	for(i = 0; i < rzr317s.nof_round; i++) {
		rzr317s.round_base[i] = htoc( (char *)buf->round_base[i] );
	}
	return(0);
}
