/*======================================================================
 * File name    : rzr312.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	組合せ計算拡張パラメータテキスト（３）作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr312.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr312.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr312.c 1.1 1996/07/15 12:10:33 hiroki
 *Log: rzr312.c
 * リビジョン 1.1  1996/07/15  12:10:33  hiroki
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr311.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_max_scale						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	MAX SCALE(ATA96)                               			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_max_scale)     ... 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_max_scale(
	struct fmt_max_scale    *txt,
	struct rzr311t		*pkt
	)
{
	txt->max_scale = hex_ascii(pkt->max_scale );
	return(++txt);
}
