/*======================================================================
 * File name    : rzr324.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計量目標拡張パラメータ（３）テキスト作成
 *	ＷＨ不良排出設定（各セクション）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr324.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr324.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr324.c 1.2 1996/04/02 19:49:13 hiroki
 *Log: rzr324.c
 * リビジョン 1.2  1996/04/02  19:49:13  hiroki
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr323.h>		/* Show Current		*/

/*----------------------------------------------------------------------*/
/*	rz_print_err_div_wh						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ＷＨ不良排出設定（各セクション）の構造体をテキストに変換する	*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_prec_dump)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_err_div_wh(
	struct fmt_err_div_wh 	*txt,
	struct rzr323t		*pkt
	)
{
	BYTE	*buf;
	int	i, j;

	txt->nof_sect = hex_ascii(pkt->nof_sect);

	buf = (BYTE_PTR)txt->div[0];
	for(i = pkt->nof_sect, j = 0 ; i ; i--, j++) {
		*buf = hex_ascii(pkt->div[j]);
		buf += sizeof(txt->div[0]);
	}
	return buf;
}
