/*======================================================================
 * File name    : rzr323.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計量目標拡張パラメータ（３）テキスト解読
 *	ＷＨ不良排出設定（各セクション）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr323.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr323.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr323.c 1.3 1996/04/03 09:45:58 hiroki
 *Log: rzr323.c
 * リビジョン 1.3  1996/04/03  09:45:58  hiroki
 * コメント修正
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr323.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_err_div_wh						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ＷＨ不良排出設定（各セクション）テキストを構造体にセーブする。	*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_err_div_wh(
	struct fmt_err_div_wh	*buf
	)
{
	int	i, n;

	n = rzr323s.nof_sect = ascii_hex(buf->nof_sect);
	for (i = 0; i < n; ++i) {
		rzr323s.div[i] = ascii_hex(buf->div[i][0]);
	}
	return 0;
}
