/*======================================================================
 * File name    : rzr424.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計量目標拡張パラメータ（４）テキスト作成
 *	ＡＴＡ　ＳＡＭＰＬＥ　ＳＩＺＥ
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr424.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr424.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr424.c 1.3 1996/07/17 17:18:33 hiroki
 *Log: rzr424.c
 * リビジョン 1.3  1996/07/17  17:18:33  hiroki
 * プリセット番号追加
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr423.h>		/* Show Current		*/

/*----------------------------------------------------------------------*/
/*	rz_print_sample_size						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ata sample size の構造体をテキストに変換する			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_sample_size)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_sample_size(
	struct fmt_sample_size 	*txt,
	struct rzr423t		*pkt
	)
{
	itoh( pkt->sample_size, (char *)&txt->sample_size);
	ctoh( pkt->preset_num, (char *)&txt->preset_num);
	return (++txt);
}
