/*======================================================================
 * File name    : rzr412.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	組合せ計算拡張パラメータテキスト（４）作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr412.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr412.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src//RCS/rzr412.c 1.1 1996/10/14 21:06:19 hiroki
 *Log: rzr412.c
 * リビジョン 1.1  1996/10/14  21:06:19  hiroki
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr411.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_wh_change						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ホッパ取り替えビットパターン　                    		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_wh_change)     ... 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_wh_change(
	struct fmt_wh_change    *txt,
	struct rzr411t		*pkt
	)
{
	ltoh( pkt->wh_chg_ptn, (char *)&txt->wh_chg_ptn );
	return(++txt);
}
