/*======================================================================
 * File name    : rzr423.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計量目標拡張パラメータ（４）テキスト解読
 *	ATA SAMPLE SIZE
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr423.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr423.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr423.c 1.2 1996/07/17 17:16:59 hiroki
 *Log: rzr423.c
 * リビジョン 1.2  1996/07/17  17:16:59  hiroki
 * プリセット番号追加
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr423.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_sample_size						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ATA SAMPLE SIZE    テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_sample_size(
	struct fmt_sample_size	*buf
	)
{
	rzr423s.sample_size	= htoi( (char *)buf->sample_size);
	rzr423s.preset_num = htoc( (char *)buf->preset_num);

	return 0;
}
