/*======================================================================
 * File name    : dcfid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function		: ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: dcfid.c $
 * リビジョン 1.3  1970/01/01  00:00:00  sakaguti
 * 05.03.18 CD_CHKをBIOSに移動
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2005/02/23
 * ファイルシステムsave60用にerase_sectを追加する
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * dcfid.c追加
 * 
 *----------------------------------------------------------------------
 *				(c) Copyright 2002, ISHIDA CO., LTD.
 *				959-1 SHIMOMAGARI RITTO-CITY
 *				SHIGA JAPAN
 *				(077) 553-4141
 *======================================================================
 */

const char * const dcfid = "$Header: p:/presto2/shlib_v7/drive/cf/rcs/dcfid.c 1.3 1970/01/01 00:00:00 sakaguti Exp $";
