/*======================================================================
 * File name    : wuptsk.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/rcs/wuptsk.c 1.2 1970/01/01 00:00:00 chimura Exp $
 *$Log: wuptsk.c $
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2005/06/02 09:45
 * wuptsk.c
 * RX116と互換のため、タスクIDが0のとき、エラーを返す。
 * NORTiでは、タスクIDが0のとき自タスクを起床する。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"

static int id_zero,ext_cnt[2],errcode;

/*----------------------------------------------------------------------*/
/*	WUP_TSK								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	タスクの起床。タスクのアセスアドレスをタスクＩＤとしてシステム	*/
/*	コールを行う。システムコールの戻り値（エラーコード）をコンバー	*/
/*	トして返す。							*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	tskaa	: タスクのアクセスアドレス				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -n	･･･ error code					*/
/*----------------------------------------------------------------------*/
int get_ext_cnt(int ch) {
	return(ext_cnt[ch]);
}
int get_id_zero(void) {
	return(errcode);
}

int
WUP_TSK(
	unsigned int	tskaa
	)
{
	int err;

	if(!tskaa) {
		id_zero++;	
		return(0x05);	/* rx116との互換のため、エラーを返す*/
					/* NORTi では、ID 0で自タスクを起床する*/
	}
	if(tskaa == 77 || tskaa ==115) {
		ext_cnt[0]++;
	}
	if(tskaa == 78 || tskaa ==116) {
		ext_cnt[1]++;
	}
	err = wup_tsk( (ID)tskaa);
	if(err && (tskaa == 77 || tskaa == 78 || tskaa == 115 || tskaa == 116)) {
		errcode = err;
	}
	return( err_code( err));

}
