/*======================================================================
 * File name    : marcid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: marcid.c $
 * リビジョン 1.2  1970/01/01  00:00:00  sakaguti
 * 2003/08/05 compiler ver7 vup
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * VxWorksとshlibのインターフェース
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*marcid = "$Header: p:/presto2/shlib_v7/misc/arcnet/RCS/marcid.c 1.2 1970/01/01 00:00:00 sakaguti Exp $";
