/*----------------------------------------------------------------------*
 * File name	: usrkint.c	/ user key interrupt			*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/mon/presto/RCS/usrkint.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: usrkint.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*
 *Header: p:/presto/shlib_v7/mon/src/rcs/usrkint.c 1.1 1970/01/01
 *Log: usrkint.c
 *----------------------------------------------------------------------*/
/*		(c) Copyright 1993, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN			*/
/*		SHIGA JAPAN						*/
/*		(0775) 53-4141						*/
/*----------------------------------------------------------------------*/

#include	<stddef.h>			/* ANSI std		*/
#include	<stdio.h>			/*	"		*/
#include	<conio.h>			/* MS-C			*/
#include	<dos.h>				/*	"		*/
#include	"functbl.h"			/* Current		*/
#define STORAGE
#include	"usrkint.h"			/*	"		*/
#undef	STORAGE

static void (_interrupt *orgfunc)() =	/* 元のDOSのkeyﾊﾝﾄﾞﾗへのﾎﾟｲﾝﾀ	*/
		(void far *)0;

/*----------------------------------------------------------------------*/
/*	user_key_int							*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	ユーザー定義の割り込みキーハンドラ。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	void	: 無し							*/
/*									*/
/* 戻り値								*/
/*	void	: 無し							*/
/*----------------------------------------------------------------------*/

static void _interrupt
user_key_int(void)
{

}

/*----------------------------------------------------------------------*/
/*	dos_vector_swap							*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	割り込みキーの割り込みベクタを、ユーザーのハンドラとスワップ	*/
/*	する。								*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	user_func	: ﾌﾟﾛｼｰｼﾞｬへのfarﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	void		: 無し						*/
/*----------------------------------------------------------------------*/

void
dos_vector_swap(
	void	(_interrupt *user_func)()
	)
{
	if(orgfunc != NULL)  return;
	orgfunc = _dos_getvect(USER_KEY);
	_dos_setvect(USER_KEY, user_func);
	printf("\nSwap %s -- [User INT key]", key_msg[USER_KEY-KEY_TOP]);
}

/*----------------------------------------------------------------------*/
/*	dos_vector_reset						*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	割り込みキーの割り込みベクタを、DOSのベクターに戻す。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	void	: 無し							*/
/*									*/
/* 戻り値								*/
/*	void	: 無し							*/
/*----------------------------------------------------------------------*/

void
dos_vector_reset(void)
{
	if(orgfunc == NULL)  return;
	_dos_setvect(USER_KEY, orgfunc);
	orgfunc = NULL;
	printf("\nReboot vector %s", key_msg[USER_KEY -KEY_TOP]);
}
