/*======================================================================
 * File name    : findclse.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/api/RCS/findclse.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: findclse.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_FindClose                                                    */
/*         ：                                                                 */
/* パラメタ：IN:  long 検索ハンドル                                           */
/*         ：                                                                 */
/*         ：OUT:                                                             */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：正常終了  DFMR_SUC                                               */
/*         ：異常終了  DFMR_ERR                                               */
/*         ：                                                                 */
/* 概    要：ディレクトリ/ファイル検索終了                                    */
/*         ：                                                                 */
/* 作 成 日：2004.05.31                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/

#include "fsbase.h"

int FMR_FindClose ( 
	long srchhandle                     /* 検索ハンドル                       */
)
{
	F_INT l_ortn;                       /* OS部戻り値                         */

	F_BYTE l_drvnum;                    /* 論理ドライブ番号                   */

	/**************************************************************************/
	/* パラメータチェック                                                     */
	/**************************************************************************/
	/* 検索ハンドルの確認 */
	if( ( srchhandle < 0 ) || ( DFMR_USR_MAXSEARCHHANDLE <= srchhandle ) )
	{
		/* 検索ハンドルが範囲外の場合 */
		return DFMR_ENOENT;
	}
	
	if( tfmr_searchhandle[ srchhandle ].sectornum == 0xFFFFFFFF )
	{
		/* 検索ハンドルに検索情報が関連付けされていない場合 */
		return DFMR_ENOENT;
	}
	
	/* 論理ドライブ番号取得 */
	l_drvnum = tfmr_searchhandle[ srchhandle ].drivenum;
	/**************************************************************************/
	/* セマフォ資源獲得                                                       */
	/**************************************************************************/
	l_ortn = FMR_osWaiSem(
		MFMR_SEMID( l_drvnum )
		);
	if( l_ortn != DFMR_OK )
	{
		return l_ortn;
	}
	/**************************************************************************/
	/* 検索ハンドル初期化                                                     */
	/**************************************************************************/
	FMR_initSearchHandle(
		srchhandle                      /* 検索ハンドル番号                   */
		);
	/**************************************************************************/
	/* セマフォ資源返却                                                       */
	/**************************************************************************/
	l_ortn = FMR_osSigSem(
		MFMR_SEMID( l_drvnum )
		);
	if( l_ortn != DFMR_OK )
	{
		return l_ortn;
	}
	/**************************************************************************/
	/* 正常終了返却                                                           */
	/**************************************************************************/
	return DFMR_SUC;
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
