/*======================================================================
 * File name    : osgetime.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/os/itron/RCS/osgetime.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: osgetime.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_osGetTime                                                    */
/*         ：                                                                 */
/* パラメタ：OUT: F_WORD * 取得年月日設定領域                                 */
/*         ：     F_WORD * 取得時分秒設定領域                                 */
/*         ：     F_BYTE * 取得ミリ秒設定領域                                 */
/*         ：                                                                 */
/* 戻 り 値：NONE                                                             */
/*         ：                                                                 */
/* 概    要：OSから日付時刻を取得する                                         */
/*         ：127年12月31日23時59分58秒まで                                    */
/*         ：                                                                 */
/* 前提条件：①システム時刻開始(カウンタ0)を1985年01月01日00時00分00秒とする  */
/*         ：②グレゴリオ暦用                                                 */
/*         ：                                                                 */
/* 作 成 日：2004.05.26                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/******************************************************************************/

#include "fsbase.h"
#include "os.h"
#include "fs_date.h"

F_VOID FMR_osGetTime(
    F_WORD * setday,                    /* 取得年月日設定領域                 */
    F_WORD * settime,                   /* 取得時分秒設定領域                 */
    F_BYTE * setmtime                   /* 取得ミリ秒設定領域                 */
)
{
	DATE_INFO date;

	fs_get_date(&date);
	fs_get_time(&date);

	*( settime ) = (F_WORD)(date.second / 2);
	*( settime ) |= (F_WORD)(date.minute << 5);
	*( settime ) |= (F_WORD)(date.hour << 11);

	*( setday ) = (F_WORD)date.day;
	*( setday ) |= (F_WORD)(date.month << 5);
	*( setday ) |= (F_WORD)((date.year - 60) << 9);
	
	if( setmtime != NULL )
	{
		*( setmtime ) = 0;	/* 取得ミリ秒はOとする           */
	}
}

/******************************************************************************/
/*      Unpublished Copyright (C) 2003      ウェスコム株式会社                */
/******************************************************************************/
