/*----------------------------------------------------------------------*
 * File name	: getpol.c	/ flash rom polling status read			*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/biosif/flash/rcs/getpol.c 1.1 1970/01/01 00:00:00 sakaguti Exp $
 *$Log: getpol.c $
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * ５種新関数追加
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY				*/
/*		SHIGA JAPAN						*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	FLASH ROMのポーリング・ステータスを読み出す。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	なし			*/
/*									*/
/* 戻り値								*/
/*	UH:ポーリング・ステータス				*/
/*----------------------------------------------------------------------*/

#include	<kernel.h>
#include	<biosif\iosvc.h>		/* Show biosif		*/
#include	<dos.h>

UH
_get_polling(void)
{
	UH	err;
	
	err = (UH)trapa_svc(VECTOR_FROM, 0x6);
	return(err);
}
