/*----------------------------------------------------------------------*
 * File name	: setmod.c	/ flash rom mode command set			*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/biosif/flash/rcs/setmod.c 1.1 1970/01/01 00:00:00 sakaguti Exp $
 *$Log: setmod.c $
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * ５種新関数追加
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY				*/
/*		SHIGA JAPAN						*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	FLASH ROMにコマンドをセットする。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	cmd	: コマンド				*/
/*									*/
/* 戻り値								*/
/*	なし					*/
/*----------------------------------------------------------------------*/

#include	<kernel.h>
#include	<biosif\iosvc.h>		/* Show biosif		*/
#include	<dos.h>

void
_set_mode(UH cmd)
{
	trapa_svc(VECTOR_FROM, 0x4, cmd);
}
