/*======================================================================
 * File name    : marcid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: dmuid.c $
 * リビジョン 1.6  1970/01/01  00:00:00  chimura
 * 2005/01/24 scuio,eesrom,pio関係のファイルを削除　biosif経由とする。
 * 
 * リビジョン 1.5  1970/01/01  00:00:00  sakaguti
 * DIPSW関数でONの時1出力にする
 * 
 * リビジョン 1.4  1970/01/01  00:00:00  sakaguti
 * ID名をmdmuidにする
 * 
 * リビジョン 1.3  1970/01/01  00:00:00  sakaguti
 * FPGA-FIFOﾄﾞﾗｲﾊﾞ追加
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  sakaguti
 * 2003/11/11 compiler ver7 vup
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * LOG MESSAGE
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*mdmuid = "$Header: p:/presto2/shlib_v7/misc/dmu5562/RCS/dmuid.c 1.6 1970/01/01 00:00:00 chimura Exp $";
