/*======================================================================
 * File name    : dscuid.c
 * Original	: p:/presto2/shlib_v7/drive/scu/sh7706/scu/RCS/dscuid.c 1.7
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: dscuid.c $
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2006/03/20
 * 1文字受信できない不具合修正。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

char	*dscuid = "$Header: p:/presto2/shlib_v7/drive/scu/sh7706/scum/RCS/dscuid.c 1.2 1970/01/01 00:00:00 chimura Exp $";
