/*----------------------------------------------------------------------*
 * File name	: bbp2abp.c	/ binary ptn to ascii ptn convert	*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/custom/src/rcs/bbp2abp.c 1.2 1970/01/01 00:00:00 hiroe Exp $
 *$Log: bbp2abp.c $
 * リビジョン 1.2  1970/01/01  00:00:00  hiroe
 * 2009/04/01
 * ビッグエンディアンに対応する
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN		*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	バイナリーのビットパターンbbp[]をLSBより4bitニブル単位で	*/
/*	ASCII(0x30:'0'-0x3f:'?')に変換し、abp[]に指定バイト数スト	*/
/*	アーする。							*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	abp[]	: ASCIIﾋﾞｯﾄﾊﾟﾀｰﾝ出力先へのﾎﾟｲﾝﾀ				*/
/*	bbp[]	: 入力するﾊﾞｲﾅﾘｰ･ﾋﾞｯﾄﾊﾟﾀｰﾝへのﾎﾟｲﾝﾀ			*/
/*	len	: 変換するASCIIﾋﾞｯﾄﾊﾟﾀｰﾝのﾊﾞｲﾄ数			*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ successful complete				*/
/*		  -1	･･･ error code					*/
/*----------------------------------------------------------------------*/

int
bbp2abp(
	char	*abp,
	char	*bbp,
	int	len
	)
{
	int	i= 0;

	if( (len *= 2) == 0)				return(-1);
/* --- リトルエンディアン
	do {
		if(i & 0x1)  *abp = (char)(((*(bbp++) & 0xf0)>>4)|'0');
		else	     *abp = (char)(((*bbp & 0x0f))|'0');
		abp++;
	} while(++i < len);
*/
/* --- ビッグエンディアン*/
	bbp += (len/2-1);
	do {
		if(i & 0x1)  *abp = (char)(((*(bbp--) & 0xf0)>>4)|'0');
		else	     *abp = (char)(((*bbp & 0x0f))|'0');
		abp++;
	} while(++i < len);

	return(0);
}
