/*----------------------------------------------------------------------*
 * File name	: cksmcpl.c	/ 					*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/custom/src/RCS/cksmcpl.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: cksmcpl.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN		*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	buffで示されるバッファの指定バイト数をバイト加算し、その	*/
/*	２の補数を返す。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buff		: ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*	len		: ﾊﾞｲﾄ数					*/
/*									*/
/* 戻り値								*/
/*	unsigned char	: 計算結果					*/
/*----------------------------------------------------------------------*/

unsigned char
cksum_cpl(
	unsigned char	*buff,
	int		len
	)
{
	unsigned char	sum = (unsigned char)0;

	while( len-- ) {
		sum += *buff;
		++buff;
	}
	sum = (unsigned char)~sum;
	++sum;
	return(sum);
}
