/*----------------------------------------------------------------------*
 * File name	: cksmapl.c	/ 					*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/custom/src/RCS/cksmalp.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: cksmalp.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN		*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	buffで示されるバッファの指定バイト数の内アルファニューメ	*/
/*	リック･データのみをバイト加算し、その結果を返す。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buff		: ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*	len		: ﾊﾞｲﾄ数					*/
/*									*/
/* 戻り値								*/
/*	unsigned char	: 計算結果					*/
/*----------------------------------------------------------------------*/

unsigned char
cksum_alpha(
	unsigned char	*buff,
	int		len
	)
{
	unsigned char	sum = (unsigned char)0;

	while( len-- ) {
		if(*buff & 0xe0)  sum += *buff;
		++buff;
	}
	return(sum);
}
