/*----------------------------------------------------------------------*
 * File name	: htoi.c	/ convert ascii hex to binary		*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/custom/src/RCS/htoi.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: htoi.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN		*/
/*		(0775) 53-4141						*/
/*----------------------------------------------------------------------*/


/*----------------------------------------------------------------------*/
/*	htoi								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	4byteのHEX ASCIIをshort型に変換する。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buff	: HEX ASCII文字列へのポインタ				*/
/*									*/
/* 戻り値								*/
/*	int	: 変換後の値						*/
/*----------------------------------------------------------------------*/

unsigned short
htoi(
	char	*buff
	)
{
	int		j;
	unsigned short	i;

	i = (unsigned short)0;
	for(j=0; j<4; j++) {
		if(*buff >= 'A') 	i = (unsigned short)(i*16 + *buff - 'A' + 10);
		else if((*buff >= '0') && (*buff <= '9'))
					i = (unsigned short)(i*16 + *buff - '0');
		buff++;
	}
	return(i);
}

/*----------------------------------------------------------------------*/
/*	htoc								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	2byteのHEX ASCIIをchar型に変換する。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buff	: HEX ASCII文字列へのポインタ				*/
/*									*/
/* 戻り値								*/
/*	char	: 変換後の値						*/
/*----------------------------------------------------------------------*/

unsigned char
htoc(
char	*buff
	)
{
	int		j;
	unsigned char	i;

	i = (unsigned char)0;
	for(j=0; j<2; j++) {
		if(*buff >= 'A') 	i = (unsigned char)(i*16 + *buff - 'A' + 10);
		else if((*buff >= '0') && (*buff <= '9'))
					i = (unsigned char)(i*16 + *buff - '0');
		buff++;
	}
	return(i);
}

/*----------------------------------------------------------------------*/
/*	htol								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	8byteのHEX ASCIIをlong型に変換する。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buff	: HEX ASCII文字列へのポインタ				*/
/*									*/
/* 戻り値								*/
/*	long	: 変換後の値						*/
/*----------------------------------------------------------------------*/

unsigned long
htol(
	char	*buff
	)
{
	int		j;
	unsigned long	i;

	i = 0;
	for(j=0; j<8; j++) {
		if(*buff >= 'A') 	i = i*16 + *buff - 'A' + 10;
		else if((*buff >= '0') && (*buff <= '9'))
					i = i*16 + *buff - '0';
		buff++;
	}
	return(i);
}
