/*----------------------------------------------------------------------*
 * File name	: putchar.c		/ romable putchar						*
 *----------------------------------------------------------------------*
 *$Header: p:/h8lib/rom/src/rcs/putchar.c 1.1 1996/01/19 09:47:02 kabumoto Exp $
 *$Log: putchar.c $
 * リビジョン 1.1  1996/01/19  09:47:02  kabumoto
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		chr	: 書き込みを行うｷｬﾗｸﾀ										*/
/*																		*/
/* 戻り値																*/
/*		int	: 書き込みを行った文字	･･･ complete						*/
/*			  EOF					･･･ fail							*/
/*----------------------------------------------------------------------*/

int	putchar(char	c)
{
	int			len;

	if(((len= putch(c)) == -1)||(len == -2))		return(-1);
	return(c);
}
