/*----------------------------------------------------------------------*
 * File name	: putch.c	/ romable putch								*
 *----------------------------------------------------------------------*
 *$Header: p:/h8lib/rom/src/rcs/putch.c 1.1 1996/01/19 16:26:07 kabumoto Exp $
 *$Log: putch.c $
 * リビジョン 1.1  1996/01/19  16:26:07  kabumoto
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/
/* 説明																	*/
/*		STDOUTへ1文字直接書き込みを行う。								*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		chr		: 書き込みを行うｷｬﾗｸﾀ									*/
/*																		*/
/* 戻り値																*/
/*		int		: 書き込みを行った文字数	･･･ complete				*/
/*				  EOF						･･･ fail					*/
/*----------------------------------------------------------------------*/

#include	<rom\handle.h>
#include	<drive\iofsys.h>

int
putch(int	chr)
{
	union {
		int		i;									/* int 型			*/
		char	c[2];								/* char 型			*/
	} u;

	u.i = chr;
	return(iodrv_write[__SCI_-1](1, &u.c[1], sizeof(char)));
}
