/*----------------------------------------------------------------------*
 * File name	: seek.c												*
 *----------------------------------------------------------------------*
 *$Header: p:/h8lib/rom/src/rcs/seek.c 1.1 1996/01/20 12:06:40 kabumoto Exp $
 *$Log: seek.c $
 * リビジョン 1.1  1996/01/20  12:06:40  kabumoto
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/
/* 説明																	*/
/*		規格－UNIX														*/
/*		指定したfdに対応するファイルのファイル･ポインタを、origin		*/
/*		に指定した位置からoffsetバイト離れた位置に移動する。			*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		fd	: 対象ﾌｧｲﾙのﾊﾝﾄﾞﾙ											*/
/*		offset	: originからのﾊﾞｲﾄ数									*/
/*		origin	: 移動の基準の位置										*/
/*																		*/
/* 戻り値																*/
/*		int		: N		･･･ 移動後の位置が先頭から何バイト離れて		*/
/*				  			いるか										*/
/*				  -N	･･･ error										*/
/*----------------------------------------------------------------------*/

#include	<stddef.h>								/* ANSI std			*/
#include	<fcntl.h>
#include	<rom\handle.h>
#include	<drive\iofsys.h>

int
seek(
	int		fd,
	int		offset,
	int		origin
	)
{
	int		ch, i;

	ch = fd & 0xff;
	if(((i= ((fd & 0xff00) >> 8)-1) < 0) || (i >= __FILE_KEY_MAX_) ||
	  (iodrv_seek[i] == NULL))							return(-1);
	return(iodrv_seek[i](ch, offset, origin));
}
