/*----------------------------------------------------------------------*
 * File name	: write.c												*
 *----------------------------------------------------------------------*
 *$Header: p:/h8lib/rom/src/rcs/write.c 1.1 1996/01/20 12:07:15 kabumoto Exp $
 *$Log: write.c $
 * リビジョン 1.1  1996/01/20  12:07:15  kabumoto
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/
/* 説明																	*/
/*		規格－UNIX														*/
/*		バッファからlenバイトを読みだし、fdに対応するファイルに			*/
/*		書き込みを行う。												*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		fd		: 対象ﾌｧｲﾙのﾊﾝﾄﾞﾙ										*/
/*		*buff	: 書き込みﾃﾞｰﾀへのﾎﾟｲﾝﾀ									*/
/*		len		: 書き込むﾃﾞｰﾀ長										*/
/*																		*/
/* 戻り値																*/
/*		int		: N		･･･ 書き込みを行ったバイト数					*/
/*				  -1	･･･ error										*/
/*----------------------------------------------------------------------*/

#include	<stddef.h>									/* ANSI std		*/
#include	<fcntl.h>
#include	<rom\handle.h>
#include	<drive\iofsys.h>

int
write(
	int		fd,
	char	*buff,
	int		len
	)
{
	int		ch, i;

	ch = fd & 0xff;
	if(((i= ((fd & 0xff00) >> 8)-1) < 0) || (i > __KEY_MAX_-1) ||
	  (iodrv_write[i] == NULL))						return(-1);
	return(iodrv_write[i](ch, buff, len));
}
