/*----------------------------------------------------------------------*
 * File name	: close.c						*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/rom/src/RCS/close.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: close.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY				*/
/*		SHIGA JAPAN						*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	規格－UNIX							*/
/*	指定したfdに対応するファイルをクローズする。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	fd	: 対象ﾌｧｲﾙのﾊﾝﾄﾞﾙ					*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ complete					*/
/*		  -1	･･･ error					*/
/*----------------------------------------------------------------------*/

#include	<stddef.h>			/* ANSI std		*/
#include	<rom\fcntl.h>
#include	<rom\handle.h>
#include	<drive\iofsys.h>

int
close(
	int		fd
	)
{
	int		ch, i;

	ch = fd & 0xff;
	if(((i= ((fd & 0xff00) >> 8)-1) < 0) || (i > __KEY_MAX_-1) ||
	  (iodrv_close[i] == NULL))				return(-1);
	return(iodrv_close[i](ch));
}
