/*----------------------------------------------------------------------*
 * File name	: creat.c						*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/rom/src/RCS/creat.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: creat.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY				*/
/*		SHIGA JAPAN						*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	nameで指定したファイルが存在していなければ、新しいファイル	*/
/*	として作成する。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*name	: ﾌｧｲﾙのﾊﾟｽ名						*/
/*	mode	: ｱｸｾｽ許可の設定					*/
/*									*/
/* 戻り値								*/
/*	int	: ﾌｧｲﾙ･ﾊﾝﾄﾞﾙ						*/
/*----------------------------------------------------------------------*/

#include	<rom\fcntl.h>
/*#include	<drive\handle.h>*/

int
creat(
	const char	*name,
	int		mode
	)
{
	return(0);
}
