/*----------------------------------------------------------------------*
 * File name	: read.c						*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/rom/src/RCS/read.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: read.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY				*/
/*		SHIGA JAPAN						*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	規格－UNIX							*/
/*	fdに対応するファイルからlenバイトを読みだし、バッファに		*/
/*	書き込みを行う。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	fd	: 対象ﾌｧｲﾙのﾊﾝﾄﾞﾙ					*/
/*	*buff	: 読み込んだﾃﾞｰﾀのｽﾄｱｰ先				*/
/*	len	: 読み込むﾃﾞｰﾀ長					*/
/*									*/
/* 戻り値								*/
/*	int	: N	･･･ 読み出したバイト数				*/
/*		  -N	･･･ error					*/
/*----------------------------------------------------------------------*/

#include	<stddef.h>			/* ANSI std		*/
#include	<rom\fcntl.h>
#include	<rom\handle.h>
#include	<drive\iofsys.h>

int
read(
	int		fd,
	char		*buff,
	int		len
	)
{
	int		ch, i;

	ch = fd & 0xff;
	if(((i= ((fd & 0xff00) >> 8)-1) < 0) || (i > __KEY_MAX_-1) ||
	  (iodrv_read[i] == NULL))				return(-1);
	return(iodrv_read[i](ch, (unsigned char *)buff, len));
}
