/*======================================================================
 * File name    : romid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: romid.c $
 * リビジョン 1.13  1970/01/01  00:00:00  chimura
 * 2004/05/29 12:30
 * scanfmtのプロタイプのミスマッチを修正する。
 * 
 * リビジョン 1.12  1970/01/01  00:00:00  sakaguti
 * RTCへのｱｸｾｽがBIOSIFから直接になっていたのでDRIVEに変更
 * 
 * リビジョン 1.11  1970/01/01  00:00:00  chimura
 * 2004/01/29 15:00
 * ADV_SIG_SEMへの引き数の誤りを修正。
 * 
 * リビジョン 1.10  1970/01/01  00:00:00  sakaguti
 * fifo定義追加
 * 
 * リビジョン 1.9  1970/01/01  00:00:00  chimura
 * 2003/11/12 11:30
 * DMUで変更した内容を移植する。
 * 
 * リビジョン 1.8  1970/01/01  00:00:00  chimura
 * 2003/10/06 15:00
 * 割り込み禁止状態で処理をぬける不具合修正
 * 
 * リビジョン 1.7  1970/01/01  00:00:00  chimura
 * 2003/09/16 18:15
 * printf,sscanf,sprintfで書式設定が２個以上行えない不具合修正
 * 
 * リビジョン 1.6  1970/01/01  00:00:00  chimura
 * 2003/08/05 compiler ver7 vup
 * 
 * リビジョン 1.5  1970/01/01  00:00:00  chimura
 * 2003/05/14 18:30
 * malloc時に獲得するサイズが小さい不具合修正
 * p:\lib\romからの移植ミス
 * 
 * リビジョン 1.4  1970/01/01  00:00:00  kawamura
 * 2003/05/07  17:23
 * 未定義の関数jstrlenを追加する。
 * 
 * リビジョン 1.3  1970/01/01  00:00:00  chimura
 * 2003/05/01 20:30
 * エンディアンの影響する記述をやめる。
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/02/17 18:00
 * fromを追加する。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rom/src/rcs/romid.c 1.3 1996/03/06 13:18:12 ryoji
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*romid = "$Header: p:/presto2/shlib_v7/rom/src/RCS/romid.c 1.13 1970/01/01 00:00:00 chimura Exp $";
