/****************************************************************************
* ルネサスC初期設定ルーチンの例（MS7615S01E for SH7615）                    *
*                                                                           *
*  File name : init7615.c                                                   *
*                                                                           *
* 11/Apr/2000 作成                                                    MiSPO *
****************************************************************************/

extern int *_D_ROM, *_D_BGN, *_D_END, *_B_BGN, *_B_END;
extern void _INITSCT(void);
extern void main(void);
#pragma noregsave(_INIT)

/*****************************************************************************
* 初期設定
*
******************************************************************************/

void _INIT(void)
{
    _INITSCT();     /* セクションの初期化ルーチンの呼び出し */
    main();         /* メインルーチンの呼び出し */
    for (;;)        /* 万一、main 関数終了したら、無限ループ */
        ;
}

/*****************************************************************************
* セクションの初期化
*
******************************************************************************/

void _INITSCT(void)
{
    int *p, *q;

    /* 未初期化データ領域をゼロで初期化 */

    for (p = _B_BGN; p < _B_END; p++)
        *p = 0;

    /* 初期化データを ROM 上から RAM 上へコピー */

    for (p = _D_BGN, q = _D_ROM; p < _D_END; p++, q++)
        *p = *q;
}

/* end */
