/*======================================================================
 * File name    : chkpath.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/common/RCS/chkpath.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: chkpath.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_chkPathName                                                  */
/*         ：                                                                 */
/* パラメタ：IN:  F_CHAR * パス名                                             */
/*         ：                                                                 */
/*         ：OUT: F_CHAR * 論理ドライブ番号                                   */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：正常終了  DFMR_SUC                                               */
/*         ：異常終了  DFMR_ERRPARAM                                          */
/*         ：          DFMR_DRVNOCONNECTERR                                   */
/*         ：                                                                 */
/* 概    要：パスサイズのチェック及び論理ドライブ接続チェック                 */
/*         ：                                                                 */
/* 作 成 日：2004.08.21                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/

#include "fsbase.h"

F_INT FMR_chkPathName ( 
    F_CHAR * path,                      /* パス名                             */
    F_CHAR * drvnum                     /* 論理ドライブ番号                   */
)
{
	F_WORD  l_cnt;                      /* 汎用カウンタ                       */
	F_CHAR  l_drvnum;                   /* 論理ドライブ番号                   */

	/**************************************************************************/
	/* パス名チェック                                                         */
	/**************************************************************************/
	if( path == NULL )
	{
		/* パス名がNULLの場合 */
		return DFMR_ERRPARAM;           /* パラメータエラー返却               */
	}
	/**************************************************************************/
	/* 論理ドライブ番号チェック                                               */
	/**************************************************************************/
	l_drvnum = *( path );               /* 論理ドライブ番号取得               */
	l_drvnum &=  0xDF;
	if( ( *( path + 1 ) != ':' )  ||
		( *( path + 2 ) != '\\' ) ||
		( *( path + 3 ) == NULL ) ||
		( ( l_drvnum < DFMR_TOPDRVNUM ) || ( DFMR_ENDDRVNUM < l_drvnum ) ) )
	{
		return DFMR_ERRPARAM;
	}
	if( MFMR_DRVINFO( l_drvnum ) == ( F_VOID * )DFMR_RAMINIT )
	{
		/* 論理ドライブが未接続の場合 */
		return DFMR_DRVNOCONNECTERR;    /* 論理ドライブ未接続エラー           */
	}
	*( drvnum ) = l_drvnum;             /* 論理ドライブ番号返却               */
	return DFMR_OK;                     /* 正常終了                           */
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
