/*======================================================================
 * File name    : fsram.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/common/RCS/fsram.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: fsram.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_ram                                                          */
/* パラメタ：                                                                 */
/* 戻 り 値：                                                                 */
/* 概    要：グローバル変数の定義                                             */
/* 作 成 日：2004.03.03                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*                                                                            */
/******************************************************************************/

#include "fsbase.h"

/*********************************/
/*  ファイルシステム内部RAM領域  */
/*********************************/
/* ドライバ構成情報 */
#ifdef _OS_WIN32_
TFMR_DRVINFO tfmr_drvinfo[ DFMR_USR_MAXDRIVER ];
#else /* _OS_WIN32_ */
#include "drvconf.h"
#endif /* _OS_WIN32_ */

/* 論理ドライブRAMテーブルアドレス */
TFMR_PART_RAMADDR tfmr_part_ramaddr[ DFMR_USR_MAXDRVNUM ];
/* ファイルハンドル */
TFMR_FILEHANDLE tfmr_filehandle[ DFMR_USR_MAXFILEHANDLE ];
/* 検索ハンドル */
TFMR_SEARCHHANDLE tfmr_searchhandle[ DFMR_USR_MAXSEARCHHANDLE ];
/******************************************************************************/
/*      Unpublished Copyright (C) 2003      ウェスコム株式会社                */
/******************************************************************************/
