/*======================================================================
 * File name    : gsectnum.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/common/RCS/gsectnum.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: gsectnum.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_getSectNum                                                   */
/*         ：                                                                 */
/* パラメタ：IN:  F_DWORD クラスタ番号                                        */
/*         ：     F_BYTE クラスタ内セクタ番号                                 */
/*         ：     F_BYTE ドライブ番号                                         */
/*         ：                                                                 */
/*         ：OUT: なし                                                        */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：F_DWORD セクタ番号                                               */
/*         ：                                                                 */
/* 概    要：クラスタ番号、クラスタ内セクタ番号よりセクタ番号を求める         */
/*         ：                                                                 */
/* 作 成 日：2004.06.09                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/

#include "fsbase.h"

F_DWORD FMR_getSectNum(
    F_DWORD clstnum,                    /* クラスタ番号                       */
    F_BYTE sectnum,                     /* クラスタ内セクタ番号               */
    F_BYTE drvnum                       /* ドライブ番号                       */
)
{
    /* セクタ番号 = クラスタ番号 * クラスタ当りのセクタ数 */
    /*            + クラスタ内セクタ番号                  */
    return( ( ( clstnum - DFMR_TOPCLSTNUM ) * MFMR_SECTPERCLST( drvnum ) )
    			 + sectnum + MFMR_DATATOP( drvnum ) );
    
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
