/*======================================================================
 * File name    : to_captl.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/common/RCS/to_captl.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: to_captl.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_smallToCapital                                               */
/*         ：                                                                 */
/* パラメタ：IN:  F_CHAR * 変換前文字列                                       */
/*         ：     F_CHAR 変換文字数                                           */
/*         ：                                                                 */
/*         ：OUT: F_CHAR * 変換後文字列                                       */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：void                                                             */
/*         ：                                                                 */
/* 概    要：小文字を大文字に変換する。                                       */
/*         ：                                                                 */
/* 作 成 日：2004.04.**                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/

#include "fsbase.h"

F_VOID FMR_smallToCapital(
	F_CHAR * srcstr,                    /* 変換前文字列                       */
	F_CHAR * buff,                      /* 変換後文字列                       */
	F_WORD num                          /* 変換文字数                         */
)
{
	F_WORD l_cnt;                       /* ループカウンタ                     */
	
	for( l_cnt = 0; l_cnt < num; l_cnt ++ )
	{
		*( buff + l_cnt ) = *( srcstr + l_cnt );
		/* 英小文字の場合 */
		if( ( 'a' <= *( srcstr + l_cnt ) )
			&& ( *( srcstr + l_cnt ) <= 'z' ) )
		{
			*( buff + l_cnt ) &= 0xDF;
		}
//		/* 全角文字の上位BYTEの場合 */
//		else if( ( ( 0x81 <= *( srcstr + l_cnt ) ) && ( *( srcstr + l_cnt ) <= 0x84 ) )
//			|| ( ( 0x87 <= *( srcstr + l_cnt ) ) && ( *( srcstr + l_cnt ) <= 0x9F ) )
//			|| ( ( 0xE0 <= *( srcstr + l_cnt ) ) && ( *( srcstr + l_cnt ) <= 0xEA ) )
//			|| ( ( 0xED <= *( srcstr + l_cnt ) ) && ( *( srcstr + l_cnt ) <= 0xEE ) )
//			|| ( ( 0xFA <= *( srcstr + l_cnt ) ) && ( *( srcstr + l_cnt ) <= 0xFC ) )
//		)
//		{
//			l_cnt ++;
//			*( buff + l_cnt ) = *( srcstr + l_cnt );
//		}
	}
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
