/*======================================================================
 * File name    : decimal.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	: アスキー１０進文字の変換
 *----------------------------------------------------------------------
 *$Header: p:/nhic/main/ccw/rcs/decimal.c 1.1 1998/08/26 18:28:18 yonetsu Exp $
 *$Log: decimal.c $
 * リビジョン 1.1  1998/08/26  18:28:18  yonetsu
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 1995-1998, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */
#define _DECIMAL_C_

#include	<stdio.h>
#include	<string.h>
#include	<stdlib.h>
#include	"decimal.h"

static void sp2zero(char *buf,int size);
/*----------------------------------------------------------------------*/
/*									*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	任意の数のアスキー数字列（１０進）を int に変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/* 戻り値								*/
/*----------------------------------------------------------------------*/
int adec2i(int size,const char *adec_p)
{
	char buf[10];

	if(size > 6)	return(0);
	strncpy(buf,adec_p,(size_t)size);
	buf[size] = '\0';
	sp2zero(buf,size);
	return(atoi(buf));
}

/*----------------------------------------------------------------------*/
/*									*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	任意の数のアスキー数字列（１０進）を long に変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/* 戻り値								*/
/*----------------------------------------------------------------------*/
long adec2l(int size,const char *adec_p)
{
	char buf[16];

	if(size > 11)	return(0);
	strncpy(buf,adec_p,(size_t)size);
	buf[size] = '\0';
	sp2zero(buf,size);
	return(atol(buf));
}

static void sp2zero(char *buf,int size)
{
	int	i;

	for(i=0;i<size;i++,buf++)
		if(*buf == ' ')	  *buf = '0';
}

/*----------------------------------------------------------------------*/
/*									*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/* int を任意の数のアスキー数字列（１０進）に変換する。 		*/
/* オーバフローは、考慮しないが、指定したサイズ以外の領域には影響しない */
/* オーバフローの場合には、下位からサイズ分のみ変換される。		*/
/* 値が指定したサイズより小さい場合には、先頭はゼロで埋められる。	*/
/* null 文字は入らない。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/* 戻り値								*/
/*----------------------------------------------------------------------*/
char *i2adec(int val,int size,char *adec_p)
{
	int	len,i,sign=0;
	char	buf[20];

	sprintf(buf,"%d",val);	/* itoa(val,buf,10);	*/
	len = strlen(buf);
	if(len && (buf[0] == '-')){
		sign = 1;
		buf[0] = '0';
	}
	for(i=size-1;i>=0;i--) {
		if(len != 0) {
			adec_p[i] = buf[len-1];
			len--;
		}
		else		adec_p[i] = '0';
	}
	if(sign)	adec_p[0] = '-';
	return adec_p+size;
}

/*----------------------------------------------------------------------*/
/*									*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/* long を任意の数のアスキー数字列（１０進）に変換する。 		*/
/* オーバフローは、考慮しないが、指定したサイズ以外の領域には影響しない */
/* オーバフローの場合には、下位からサイズ分のみ変換される。		*/
/* 値が指定したサイズより小さい場合には、先頭はゼロで埋められる。	*/
/* null 文字は入らない。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/* 戻り値								*/
/*----------------------------------------------------------------------*/
char *l2adec(long val,int size,char *adec_p)
{
	int	len,i,sign=0;
	char	buf[20];

	sprintf(buf,"%d",val);	/* ltoa(val,buf,10);	*/
	len = strlen(buf);
	if(len && (buf[0] == '-')){
		sign = 1;
		buf[0] = '0';
	}
	for(i=size-1;i>=0;i--) {
		if(len != 0) {
			adec_p[i] = buf[len-1];
			len--;
		}
		else		adec_p[i] = '0';
	}
	if(sign)	adec_p[0] = '-';
	return adec_p+size;
}
