/*======================================================================
 * File name    : rpktchg.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	: RCU-MHIC 間通信のMHICアドレスの変更
 *                （RCU-MHIC間に複数のMHICが付いた時の対処）
 *----------------------------------------------------------------------
 *$Header: p:/nhic/main/ccw/rcs/rpktchg.c 1.1 1970/01/01 00:00:00 yonetsu Exp $
 *$Log: rpktchg.c $
 * リビジョン 1.1  1970/01/01  00:00:00  yonetsu
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 1995-2000, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */
#define _RPKTCHG_C_

#include	<rxif\rx116.h>
#include 	<drive\comdrva.h>

#include	"cmfhdl.h"
#include	"adrs.h"
#include	"pktchg.h"

/*----------------------------------------------------------------------*/
/*									*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*									*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/* 戻り値								*/
/*----------------------------------------------------------------------*/
struct compk *rcu_pkt_chg(
	int dev_no,
	struct compk *p		/* default pkt */
	)
{
	if(dev_no == RCU_DN ) {
		p->node_no = (unsigned char)get_rcu_my_adrs();
	}
	return p;
}

