/*======================================================================
 * File name	: cnvfsys.c
 * Original		: 
 *----------------------------------------------------------------------
 * Function 	:
 *		機種のファイルシステムに関する関数群のヘッダ
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/utility2/rcs/cnvfsys.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: cnvfsys.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2004, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-SHI SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include "cnvfsys.h"

/*---- defines ---------------------------------------------------------*/

/*---- valiables -------------------------------------------------------*/

/*---- prototypes ------------------------------------------------------*/


/*======================================================================
 *	IFS_open															
 *----------------------------------------------------------------------
 *	ファイルのオープン関数												
 *----------------------------------------------------------------------
 *	引き数																
 *		const char		*path		フルパスでのファイル名の文字列		
 *		int				flag		ファイルオープン時のフラグ			
 *		unsigned char	atrb		ファイルの属性						
 *	戻り値																
 *		int							ファイルハンドル（≧０）			
 *									又はエラーコード（＜０）			
 *----------------------------------------------------------------------
 */
int IFS_open(const char *path, int flag, unsigned char atrb)
{
	return FMR_Open(path, flag, atrb);
}

/*======================================================================
 *	IFS_fopen															
 *----------------------------------------------------------------------
 *	ANSI準拠ファイルのオープン関数（推奨）								
 *		IFS_fclose()と対で使用する										
 *----------------------------------------------------------------------
 *	引き数																
 *		const char	*filename	フルパスでのファイル名の文字列			
 *		int			mode		ファイルオープン時のモード				
 *						'r' ：	読み込み用にオープン					
 *						'r+'：	読み書き用にオープン					
 *						'w' ：	書き込み用にオープン、前内容があれば消去
 *						'a' ：	ファイル最後への書き込み用にオープン	
 *	戻り値																
 *		int							ファイルハンドル（≧０）			
 *									又はエラーコード（＜０）			
 *----------------------------------------------------------------------
 */
int IFS_fopen(const char *filename, const char *mode)
{
	int fhdl, ret = 0;
	
	switch (*mode) {
	case 'r':
		if (*(++mode) == '+') {
			fhdl = FMR_Open(filename, IFS_O_RDWR, IFS_ATTR_ARC);
		} else {
			fhdl = FMR_Open(filename, IFS_O_RDONLY, IFS_ATTR_ARC);
		}
		break;
	case 'w':
		fhdl = FMR_Open(filename, IFS_O_EXCL, IFS_ATTR_ARC);
		if (fhdl == IFS_EEXIST) {
			/* 既にファイルが存在している場合、一旦は既存ファイルを消去する */
			ret = FMR_Remove(filename);
			if (ret == IFS_SUC) {
				/* 正常に消す事が出来た場合には新規にOpen */
				fhdl = FMR_Open(filename, IFS_O_CREAT, IFS_ATTR_ARC);
			} else {
				/* 消去時のエラーを戻り値にする */
				fhdl = ret;
			}
		}
		break;
	case 'a':
		/* ポインタを終端に移す */
		fhdl = FMR_Open(filename, IFS_O_APPEND, IFS_ATTR_ARC);
		break;
	default:
		fhdl = IFS_ENOENT;		/* 該当ファイル無しと見なす */
		break;
	}
	return ret = fhdl;
}

/*======================================================================
 *	IFS_close															
 *----------------------------------------------------------------------
 *	ファイルのクローズ関数												
 *----------------------------------------------------------------------
 *	引き数																
 *		int		filehandle			ファイルのハンドル（≧０）			
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_close(int filehandle)
{
	return FMR_Close(filehandle);
}

/*======================================================================
 *	IFS_fclose															
 *----------------------------------------------------------------------
 *	ANSI準拠ファイルのクローズ関数（推奨）								
 *		IFS_fopen()と対で使用する										
 *----------------------------------------------------------------------
 *	引き数																
 *		int		filehandle			ファイルのハンドル（≧０）			
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_fclose(int filehandle)
{
	return FMR_Close(filehandle);
}

/*======================================================================
 *	IFS_read															
 *----------------------------------------------------------------------
 *	ファイルからデータを読み込む										
 *----------------------------------------------------------------------
 *	引き数																
 *		int			 filehandle		ファイルのハンドル（≧０）			
 *		void		 *readbuff		読み込むためのバッファ				
 *		unsigned int size			読み込むデータのバイト数			
 *	戻り値																
 *		int							読み込んだバイト数					
 *									又はエラーコード（＜０）			
 *----------------------------------------------------------------------
 */
int IFS_read(int filehandle, void *readbuff, unsigned int size)
{
	return FMR_Read(filehandle, readbuff, size);
}

/*======================================================================
 *	IFS_write															
 *----------------------------------------------------------------------
 *	ファイルへデータを書き込む											
 *----------------------------------------------------------------------
 *	引き数																
 *		int			 filehandle		ファイルのハンドル（≧０）			
 *		void		 *writebuff		書き込むためのバッファ				
 *		unsigned int size			書き込むデータのバイト数			
 *	戻り値																
 *		int							書き込んだバイト数					
 *									又はエラーコード（＜０）			
 *----------------------------------------------------------------------
 */
int IFS_write(int filehandle, void *writebuff, unsigned int size)
{
	return FMR_Write(filehandle, writebuff, size);
}

/*======================================================================
 *	IFS_seek															
 *----------------------------------------------------------------------
 *	ファイルポインタを移動する											
 *----------------------------------------------------------------------
 *	引き数																
 *		int		filehandle			ファイルのハンドル（≧０）			
 *		long	offset				初期位置からの移動バイト数			
 *		int		origin				ファイルポインタの初期位置			
 *	戻り値																
 *		long						移動後のファイルポインタの値		
 *									又はエラーコード（＜０）			
 *----------------------------------------------------------------------
 */
long IFS_seek(int filehandle, long offset, int origin)
{
	return FMR_Seek(filehandle, offset, origin);
}

/*======================================================================
 *	IFS_tell															
 *----------------------------------------------------------------------
 *	ファイルポインタ数を取得する										
 *----------------------------------------------------------------------
 *	引き数																
 *		int		filehandle			ファイルのハンドル（≧０）			
 *	戻り値																
 *		long						現在のファイルポインタの値			
 *									又はエラーコード（＜０）			
 *----------------------------------------------------------------------
 */
long IFS_tell(int filehandle)
{
	return FMR_Tell(filehandle);
}

/*======================================================================
 *	IFS_remove															
 *----------------------------------------------------------------------
 *	ファイルを削除する													
 *----------------------------------------------------------------------
 *	引き数																
 *		const char		*path		フルパスでのファイル名の文字列		
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_remove(const char *path)
{
	return FMR_Remove(path);
}

/*======================================================================
 *	IFS_setatr															
 *----------------------------------------------------------------------
 *	ファイルの属性を変更する													
 *----------------------------------------------------------------------
 *	引き数																
 *		const char		*path		フルパスでのファイル名の文字列		
 *		unsigned char	atrb		ファイルの属性						
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_setatr(const char *path, unsigned char atrb)
{
	return FMR_SetAtr(path, atrb);
}

/*======================================================================
 *	IFS_rename															
 *----------------------------------------------------------------------
 *	ファイルを削除する													
 *----------------------------------------------------------------------
 *	引き数																
 *		const char		*oldpath	フルパスでの旧ファイル名の文字列	
 *		const char		*newpath	フルパスでの新ファイル名の文字列	
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_rename(const char *oldpath, const char *newpath)
{
	return FMR_Rename(oldpath, newpath);
}

/*======================================================================
 *	IFS_mkdir															
 *----------------------------------------------------------------------
 *	ディレクトリを作成する												
 *----------------------------------------------------------------------
 *	引き数																
 *		const char		*path		作成ディレクトリのフルパス文字列	
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_mkdir(const char *path)
{
	return FMR_Mkdir(path);
}

/*======================================================================
 *	IFS_rmdir															
 *----------------------------------------------------------------------
 *	ディレクトリを削除する												
 *----------------------------------------------------------------------
 *	引き数																
 *		const char		*path		フルパスでのファイル名の文字列		
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_rmdir(const char *path)
{
	return FMR_Rmdir(path);
}

/*======================================================================
 *	IFS_stat															
 *----------------------------------------------------------------------
 *	ファイルの状態を取得する											
 *----------------------------------------------------------------------
 *	引き数																
 *		const char		*path		フルパスでのファイル名の文字列		
 *		TFMR_FILE_INFO *fileinfo	ファイル状態を格納する領域			
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_stat(const char *path, TFMR_FILE_INFO *fileinfo)
{
	return FMR_Stat(path, fileinfo);
}

/*======================================================================
 *	IFS_FindFirst														
 *----------------------------------------------------------------------
 *	ファイル・ディレクトリの検索を開始する								
 *----------------------------------------------------------------------
 *	引き数																
 *		const char		*path		フルパスでのファイル名の文字列		
 *		TFMR_FILE_INFO *fileinfo	ファイル状態を格納する領域			
 *	戻り値																
 *		long						検索ハンドル(≧０)					
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
long IFS_FindFirst(const char *path, TFMR_FILE_INFO *fileinfo)
{
	return FMR_FindFirst(path, fileinfo);
}

/*======================================================================
 *	IFS_FindNext														
 *----------------------------------------------------------------------
 *	ファイル・ディレクトリの検索を継続する								
 *----------------------------------------------------------------------
 *	引き数																
 *		long			srchhandle	検索を継続する検索ハンドル			
 *		TFMR_FILE_INFO *fileinfo	ファイル状態を格納する領域			
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_FindNext(long srchhandle, TFMR_FILE_INFO *fileinfo)
{
	return FMR_FindNext(srchhandle, fileinfo);
}

/*======================================================================
 *	IFS_FindClose														
 *----------------------------------------------------------------------
 *	ファイル・ディレクトリの検索を終了する								
 *----------------------------------------------------------------------
 *	引き数																
 *		long			srchhandle	検索を終了する検索ハンドル			
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_FindClose(long srchhandle)
{
	return FMR_FindClose(srchhandle);
}

/*======================================================================
 *	IFS_info															
 *----------------------------------------------------------------------
 *	論理ドライブの状態を取得する										
 *----------------------------------------------------------------------
 *	引き数																
 *		char	drvnum				論理ドライブの番号					
 *		TFMR_DRIVE_INFO *drvinfo	ドライブ状態を格納する領域			
 *	戻り値																
 *		int							正常終了							
 *									又はエラーコード					
 *----------------------------------------------------------------------
 */
int IFS_info(char drvnum, TFMR_DRIVE_INFO *drvinfo)
{
	return FMR_Info(drvnum, drvinfo);
}

/*======================================================================
 *	IFS_fgetc															
 *----------------------------------------------------------------------
 *	ファイルから１文字読み込む											
 *----------------------------------------------------------------------
 *	引き数																
 *		int		filehandle		ファイルのハンドル（≧０）				
 *	戻り値																
 *		int						正常: ファイルの終了の時EOF(-1)			
 *									  ファイルの終了でない時入力した文字
 *								異常: EOF(-1)							
 *----------------------------------------------------------------------
 */
int IFS_fgetc(int filehandle)
{
	return fmr_fgetc(filehandle);
}

/*======================================================================
 *	IFS_fgets															
 *----------------------------------------------------------------------
 *	ファイルから文字列を読み込む										
 *----------------------------------------------------------------------
 *	引き数																
 *		char	*line			文字列を入力するバッファのアドレス		
 *		int		maxline			文字列を入力するバッファのバイト数		
 *		int		filehandle		ファイルのハンドル（≧０）				
 *	戻り値																
 *		char	*				正常: ファイル終了の時NULL				
 *									  ファイル終了でない時lineのアドレス
 *								異常: NULL								
 *----------------------------------------------------------------------
 */
char *IFS_fgets(char *line, int maxline, int filehandle)
{
	return fmr_fgets(line, maxline, filehandle);
}

/*======================================================================
 *	FMR_fputc															
 *----------------------------------------------------------------------
 *	ファイルへ１文字書き込む										
 *----------------------------------------------------------------------
 *	引き数																
 *		int		ch					書き込む文字						
 *		int		filehandle			ファイルのハンドル（≧０）			
 *	戻り値																
 *		int							正常: 書き込んだ文字				
 *									異常: EOF(-1)						
 *----------------------------------------------------------------------
 */
int IFS_fputc(int ch, int filehandle)
{
	return fmr_fputc(ch, filehandle);
}

/*======================================================================
 *	FMR_fputs															
 *----------------------------------------------------------------------
 *	ファイルへ文字列を書き込む											
 *----------------------------------------------------------------------
 *	引き数																
 *		const char	*line			出力ずる文字列のアドレス			
 *		int			filehandle		ファイルのハンドル（≧０）			
 *	戻り値																
 *		int							正常: 0								
 *									異常: EOF(-1)						
 *----------------------------------------------------------------------
 */
int IFS_fputs(const char *line, int filehandle)
{
	return fmr_fputs(line, filehandle);
}
