/*======================================================================
 * File name    : ata_sub.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/pcata/RCS/ata_sub.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: ata_sub.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/****************************************************************************/
/* ファイル名：PCATA_sub.c                                                  */
/* 概    要  ：PCカードATAドライバ                                          */
/*           ：共通サブルーチン                                             */
/* 作 成 日  ：2004.03.19                                                   */
/* 作 成 者  ：                                                             */
/*                                                                          */
/****************************************************************************/

#include "ata_def.h"
#include "ata_srct.h"
#include "ata_prot.h"

/****************************************************************************/
/* 関 数 名：PCATA_SubMemSet                                                */
/*         ：                                                               */
/* パラメタ：IN:    F_BYTE     * dest           設定先ポインタ              */
/*         ：       F_BYTE       code           設定コード                  */
/*         ：       F_WORD       count          設定バイト数                */
/*         ：                                                               */
/* 戻 り 値：なし                                                           */
/*         ：                                                               */
/* 概    要：設定先へ設定コードを設定する。                                 */
/*         ：                                                               */
/* 作 成 日：2003.02.19                                                     */
/* 作 成 者：                                                               */
/*                                                                          */
/****************************************************************************/
/*** 変更履歴 ***************************************************************/
/*  履歴               変    更    内    容                日 付   修 正 者 */
/****************************************************************************/

void  PCATA_SubMemSet(	F_BYTE	  * dest,				/* 設定先ポインタ			*/
						F_BYTE		code,				/* 設定コード				*/
						F_WORD		count )				/* 設定バイト数             */
{
	F_WORD		cnt;		/* ループカウンタ	*/

	for ( cnt = 0; cnt < count; cnt++ )
	{
		*dest = code;                              		/* コード設定				*/
		dest++;
	}
}

/****************************************************************************/
/* 関 数 名：PCATA_SubMemCpy                                                */
/*         ：                                                               */
/* パラメタ：IN:    F_BYTE     * dest           コピー先ポインタ            */
/*         ：       F_BYTE     * src            コピー元ポインタ            */
/*         ：       F_WORD       count          コピーバイト数              */
/*         ：                                                               */
/* 戻 り 値：なし                                                           */
/*         ：                                                               */
/* 概    要：コピー元からコピー先へコピーする。                             */
/*         ：                                                               */
/* 作 成 日：2003.02.19                                                     */
/* 作 成 者：                                                               */
/*                                                                          */
/****************************************************************************/
/*** 変更履歴 ***************************************************************/
/*  履歴               変    更    内    容                日 付   修 正 者 */
/****************************************************************************/

void  PCATA_SubMemCpy(	F_BYTE	  * dest,				/* 設定先ポインタ			*/
						F_BYTE	  * src,				/* 設定コード				*/
						F_WORD		count )				/* 設定バイト数             */
{
	F_WORD		cnt;		/* ループカウンタ	*/

	for ( cnt = 0; cnt < count; cnt++ )
	{
		*dest = *src;									/* コピー					*/
		dest++;
		src++;
    }

}

/****************************************************************************/
/* 関 数 名：PCATA_SubLBAtoCHS                                              */
/*         ：                                                               */
/* パラメタ：IN:  F_DWORD   sec_num_LBA      セクタ番号：LBA形式            */
/*         ：  :  F_BYTE    deviceno         デバイス番号                   */
/*         ：OUT: F_BYTE *  sec_num_CHS      セクタ番号：CHS形式            */
/*         ：                                                               */
/* 戻 り 値：なし                                                           */
/*         ：                                                               */
/* 概    要：LBA形式のセクタ番号をCHS形式に変換する。                       */
/*         ：                                                               */
/* 作 成 日：2003.02.19                                                     */
/* 作 成 者：                                                               */
/*                                                                          */
/****************************************************************************/
/*** 変更履歴 ***************************************************************/
/*  履歴               変    更    内    容                日 付   修 正 者 */
/****************************************************************************/

void  PCATA_SubLBAtoCHS(F_DWORD		sec_num_LBA,	/* セクタ番号：LBA			*/
						F_BYTE *	sec_num_CHS,	/* セクタ番号：CHS形式		*/
						F_BYTE		deviceno )		/* デバイス番号				*/
{
	F_WORD		sec_track;		/* トラック当りのセクタ数	*/
	F_WORD		head_cnt;		/* ヘッド数					*/
	F_WORD		sec_num_C;		/* セクタ番号：Cylinder		*/
	F_BYTE		sec_num_S;		/* セクタ番号：Sector		*/

	head_cnt = PCATA_dv_inf[deviceno].head_cnt;
	sec_track = PCATA_dv_inf[deviceno].sec_track;
	sec_num_C = sec_num_LBA / (sec_track * head_cnt);
	sec_num_S = (sec_num_LBA % sec_track) + 1;
	*sec_num_CHS = (F_BYTE)((sec_num_LBA / sec_track) % head_cnt);
										/* Head番号(8bit)						*/
	sec_num_CHS++;
	sec_num_S &= 0x3f;
	sec_num_S |= (F_BYTE)((sec_num_C & 0x0300) >> 2);
	*sec_num_CHS = sec_num_S;
										/* Cylinder上位2bit&Sector(6bit)		*/
	sec_num_CHS++;
	*sec_num_CHS = (F_BYTE)(sec_num_C & 0x00ff);
										/* Cylinder下位8bit						*/
}

/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/

