/*----------------------------------------------------------------------*
 * File name	: scuinit.c	/ initialize m66230 i/o						*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/biosif/m66230/RCS/scuinit.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: scuinit.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.							*/
/*		959-1 SHIMOMAGARI RITTO-CITY									*/
/*		SHIGA JAPAN														*/
/*		(077) 553-4141													*/
/*----------------------------------------------------------------------*/
/* 説明                                                  				*/
/*	M66230の初期化を行い、I/Oへのアクセス環境へのポインタを返す。		*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*	ch			: ﾁｬﾝﾈﾙ													*/
/*	stp_len		: ｽﾄｯﾌﾟ･ﾋﾞｯﾄ数											*/
/*	pari_sel	: ﾊﾟﾘﾃｨｰ選択											*/
/*	baud		: 通信速度												*/
/*																		*/
/* 戻り値																*/
/*	int  *	: I/Oｺﾝﾃｷｽﾄへのﾎﾟｲﾝﾀ										*/
/*----------------------------------------------------------------------*/

#include	<biosif\iosvc.h>		/* Show biosif		*/
#include	<umachine.h>
#include	<dos.h>

int *
_m66230_init(
	int	ch,
	int	stp_len,			/* ｽﾄｯﾌﾟ･ﾋﾞｯﾄ数		*/
	int	pari_sel,			/* ﾊﾟﾘﾃｨｰ選択		*/
	int	baud				/* 通信速度選択		*/
	)
{
	int *err;
	
	err = (int *)trapa_svc(VECTOR_MPSC, 0x0, ch, stp_len, pari_sel, baud);
	return(err);
}
