/*----------------------------------------------------------------------*
 * File name	: scusst.c	/ m66230 command write						*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/biosif/m66230/RCS/scusst.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: scusst.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.							*/
/*		959-1 SHIMOMAGARI RITTO-CITY									*/
/*		SHIGA JAPAN														*/
/*		(077) 553-4141													*/
/*----------------------------------------------------------------------*/
/* 説明                                                  				*/
/*	M66230のｺﾏﾝﾄﾞﾚｼﾞｽﾀにﾗｲﾄする。										*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*	ch			: ﾁｬﾝﾈﾙ													*/
/*	data		: 書き込みﾃﾞｰﾀ											*/
/*																		*/
/* 戻り値																*/
/*	int			:														*/
/*----------------------------------------------------------------------*/

#include	<biosif\iosvc.h>		/* Show biosif		*/
#include	<umachine.h>			/* C:\usr\local\SH\5_1_0\INCLUDE */
#include	<dos.h>

int
_m66230_sst(
	int		ch,
	int		data
)
{
	int	err;
	err = (int)trapa_svc(VECTOR_MPSC, 0x2, ch, data);
	return(err);
}
