/*======================================================================
 * File name    : n4userid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: n4userid.c $
 * リビジョン 1.5  1970/01/01  00:00:00  chimura
 * 2003/08/07 17:15
 * 割り込みレベルを７から１４に変更する。
 * ブートローダーにあわせる。
 * 
 * リビジョン 1.4  1970/01/01  00:00:00  chimura
 * 2003/08/06 20:00
 * タイマー割り込みの間隔を1msecに変更する。
 * 
 * リビジョン 1.3  1970/01/01  00:00:00  chimura
 * 2003/08/05 compiler ver7 vup
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/08/04 CLKを9.8MHzに変更
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*n4userid = "$Header: p:/presto2/shlib_v7/norti/userlib/wcu/RCS/n4userid.c 1.5 1970/01/01 00:00:00 chimura Exp $";
