/*----------------------------------------------------------------------*
 * File name	: fifinit.c	/ initialize vector			*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/biosif/fifo/rcs/fifinit.c 1.2 1970/01/01 00:00:00 sakaguti Exp $
 *$Log: fifinit.c $
 * リビジョン 1.2  1970/01/01  00:00:00  sakaguti
 * ﾌﾟﾛﾄﾀｲﾌﾟ間違いvoidをintに変更
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * 04/12/07 初期レビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY				*/
/*		SHIGA JAPAN						*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	ＦＩＦＯの初期化を行う。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	なし					*/
/*									*/
/* 戻り値								*/
/*	int:0							*/
/*----------------------------------------------------------------------*/

#include	<biosif\iosvc.h>		/* Show biosif		*/
#include	<biosif\fifo.h>	
#include	<umachine.h>
#include	<dos.h>

int
_fifo_init(void)
{
	trapa_svc(VECTOR_FPGAFIFO, 0x4);
	return(0);
}
