/*======================================================================
 * Function 	:t0026
 *	プログラム番号定義
 *----------------------------------------------------------------------
 *$Log: t0026.c $
 * リビジョン 2.1  1970/01/01  00:00:00  kagatume
 * 2005/6/27 14:00
 * ・電断対応ファイルシステム搭載
 * ・インストール時間の短縮を行う
 * ・プログラム整理を行う
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 1999, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */
const char	*prog_id = "$Header: p:/presto2/dmu_v7/bootload/rcs/t0026.c 2.1 1970/01/01 00:00:00 kagatume Exp $";
