/*======================================================================
 * File name    : ossigsem.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/os/itron/rcs/ossigsem.c 1.2 1970/01/01 00:00:00 kagatume Exp $
 *$Log: ossigsem.c $
 * リビジョン 1.2  1970/01/01  00:00:00  kagatume
 * 2006/03/22 16:00
 * Saver60 Ver.01.09 up
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_osSigSem                                                     */
/*         ：                                                                 */
/* パラメタ：IN:  F_WORD セマフォID                                           */
/*         ：                                                                 */
/* 戻 り 値：F_INT 正常終了 DFMR_OK                                           */
/*         ：      異常終了 DFMR_SIGSENERR                                    */
/*         ：                                                                 */
/* 概    要：セマフォ資源を返却する                                           */
/*         ：                                                                 */
/* 前提条件：セマフォ資源を獲得している状態で使用すること                     */
/*         ：                                                                 */
/* 作 成 日：2004.05.26                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/* 01.07 ヘダーコメント修正                              05/12/12 Y.Yoshizumi */
/******************************************************************************/

#include "fsbase.h"
#include "os.h"

F_INT FMR_osSigSem(
    F_WORD semid                        /* セマフォID                         */
)
{
	F_INT l_rtn;                        /* OSシステムコール戻り値             */
	
	l_rtn = sig_sem(
		semid
		);
	if( l_rtn != DFMR_OK )
	{
		l_rtn = DFMR_SIGSENERR;
	}
	return l_rtn;
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
