/*======================================================================
 * File name    : dtmrid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: dtmrid.c $
 * リビジョン 1.5  1970/01/01  00:00:00  chimura
 * 2003/08/05 compiler ver7 vup
 * 
 * リビジョン 1.4  1970/01/01  00:00:00  chimura
 * 2003/06/06 16:30
 * timer_chk関数の不具合修正
 * 
 * リビジョン 1.3  1970/01/01  00:00:00  chimura
 * 2003/04/10 15:45
 * timer_dec、timer_chkの不具合修正
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/03/17 13:45
 * CAN_WUP()でshort型の引数wup_cntのポインタをintにキャストしていたために、
 * 奇数アドレスにintを書き込みアドレスエラーとなっていた不具合修正。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*dtmrid = "$Header: p:/presto2/shlib_v7/drive/timer/RCS/dtmrid.c 1.5 1970/01/01 00:00:00 chimura Exp $";
