/*----------------------------------------------------------------------*
 * File name	: tm5ev.c	/ 5ms timer event read			*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/drive/timer/RCS/tm5ev.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: tm5ev.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY				*/
/*		SHIGA JAPAN						*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	5msecﾀｲﾏｰ･ﾚｼﾞｽﾀのﾀｲﾑ･ｱｯﾌﾟしていないﾀｲﾏｰの状態をAPL側へﾋﾞｯﾄ･	*/
/*	ﾊﾟﾀｰﾝで提供する。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	item	: timerのｱｲﾃﾑ･ﾅﾝﾊﾞｰ					*/
/*	pnt	: ﾋﾞｯﾄ･ﾊﾟﾀｰﾝのｽﾄｱｰ用ﾎﾟｲﾝﾀｰ				*/
/*									*/
/* 戻り値								*/
/*	void	: 無し							*/
/*----------------------------------------------------------------------*/

#include	"tmrctl.h"			/* Show current		*/

void
tmr5_event(
	int		item,		/* timerのｱｲﾃﾑ･ﾅﾝﾊﾞｰ	*/
	unsigned long 	*pnt		/* pointer to return prm*/
	)
{
	timer_chk(&tm5[item], pnt);
}
