/*----------------------------------------------------------------------*
 * File name	: tmrdec.c	/ software timer decrement task		*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/drive/timer/RCS/tmrdec.c 1.3 1970/01/01 00:00:00 chimura Exp $
 *$Log: tmrdec.c $
 * リビジョン 1.3  1970/01/01  00:00:00  chimura
 * 2003/06/06 16:30
 * timer_chk関数の不具合修正
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/04/10 15:45
 * timer_dec、timer_chkの不具合修正
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY				*/
/*		SHIGA JAPAN						*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
#include	<intrpt.h>
#include	"tmrctl.h"			/* Show current		*/

/*----------------------------------------------------------------------*/
/*	timer_dec							*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	timerより引き数のcntを減算する。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*tm	: 構造体 tmh へのポインタ				*/
/*	cnt	: 減算するカウント値					*/
/*									*/
/* 戻り値								*/
/*	void	: 無し							*/
/*----------------------------------------------------------------------*/

void
timer_dec(
	struct tmh 	*tm,
	unsigned short	cnt
	)
{
	int		i;
	unsigned short	*pnt = tm->pnt;

	i = tm->no;

	_disable();
	while(i--) {
		if(*pnt) {
			if(*pnt > cnt)
				*pnt -= cnt;
			else	*pnt = (unsigned short)0;
		}
		pnt++;
	}
	_enable();
}

/*----------------------------------------------------------------------*/
/*	timer_chk							*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	タイムアップしていないタイムの状態を				*/
/*	ビットパターンで返す。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*tm	: 構造体 tmh へのポインタ				*/
/*	*ptn	: ﾀｲﾑ･ｱｯﾌﾟしていないﾀｲﾏｰの状態を返すポインタ		*/
/*									*/
/* 戻り値								*/
/*	void	: 無し							*/
/*----------------------------------------------------------------------*/

void
timer_chk(
	struct tmh	*tm,
	unsigned long	*ptn
	)
{
	int		i = tm->no;
	unsigned long	pt=0L, tmp = 1L;
	unsigned short	*pnt = tm->pnt;

	_disable();
	while(i--) {
		if(*pnt) {
			pt |= tmp;
		}
		tmp <<= 1;
		pnt++;
	}
	_enable();

	*ptn = pt;	/* For warning. */
}
