/*----------------------------------------------------------------------*
 * File name	: scicls.c		/ sci close								*
 *----------------------------------------------------------------------*
 *$Header: p:/h8lib/drive/sci/rcs/scicls.c 1.1 1996/01/18 21:49:41 kabumoto Exp $
 *$Log: scicls.c $
 * リビジョン 1.1  1996/01/18  21:49:41  kabumoto
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/
/* 説明                         		                         		*/
/*		SCIをクローズする。												*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		channel		: ﾁｬﾈﾙ･ﾅﾝﾊﾞｰ										*/
/*																		*/
/* 戻り値																*/
/*		int			: 0													*/
/*----------------------------------------------------------------------*/

#include	<rom\handle.h>							/* Show xlib		*/
#include	<drive\iofsys.h>						/*	"				*/
#include	"scictl.h"								/* Show current		*/

int
sci_close(
	int		channel
	)
{
	sci_mode = -1;
	return(0);
}
