/*======================================================================
 * File name	: pri0061.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	状態表示情報テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/pri0061.c 1.1 1970/01/01 00:00:00 itami Exp $
 *$Log: pri0061.c $
 * リビジョン 1.1  1970/01/01  00:00:00  itami
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\pri0061.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_dsp_info						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	状態表示情報テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_dsp_info(
	struct fmt_dspinf	*buf
	)
{
	pri0061s.ch_id = ascii_hex(buf->ch_id);
	pri0061s.info = htoc((char *)buf->info);
	pri0061s.hp_ptn = htol((char *)buf->hp_ptn);
	return(0);
}
