/*======================================================================
 * File name	: pri0062.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	状態表示情報テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/pri0062.c 1.1 1970/01/01 00:00:00 itami Exp $
 *$Log: pri0062.c $
 * リビジョン 1.1  1970/01/01  00:00:00  itami
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\pri0061.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_dsp_info						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	状態表示情報構造体のデータをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_alarm)	･･･ 正常終了			*/
/*		  NULL			･･･ エラー			*/
/*----------------------------------------------------------------------*/

void *
pr_print_dsp_info(
	struct fmt_dspinf	*txt,
	struct pri0061t		*pkt
	)
{
	txt->ch_id = hex_ascii(pkt->ch_id);
	ctoh((unsigned char)pkt->info, (char *)txt->info);
	ltoh(pkt->hp_ptn, (char *)txt->hp_ptn);
	return(++txt);
}
