/*======================================================================
 * File name	: pri0037.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＤＣＡモニタ情報　テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/pri0037.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: pri0037.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/lib/rzcmdx/src/RCS/rzi037.c 1.3 1996/07/15 15:24:25 hiroki Exp
 *log: rzi037.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2004, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\pri0037.h>		/* Show Current		*/
#undef		STORAGE

/*----------------------------------------------------------------------*/
/*	pr_scan_dca_monitor						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	ＤＣＡモニター・テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_dca_monitor(
	struct fmt_dca_monitor	*buf
	)
{
	pri0037s.dca_sum_cnt = htoi((char *)buf->dca_sum_cnt);
	pri0037s.bf_cbwt = htol((char *)buf->bf_cbwt);
	pri0037s.af_cbwt = htol((char *)buf->af_cbwt);
	return(0);
}
