/*======================================================================
 * File name	: pri1011.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計算結果拡張パラメータテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/pri1011.c 1.2 1970/01/01 00:00:00 ohtani Exp $
 *$Log: pri1011.c $
 * リビジョン 1.2  1970/01/01  00:00:00  ohtani
 * 2007/10/12 14:09:57
 * ライブラリ化の為の調整。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  ohtani
 * 2007/09/12 17:59:17
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2007, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\pri1011.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_cb_caltm						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	組み合わせ計算時間テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_cb_caltm(
	struct fmt_cb_caltm	*buf
	)
{
	char	*p;
	int	i;

	pri1011s.nof_ch = ascii_hex(buf->nof_ch);
	/*ここから可変長データ処理*/
	p = (char *)buf->cb_caltm[0];
	for(i = 0; i < pri1011s.nof_ch; i++) {
		pri1011s.cb_caltm[i] = htol( p );
		p += sizeof( buf->cb_caltm[i] );
	}
	return(0);
}
