/*======================================================================
 * File name	: pri1012.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計算結果拡張パラメータテキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/pri1012.c 1.2 1970/01/01 00:00:00 ohtani Exp $
 *$Log: pri1012.c $
 * リビジョン 1.2  1970/01/01  00:00:00  ohtani
 * 2007/10/12 14:09:53
 * ライブラリ化の為の調整。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  ohtani
 * 2007/09/13 11:47:02
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2007, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\pri1011.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_cb_caltm						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	組み合わせ計算結果テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_cb_caltm)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_cb_caltm(
	struct fmt_cb_caltm	*txt,
	struct pri1011t		*pkt
	)
{
	char	*buf;
	int	i;

	txt->nof_ch = hex_ascii(pkt->nof_ch);
	/*ここから可変長データ処理*/
	buf = (char *)txt->cb_caltm[0];
	for(i = 0; i < pkt->nof_ch ; i++) {
		ltoh( pkt->cb_caltm[i], buf);
		buf += sizeof(txt->cb_caltm[i]);
	}
	return(buf);
}
