/*======================================================================
 * File name	: pri2014.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	本体状態情報拡張パラメータテキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/RCS/pri2014.c 1.2 1970/01/01 00:00:00 chimura Exp $
 *$Log: pri2014.c $
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2005/10/04
 * pri2014.cの戻り値が正しくない不具合修正。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2004, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\pri2013.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_fsv_condition						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	コンディションテキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_fsv_condition)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_fsv_condition(
	struct fmt_fsv_condition	*txt,
	struct pri2013t			*pkt
	)
{
	int	i;
	char	*buf;

	txt->nof_ch = hex_ascii(pkt->nof_ch);
	for(i = 0; i < pkt->nof_ch ; i++) {
		txt->cnd[i] = hex_ascii(pkt->cnd[i]);
	}
	buf = (char *)&txt->cnd[0];
	buf += i;
	return( buf);
}
