/*======================================================================
 * File name    : prr0087.c
 * Original	: p:/presto2/shlib_v7/rzcmdx/src/RCS/rzr087.c 1.1
 *----------------------------------------------------------------------
 * Function	:
 *	PLC書込みデータテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/prr0087.c 1.1 1970/01/01 00:00:00 ishidat Exp $
 *$Log: prr0087.c $
 * リビジョン 1.1  1970/01/01  00:00:00  ishidat
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr087.c 1.2 1997/11/18 17:15:19 chimura
 *Log: rzr087.c
 * リビジョン 1.2  1997/11/18  17:15:19  chimura
 * rzr087.hの変更に伴う修正
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(0775) 53-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0087.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*      pr_scan_plc_data                                                */
/*----------------------------------------------------------------------*/
/* 説明                                                                 */
/*      PLC書込みデータテキストを構造体にセーブする。                   */
/*----------------------------------------------------------------------*/
/* 引き数                                                               */
/*      *buf    : 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ                               */
/*                                                                      */
/* 戻り値                                                               */
/*      int     : 0     ･･･ 正常終了                                    */
/*                -1    ･･･ エラー                                      */
/*----------------------------------------------------------------------*/

int
pr_scan_plc_data(
	struct fmt_plc_wr	*buf
	)
{
	int	i;
	for(i=0; i<25; ++i){
		prr0087s.plc_wr_data[i] = htoi((char *)&buf->plc_wr_data[i][0]);
	}
	prr0087s.dump_mode = htoi((char *)&buf->dump_mode[0]);
	return(0);
}
