/*======================================================================
 * File name	: prr0078.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＡＴＡ偏差テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/prr0078.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: prr0078.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/lib/rzcmdx/src/RCS/rzr078.c 1.2 1996/07/12 19:41:00 hiroki Exp
 *log: rzr078.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2004, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0077.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_ata_dev						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	ＡＴＡ偏差　をテキストに変換する。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_ata_dev)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_ata_dev (
	struct fmt_ata_dev	*txt,
	struct prr0077t		*pkt
	)
{
	txt->ch_id = hex_ascii( pkt->ch_id );
	ltoh( (unsigned long)pkt->ata_dev, (char *)txt->ata_dev );
	return(++txt);
}
