/*======================================================================
 * File name	: prr0075.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *　ＤＣＡパラメータコマンドテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/prr0075.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: prr0075.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/lib/rzcmdx/src/RCS/rzr075.c 1.3 1996/07/12 19:19:54 hiroki Exp
 *log: rzr075.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2004, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0075.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_dca_parm						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	ＤＣＡパラメータコマンドのテキストを構造体にセーブする。    　　*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_dca_parm (
	struct fmt_dca_parm	*buf
	)
{
	prr0075s.dca_on_off = ascii_hex( buf->dca_on_off);
	prr0075s.dca_cycle  = htoi( (char *)buf->dca_cycle);
	prr0075s.dca_owf    = htoc( (char *)buf->dca_owf);
	prr0075s.dca_sdm    = htoc( (char *)buf->dca_sdm);
	return(0);
}
