/*======================================================================
 * File name	: prr0077.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *　ＡＴＡ偏差  テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/prr0077.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: prr0077.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/lib/rzcmdx/src/RCS/rzr077.c 1.3 1996/07/12 19:31:37 hiroki Exp
 *log: rzr077.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2004, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0077.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_ata_dev							*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	ＡＴＡ偏差のテキストを構造体にセーブする。		    　　*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_ata_dev (
	struct fmt_ata_dev	*buf
	)
{
	prr0077s.ch_id   = ascii_hex( buf->ch_id);
	prr0077s.ata_dev = htol( (char *)buf->ata_dev);
	return(0);
}
