/*======================================================================
 * File name	: prr1036.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	スパン調整用拡張パラメータテキスト作成
 *----------------------------------------------------------------------
 *$Header: P:/PRESTO2/shlib_v7/PRCMDX/src/RCS/PRR1036.c 1.1 2014-06-26 21:05:08+09 hiroe Exp $
 *$Log: PRR1036.c $
 *Revision 1.1  2014-06-26 21:05:08+09  hiroe
 *Initial revision
 *
 *----------------------------------------------------------------------
 *		(c) Copyright 2006, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr1035.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_span2_adj						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	スパン調整用テキストを構造体にセーブする。	*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_gate_position)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_span2_adj(
	struct fmt_span2_adj	*txt,
	struct prr1035t			*pkt
	)
{
	itoh( pkt->span_wt2, (char *)txt->span_wt2);
	return (++txt);
}
