/*======================================================================
 * File name	: prr1005.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	供給振り分け装置ゲート位置拡張パラメータテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/prr1005.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: prr1005.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2006, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr1005.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_gate_position						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	供給振り分け装置ゲート位置テキストを構造体にセーブする。	*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_gate_position(
	struct fmt_gate_position	*buf
	)
{
	int	i;

	prr1005s.nof_ch = ascii_hex(buf->nof_ch);
	/*ここから可変長データ処理*/
	for(i = 0; i < prr1005s.nof_ch; i++) {
		prr1005s.gate_position[i] = ascii_hex( buf->gate_position[i] );
	}
	return(0);
}
