/*======================================================================
 * File name    : prr1093.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	マルチ連動パラメータ２拡張パラメータ（１）テキスト解読
 *	補正方向
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/prr1093.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr1093.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmdx/src/RCS/rzr193.c 1.1 1970/01/01 00:00:00
 *Log: rzr193.c
 *----------------------------------------------------------------------
 *		(c) Copyright 1993, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-SHI
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr1093.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_mlt_parm2_ext						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	補正方向テキストを構造体にセーブする。				*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_mlt_parm2_ext(
	struct fmt_mlt_parm2_ext	*buf
	)
{
	unsigned char	*p;
	int		i, n;

	n = prr1093s.nof_mch = htoc((char *)buf->nof_mch);
	for (i = 0, p = &buf->node_id[0][0]; i < n; ++i) {
		prr1093s.node_id[i] = htoc((char *)p);
		p += sizeof(buf->node_id[0]);
	}
	return 0;
}
