/*======================================================================
 * File name	: prr1035.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	スパン調整用拡張パラメータテキスト解読
 *----------------------------------------------------------------------
 *$Header: P:/PRESTO2/shlib_v7/PRCMDX/src/RCS/PRR1035.c 1.1 2014-06-26 21:03:30+09 hiroe Exp $
 *$Log: PRR1035.c $
 *Revision 1.1  2014-06-26 21:03:30+09  hiroe
 *Initial revision
 *
 *----------------------------------------------------------------------
 *		(c) Copyright 2006, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr1035.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_span2_adj                                                   */
/*----------------------------------------------------------------------*/
/* 説明                                                                 */
/*	スパン調整用テキストを構造体にセーブする。                          */
/*----------------------------------------------------------------------*/
/* 引き数                                                               */
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ                                   */
/*	                                                                    */
/* 戻り値                                                               */
/*	int	: 0	･･･ 正常終了                                                */
/*		  -1	･･･ エラー                                              */
/*----------------------------------------------------------------------*/

int
pr_scan_span2_adj(
	struct fmt_span2_adj	*buf
	)
{
	prr1035s.span_wt2 = htoi( (char *)buf->span_wt2 );
	return(0);
}
