/*======================================================================
 * File name	: prr2023.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計量目標拡張パラメータ（２）テキスト解読
 *	特殊アベコン
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/prr2023.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: prr2023.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib_v7/rzcmdx/src/RCS/rzr223.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr223.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2005, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr2023.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_avg_parm						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	特殊アベコン用テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_avg_parm(
	struct fmt_avg_parm	*buf
	)
{
	prr2023s.avg_cycle = htoc((char *)buf->avg_cycle);
	prr2023s.avg_ratio = htoc((char *)buf->avg_ratio);
	prr2023s.avg_reset_count = htoi((char *)buf->avg_reset_count);
	return 0;
}
