/*======================================================================
 * File name	: prr4024.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	計量目標拡張パラメータテキスト作成
 *	ＡＴＡ　ＳＡＭＰＬＥ　ＳＩＺＥ
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmdx/src/rcs/prr4024.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: prr4024.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/lib/rzcmdx/src/RCS/rzr424.c 1.3 1996/07/17 17:18:33 hiroki Exp
 *log: rzr424.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2004, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr4023.h>		/* Show Current		*/

/*----------------------------------------------------------------------*/
/*	pr_print_sample_size						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	ata sample size の構造体をテキストに変換する			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_sample_size)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_sample_size(
	struct fmt_sample_size	*txt,
	struct prr4023t		*pkt
	)
{
	itoh( pkt->sample_size, (char *)txt->sample_size);
	ctoh( pkt->preset_num, (char *)txt->preset_num);
	return (++txt);
}
