/*----------------------------------------------------------------------*
 * File name	: handle.h												*
 *----------------------------------------------------------------------*
 *$Header: p:/h8sinc/rom/RCS/handle.h 1.1 1970/01/01 00:00:00 yonetsu Exp $
 *$Log: handle.h $
 * リビジョン 1.1  1970/01/01  00:00:00  yonetsu
 * 初期リビジョン
 * 
 *
 * このファイルは p:/h8inc/rom/rcs/handle.h 1.1 と同じ
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/

enum {
/*---------------------------------------------*/
	__FILE_STRUC_DEV,							/* ﾌｧｲﾙ構造を持つﾃﾞﾊﾞｲｽ	*/
	__E2ROM_,									/* EE-PROMﾃﾞﾊﾞｲｽ･ﾀｲﾌﾟ名	*/
	__SRAM_,									/* SRAM		"			*/
	__EXRAM_,									/* EXT-MEM	"			*/
/*---------------------------------------------*/
	__CHR_STREAM_DEV = __EXRAM_,				/* charｽﾄﾘｰﾑ形のﾃﾞﾊﾞｲｽ	*/
	__DPMEM_,									/* DP-SRAMﾃﾞﾊﾞｲｽ･ﾀｲﾌﾟ名	*/
	__SCI_,										/* SCU 		"			*/
	__MPSC_,									/* MPSC		"			*/
	__ARCNET_,									/* ARCNET	"			*/
	__I2NET_,									/* I2NET	"			*/
	__ADARC_,									/* ADV-ARC	"			*/
	__PRN_,										/* PRINTER	"			*/
/*---------------------------------------------*/
	__KEY_MAX_
};

#define	__FILE_KEY_MAX_	(__CHR_STREAM_DEV - __FILE_STRUC_DEV)


/*----------------------------------------------*/
/*		file name								*/
/*												*/
/*----------------------------------------------*/

/*	"e2rom"			EE-PROMのﾌｧｲﾙ･ﾈｰﾑ			*/
/*	"sram"			S-RAM		"				*/
/*	"exram"			外部ﾒﾓﾘｰ	"				*/
/*	"dpmem"			ﾃﾞｭｱﾙ･ﾎﾟｰﾄ･ﾒﾓﾘｰ	"			*/
/*	"con"			SCI			"				*/
/*	"tty"			MPSC		"				*/
/*	"lan"			ARCNET		"				*/
/*	"inet"			I2NET		"				*/
/*	"art"			ADV-ARC		"				*/
/*	"prn"			PRINTER		"				*/
