/*======================================================================
 * File name    : fsclose.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/api/rcs/fsclose.c 1.2 1970/01/01 00:00:00 kagatume Exp $
 *$Log: fsclose.c $
 * リビジョン 1.2  1970/01/01  00:00:00  kagatume
 * 2006/03/22 16:00
 * Saver60 Ver.01.09 up
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_Close                                                        */
/*         ：                                                                 */
/* パラメタ：IN:  int ファイルハンドル番号                                    */
/*         ：                                                                 */
/*         ：OUT:                                                             */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：正常終了  DFMR_SUC                                               */
/*         ：異常終了  DFMR_ERRPARAM                                          */
/*         ：          DFMR_EBADF                                             */
/* 概    要：ファイルのクローズ                                               */
/*         ：                                                                 */
/* 作 成 日：2004.05.27                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/* 01.09 ファイルハンドル排他制御処理追加                06/03/01 Y.Yoshizumi */
/******************************************************************************/

#include "fsbase.h"

int FMR_Close ( 
    int filehandle                      /* ファイルハンドル番号               */
)
{
	F_INT l_ortn;                       /* OS部戻り値                         */
	F_INT l_ortn1;                      /* OS部戻り値                         */

	F_BYTE l_drvnum;                    /* 論理ドライブ番号                   */

	/**************************************************************************/
	/* パラメータチェック                                                     */
	/**************************************************************************/
	/* ファイルハンドルの確認 */
	if( ( filehandle < 0 ) || ( DFMR_USR_MAXFILEHANDLE <= filehandle ) )
	{
		/* ファイルハンドルが範囲外の場合 */
		return DFMR_ERRPARAM;
	}
	
	if( tfmr_filehandle[ filehandle ].direntry.name[ 0 ] == DFMR_INITBYTE )
	{
		/* ファイルハンドルにファイルが関連付けされていない場合 */
		return DFMR_EBADF;
	}
	/* 論理ドライブ番号取得 */
	l_drvnum = tfmr_filehandle[ filehandle ].drivenum;
	/**************************************************************************/
	/* セマフォ資源獲得                                                       */
	/**************************************************************************/
	l_ortn = FMR_osWaiSem(
		MFMR_SEMID( l_drvnum )
		);
	if( l_ortn != DFMR_OK )
	{
		return l_ortn;
	}
	/**************************************************************************/
	/* ファイルハンドル用セマフォ資源獲得                                     */
	/**************************************************************************/
	l_ortn = FMR_osWaiSem(
		g_semid
		);
	if( l_ortn != DFMR_OK )
	{
		/* セマフォ資源返却 */
		l_ortn1 = FMR_osSigSem(
			MFMR_SEMID( l_drvnum )
			);
		if( l_ortn1 != DFMR_OK )
		{
			return l_ortn1;
		}
		return l_ortn;
	}
	/**************************************************************************/
	/* ファイルハンドル初期化                                                 */
	/**************************************************************************/
	FMR_initFileHandle(
		filehandle                      /* ファイルハンドル番号               */
		);
	/**************************************************************************/
	/* ファイルハンドル用セマフォ資源返却                                     */
	/**************************************************************************/
	l_ortn = FMR_osSigSem(
		g_semid
		);
	/**************************************************************************/
	/* セマフォ資源返却                                                       */
	/**************************************************************************/
	l_ortn1 = FMR_osSigSem(
		MFMR_SEMID( l_drvnum )
		);
	if( l_ortn1 != DFMR_OK )
	{
		return l_ortn1;
	}
	if( l_ortn != DFMR_OK )
	{
		return l_ortn;
	}
	/**************************************************************************/
	/* 正常終了返却                                                           */
	/**************************************************************************/
	return DFMR_SUC;
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
