/*======================================================================
 * File name    : fsopen.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/api/rcs/fsopen.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: fsopen.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_Open                                                         */
/*         ：                                                                 */
/* パラメタ：IN:  const char *  対象ファイルパス名                            */
/*         ：     int           オープンフラグ                                */
/*         ：     unsigend char 属性                                          */
/*         ：                                                                 */
/*         ：OUT:                                                             */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：正常終了  ファイルハンドル                                       */
/*         ：異常終了  DFMR_ERRPARAM                                          */
/*         ：          DFMR_EMFILE                                            */
/*         ：          DFMR_MEMFULL                                           */
/*         ：          DFMR_FATALERR                                          */
/*         ：          DFMR_EINVAL                                            */
/*         ：          DFMR_EACCES                                            */
/*         ：          DFMR_ENOENT                                            */
/*         ：          DFMR_EEXIST                                            */
/*         ：                                                                 */
/* 概    要：ファイルのオープン                                               */
/*         ：                                                                 */
/* 作 成 日：2004.05.27                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/
#include "fsbase.h"

int FMR_Open ( 
	const char * path,                  /* 対象ファイルパス名                 */
	int flag,                           /* オープンフラグ                     */
	unsigned char atrb                  /* 属性                               */
)
{
	F_INT l_handle;                     /* 取得ファイルハンドル番号           */
	F_INT l_rtn;                        /* サブルーチン戻り値                 */

	F_CHAR l_drvnum;                    /* 論理ドライブ番号                   */

	/**************************************************************************/
	/* パラメータチェック                                                     */
	/**************************************************************************/
	l_rtn = FMR_chkPathName(
		( F_CHAR * )path,               /* パス名                             */
		&l_drvnum                       /* 論理ドライブ番号                   */
		);
	if( l_rtn != DFMR_OK )              /* エラー終了の場合                   */
	{
		return l_rtn;
	}
	/* 属性のチェック */
	if( ( atrb & ~( DFMR_ATTR_RONLY | DFMR_ATTR_HIDE | DFMR_ATTR_SYS | DFMR_ATTR_ARC ) ) != 0x00 )
	{                                   /*                                    */
		return DFMR_ERRPARAM;           /* パラメータエラー返却               */
	}                                   /*                                    */
	/**************************************************************************/
	/* セマフォ資源獲得                                                       */
	/**************************************************************************/
	l_rtn = FMR_osWaiSem(
		MFMR_SEMID( l_drvnum )
		);
	if( l_rtn != DFMR_OK )
	{
		return l_rtn;
	}
	/**************************************************************************/
	/* ファイルオープン処理                                                   */
	/**************************************************************************/
	l_handle = FMR_subOpen( 
		path,                           /* 対象ファイルパス名                 */
		flag,                           /* オープンフラグ                     */
		atrb,                           /* 属性                               */
		l_drvnum                        /* 論理ドライブ番号                   */
		);
	if( l_handle < 0 ) {
		Clear_PowerFailureFlg(l_drvnum); 
	}
	
	/**************************************************************************/
	/* セマフォ資源返却                                                       */
	/**************************************************************************/
	l_rtn = FMR_osSigSem(
		MFMR_SEMID( l_drvnum )
		);
	if( l_rtn != DFMR_OK )
	{
		Clear_PowerFailureFlg(l_drvnum); 
		return l_rtn;
	}
	/**************************************************************************/
	/* ファイルハンドル番号返却                                               */
	/**************************************************************************/
	return l_handle;
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
