/*======================================================================
 * File name    : fsstat.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/api/rcs/fsstat.c 1.2 1970/01/01 00:00:00 kagatume Exp $
 *$Log: fsstat.c $
 * リビジョン 1.2  1970/01/01  00:00:00  kagatume
 * 2005/02/16 21:00
 * Saver60 Ver.01.04 up
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_Stat                                                         */
/*         ：                                                                 */
/* パラメタ：IN:  const char * パス名                                         */
/*         ：                                                                 */
/*         ：OUT: TFMR_FILE_INFO * ファイル状態格納領域                       */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：正常終了  DFMR_SUC                                               */
/*         ：異常終了  DFMR_ERRPARAM                                          */
/*         ：                                                                 */
/* 概    要：ファイル状態を取得する                                           */
/*         ：                                                                 */
/* 作 成 日：2004.05.31                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/* 01.04 取得ロングファイル名領域初期化追加              04/12/10 Y.Yoshizumi */
/******************************************************************************/

#include "fsbase.h"

int FMR_Stat ( 
	const char * path,                  /* パス名                             */
	TFMR_FILE_INFO * fileinfo           /* ファイル状態格納領域               */
)
{
	F_DWORD l_work01;                   /* ワークエリア                       */
	F_DWORD l_cdirclsnum;               /* カレントディレクトリの             */
	                                    /* クラスタ番号                       */
    F_CHAR * l_pathlen;                 /* パス名先頭からの最終要素の位置     */

	TFMR_DIRENTRY l_entry;              /* 取得エントリ                       */
	TFMR_SEARCHINFO l_toppos;           /* 検索処理パラメータ:先頭位置        */
	TFMR_SEARCHINFO l_bottompos;        /* 検索処理パラメータ:最終位置        */

	F_INT l_ortn;                       /* OS部戻り値                         */
	F_INT l_rtn;                        /* サブルーチン戻り値                 */

	F_CHAR l_getname[ DFMR_MAXFILESZ ]; /* 取得ロングファイル名               */
	
	F_CHAR l_drvnum;                    /* 論理ドライブ番号                   */
	F_BYTE l_prsflg;                    /* 検索処理動作フラグ                 */
	F_BYTE l_namelen;                   /* 対象ファイル名長                   */

	/**************************************************************************/
	/* パラメータチェック                                                     */
	/**************************************************************************/
	l_rtn = FMR_chkPathName(
		( F_CHAR * )path,               /* パス名                             */
		&l_drvnum                       /* 論理ドライブ番号                   */
		);
	if( l_rtn != DFMR_OK )              /* エラー終了の場合                   */
	{
		return l_rtn;
	}
	/* ファイル状態格納領域のチェック */
	if( fileinfo == NULL )              /* ファイル状態格納領域がNULLの場合   */
	{
		return DFMR_ERRPARAM;           /* パラメータエラーを返却             */
	}
	/**************************************************************************/
	/* セマフォ資源獲得                                                       */
	/**************************************************************************/
	l_ortn = FMR_osWaiSem(
		MFMR_SEMID( l_drvnum )
		);
	if( l_ortn != DFMR_OK )
	{
		return l_ortn;
	}
	/**************************************************************************/
	/* カレントディレクトリ検索                                               */
	/**************************************************************************/
	/* カレントディレクトリ検索処理 */
	l_prsflg = 0;
	path += 3;                          /* 先頭の｢A:\｣を飛ばす                */
	l_rtn = FMR_getCurrentDirCluster(
		l_drvnum,                       /* 論理ドライブ番号                   */
		( F_CHAR * )path,               /* パス名                             */
		&l_getname[ 0 ],                /* ロングファイル名用ワークエリア     */
		&l_prsflg,                      /* FMR_searchEntry用動作フラグ        */
		&l_toppos,                      /* 検索開始/終了先頭位置              */
		&l_pathlen,                     /* パス名先頭からの最終要素の位置     */
		&l_cdirclsnum                   /* カレントクラスタ番号               */
		);
	if( l_rtn < DFMR_OK )               /* エラー終了の場合                   */
	{
		goto ERROR;
	}
	l_namelen = ( F_BYTE )l_rtn;
	l_getname[ 0 ] = NULL;
	/**************************************************************************/
	/* 対象エントリ検索                                                       */
	/**************************************************************************/
	l_rtn = FMR_searchEntry(
		l_drvnum,                       /* 対象ドライブ番号                   */
		&l_toppos,                      /* 検索開始/終了先頭位置              */
		&l_bottompos,                   /* 検索終了最終位置                   */
		l_pathlen,                      /* 検索文字列                         */
		&l_entry,                       /* 取得エントリ                       */
		&l_getname[ 0 ],                /* 取得ロングファイル名               */
		l_namelen,                      /* 検索文字列長                       */
		l_prsflg                        /* 動作フラグ                         */
		);
	if( l_rtn != DFMR_OK )
	{
		if( l_rtn == DFMR_NOENTRY )
		{
			/* 対象エントリが存在しない場合、戻り値をDFMR_ENOENTとする    */
			l_rtn = DFMR_ENOENT;
		}
		goto ERROR;
	}
	/**************************************************************************/
	/* ファイル状態の設定                                                     */
	/**************************************************************************/
	FMR_setFileInfo(
		&l_entry,
		&l_getname[ 0 ],
		fileinfo
		);
	/**************************************************************************/
	/* セマフォ資源返却                                                       */
	/**************************************************************************/
	l_ortn = FMR_osSigSem(
		MFMR_SEMID( l_drvnum )
		);
	if( l_ortn != DFMR_OK )
	{
		return l_ortn;
	}
	/**************************************************************************/
	/* 正常終了返却                                                           */
	/**************************************************************************/
	return DFMR_SUC;

ERROR:
	/* 異常終了 */
	l_ortn = FMR_osSigSem(              /* セマフォ資源返却                   */
		MFMR_SEMID( l_drvnum )
		);
	if( l_ortn != DFMR_OK )
	{
		return l_ortn;
	}
	return l_rtn;

}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
