/*======================================================================
 * File name    : fstell.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/api/rcs/fstell.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: fstell.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_Tell                                                         */
/*         ：                                                                 */
/* パラメタ：IN:  int ファイルハンドル                                        */
/*         ：                                                                 */
/*         ：OUT:                                                             */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：正常終了  ファイル先頭から求めたファイルポインタ現在位置         */
/*         ：異常終了  DFMR_EBADF                                             */
/*         ：                                                                 */
/* 概    要：ファイルポインタの取得                                           */
/*         ：                                                                 */
/* 作 成 日：2004.05.27                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/

#include "fsbase.h"

long FMR_Tell ( 
	int filehandle                      /* ファイルハンドル                   */
)
{
	F_LONG l_fptr;                      /* ファイルポインタ                   */
	F_INT l_ortn;                       /* OS部関数戻り値                     */
	F_CHAR l_drvnum;                    /* 論理ドライブ番号                   */
	
	/**************************************************************************/
	/* パラメータチェックを行う                                               */
	/**************************************************************************/
	/* ファイルハンドル確認 */
	if( ( filehandle < 0 ) || ( DFMR_USR_MAXFILEHANDLE <= filehandle ) )
	{
		/* ファイルハンドル番号が許容範囲外の場合 */
		return DFMR_EBADF;
	}
	
	if( tfmr_filehandle[ filehandle ].direntry.name[ 0 ] == DFMR_INITBYTE )
	{
		/* ファイルハンドルにファイルが関連付けされていない場合 */
		return DFMR_EBADF;
	}
	
	/**************************************************************************/
	/* 初期設定を行う                                                         */
	/**************************************************************************/
	l_drvnum = tfmr_filehandle[ filehandle ].drivenum;
	                                    /* 論理ドライブ番号取得               */
	if( MFMR_DRVINFO( l_drvnum ) == ( F_VOID * )DFMR_RAMINIT )
	{
		/* 論理ドライブが未接続の場合 */
		return DFMR_DRVNOCONNECTERR;    /* 論理ドライブ未接続エラー           */
	}
	
	/**************************************************************************/
	/* セマフォ資源獲得                                                       */
	/**************************************************************************/
	l_ortn =  FMR_osWaiSem(
		MFMR_SEMID( l_drvnum )
		);
	if( l_ortn != DFMR_OK )
	{
		return l_ortn;
	}
	
	/**************************************************************************/
	/* ファイルポインタ取得                                                   */
	/**************************************************************************/
	l_fptr = ( F_LONG )tfmr_filehandle[ filehandle ].fptr;
	
	/**************************************************************************/
	/* セマフォ資源返却                                                       */
	/**************************************************************************/
	l_ortn =  FMR_osSigSem(
		MFMR_SEMID( l_drvnum )
		);
	if( l_ortn != DFMR_OK )
	{
		return l_ortn;
	}
	
	/**************************************************************************/
	/* 取得したファイルポインタを返却                                         */
	/**************************************************************************/
	return l_fptr;
	

}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
