/*======================================================================
 * File name    : drtcid.c
 * Original	: p:/lib/drive/rtc/rcs/drtcid.c 1.1
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: drtcid.c $
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/11/12 compiler ver7 vup
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * リアルタイム・クロック
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*drtcid = "$Header: p:/presto2/shlib_v7/drive/rtc/RCS/drtcid.c 1.2 1970/01/01 00:00:00 chimura Exp $";

