/*======================================================================
 * File name    : gdirname.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/utility/common/RCS/gdirname.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: gdirname.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_getDirName                                                   */
/*         ：                                                                 */
/* パラメタ：IN:  F_CHAR * エントリの名称部                                   */
/*         ：     F_CHAR * 名称を設定する領域                                 */
/*         ：                                                                 */
/* 戻 り 値：ファイル名長                                                     */
/*         ：                                                                 */
/* 概    要：エントリの名称部よりショートファイル名を取得する                 */
/*         ：                                                                 */
/* 作 成 日：2004.09.02                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/
#include "fsbase.h"
#include "utility.h"

F_WORD FMR_getDirName(
	F_CHAR * entname,                   /* エントリの名称部                   */
	F_CHAR * pathname                   /* 名称を設定する領域                 */
)
{
	F_CHAR l_cnt;                       /* ループカウンタ                     */
	F_INT l_len;                        /* ファイル名長                       */
	
	/* デリミタを設定する */
	*( pathname ) = '\\';
	pathname ++;
	l_len = 1;                          /* デリミタ長分をファイル名長に設定   */
	
	/* ファイル名を設定する */
	for( l_cnt = 0; l_cnt < DFMR_FNAMESZ; l_cnt ++ )
	{
		if( *( entname + l_cnt ) == DFMR_SPACE )
		{
			break;
		}
		*( pathname ) = *( entname + l_cnt );
		pathname ++;
		l_len ++;                       /* ファイル名分をファイル名長に加算   */
	}
	if( *( entname + DFMR_FNAMESZ ) == DFMR_SPACE )
	{                                   /* 拡張子がない場合はここで終了       */
		return l_len;
	}
	/* ピリオドを設定する */
	*( pathname ) = '.';
	pathname ++;
	l_len ++;                           /* ピリオド分をファイル名長に加算     */
	
	/* 拡張子を設定する */
	entname += DFMR_FNAMESZ;
	for( l_cnt = 0; l_cnt < DFMR_EXTSZ; l_cnt ++ )
	{
		if( *( entname + l_cnt ) == DFMR_SPACE )
		{
			break;
		}
		*( pathname ) = *( entname + l_cnt );
		pathname ++;
		l_len ++;                       /* 拡張子分をファイル名長に加算       */
	}
	return l_len;
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
