/*======================================================================
 * File name    : sfatrtry.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/utility/common/RCS/sfatrtry.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: sfatrtry.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_setFatSectorRetry                                            */
/*         ：                                                                 */
/* パラメタ：IN:  F_CHAR ドライブ番号                                         */
/*         ：     F_BYTE  FAT読込み領域番号                                   */
/*         ：                                                                 */
/* 戻 り 値：DFMR_SUC 正常終了                                                */
/*         ：(負の値) 異常終了                                                */
/*         ：                                                                 */
/* 概    要：対象FATセクタを書込む                                            */
/*         ：                                                                 */
/* 作 成 日：2004.09.02                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/
#include "fsbase.h"
#include "utility.h"

F_INT FMR_setFatSectorRetry(
	F_CHAR drvnum,                      /* ドライブ番号                       */
    F_BYTE fatarea                      /* FAT読込み領域番号                  */
)
{
	F_INT l_rtn;                        /* サブルーチン戻り値                 */
	F_INT l_retrycnt;                   /* リトライカウンタ                   */
	
	for( l_retrycnt = 0; l_retrycnt < DFMR_USR_SDRETRY; l_retrycnt ++ )
	{
		/* FATセクタを書込む */
		l_rtn = FMR_setFatSector(
			MFMR_DRVINFO( drvnum ),             /* 論理ドライブ構成情報       */
			MFMR_FATTABLE( drvnum, fatarea ),   /* FAT読込み領域              */
			fatarea                             /* FAT読込み領域番号          */
			);
		if( l_rtn == DFMR_OK )          /* 正常終了の場合は処理終了           */
		{
			break;
		}
		FMR_osRetryWait( );             /* ウェイト                           */
	}
	return l_rtn;
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
