/*======================================================================
 * File name    : checksum.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/common/rcs/checksum.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: checksum.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_getChkSum                                                    */
/*         ：                                                                 */
/* パラメタ：IN:  F_CHAR * ショートファイル名                                 */
/*         ：                                                                 */
/*         ：OUT: なし                                                        */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：F_BYTE サム値                                                    */
/*         ：                                                                 */
/* 概    要：ショートファイル名からサム値を求める                             */
/*         ：                                                                 */
/* 作 成 日：2004.04.17                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/

#include "fsbase.h"

F_BYTE FMR_getChkSum(
    F_CHAR * filename                   /* ショートファイル名                 */
)
{
    F_BYTE l_cnt;                       /* ループカウンタ                     */
    F_BYTE l_sum;                       /* サム値                             */

    l_sum = 0;                          /* サム値←0                          */
    
    for ( l_cnt = 0; l_cnt < DFMR_FNAMESZ + DFMR_EXTSZ; l_cnt ++, filename ++ )
    {
        l_sum = ( F_BYTE )( ( (l_sum & 1) ? 0x80 : 0 ) + ( l_sum >> 1 ) + *( filename ) );
    }
    return( l_sum );
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
