/*======================================================================
 * File name    : gfatval.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/common/rcs/gfatval.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: gfatval.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_getFatValue                                                  */
/*         ：                                                                 */
/* パラメタ：IN: F_BYTE * FATバッファアドレス                                 */
/*         ：    F_BYTE FATタイプ                                             */
/*         ：    F_DWORD クラスタ番号                                         */
/*         ：                                                                 */
/*         ：OUT: なし                                                        */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：正常終了  FATエントリ                                            */
/*         ：                                                                 */
/* 概    要：FATエントリ値取り出し                                            */
/*         ：                                                                 */
/* 作 成 日：2004.06.09                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/

#include "fsbase.h"

F_DWORD FMR_getFatValue(
    F_BYTE * fatbuff,                   /* FATバッファアドレス                */
    F_BYTE fattype,                     /* FATタイプ                          */
    F_DWORD clstnum                     /* クラスタ番号                       */
)
{
	T_ENDIAN l_endian;                  /* エンディアン調整用ワーク           */
	F_WORD l_wwork;                     /* 16bit ワークエリア                 */
	
	if( fattype == DFMR_FATTYPE32 )
	{
		/**********************************************************************/
		/* FAT32の場合                                                        */
		/**********************************************************************/
#ifdef DFMR_ENDIAN_BIG                  /* Big Endian                         */
		l_endian.byteval[0] = *( fatbuff + 3 );
		l_endian.byteval[1] = *( fatbuff + 2 );
		l_endian.byteval[2] = *( fatbuff + 1 );
		l_endian.byteval[3] = *( fatbuff );
#else /* DFMR_ENDIAN_BIG */             /* Little Endian                      */
		l_endian.dwordval = *( ( F_DWORD * )fatbuff );
#endif /* DFMR_ENDIAN_BIG */
		return l_endian.dwordval;
	}
	else
	{
		/**********************************************************************/
		/* FAT12/16の場合                                                     */
		/**********************************************************************/
		l_wwork = ( F_WORD )( *( fatbuff + 1 ) );
		l_wwork = ( l_wwork << 8 ) | ( F_WORD )( *( fatbuff ) );
		if( fattype == DFMR_FATTYPE16 )
		{
			/******************************************************************/
			/* FAT16の場合                                                    */
			/******************************************************************/
			return ( F_DWORD )l_wwork;
		}
		else
		{
			/******************************************************************/
			/* FAT12の場合                                                    */
			/******************************************************************/
			if( ( clstnum & 0x0001 ) == 0x0001 )
			{
				l_wwork >>= 4;
				l_wwork &= 0x0FFF;
			}
			else
			{
				l_wwork &= 0x0FFF;
				
			}
		}
		return ( F_DWORD )l_wwork;
	}
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
