/*======================================================================
 * File name    : inisrhdl.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/common/rcs/inisrhdl.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: inisrhdl.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_initSearchHandle                                             */
/*         ：                                                                 */
/* パラメタ：IN:  F_INT 検索ハンドル番号                                      */
/*         ：                                                                 */
/*         ：OUT: なし                                                        */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：void                                                             */
/*         ：                                                                 */
/* 概    要：検索ハンドルを初期化する                                         */
/*         ：                                                                 */
/* 作 成 日：2004.06.09                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/

#include "fsbase.h"

F_VOID FMR_initSearchHandle(
    F_INT handle                        /* 検索ハンドル番号                   */
)
{
	tfmr_searchhandle[ handle ].sectornum = 0xFFFFFFFF;
	tfmr_searchhandle[ handle ].position = 0xFF;
	tfmr_searchhandle[ handle ].drivenum = 0;
	FMR_memSet(
		tfmr_searchhandle[ handle ].keyword,
		0xFF,
		DFMR_MAXFILESZ
		);
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
