/*======================================================================
 * File name    : sjis_uni.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/common/rcs/sjis_uni.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: sjis_uni.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_exchgSJISToUnicode                                           */
/*         ：                                                                 */
/* パラメタ：IN:  F_CHAR * 変換前文字列                                       */
/*         ：     F_WORD 変換文字数                                           */
/*         ：                                                                 */
/*         ：OUT: F_WORD * 変換後文字列                                       */
/*         ：                                                                 */
/*         ：                                                                 */
/* 戻 り 値：void                                                             */
/*         ：                                                                 */
/* 概    要：ASCII/Shift-JIS → Unicodeの変換を行う。                         */
/*         ：                                                                 */
/* 作 成 日：2004.06.09                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/

#include "fsbase.h"

F_VOID FMR_exchgSJISToUnicode(
	F_CHAR * srcstr,                    /* 変換前文字列                       */
	F_WORD * buff,                      /* 変換後文字列                       */
	F_WORD num                          /* 変換文字数                         */
)
{
	F_WORD l_cnt;                       /* ループカウンタ                     */
	F_WORD l_work;                      /* ワークエリア                       */
	
	for( l_cnt = 0; l_cnt < num; l_cnt ++ )
	{
#ifdef DFMR_ENDIAN_BIG
		l_work = ( F_WORD )( ( F_WORD )( *( srcstr + l_cnt ) ) & 0x00FF );
		l_work <<= 8;
		l_work &= 0xFF00;
#else /* DFMR_ENDIAN_BIG */
		l_work = ( F_WORD )( ( F_WORD )( *( srcstr + l_cnt ) ) & 0x00FF );
#endif /* DFMR_ENDIAN_BIG */
		*( buff + l_cnt ) = l_work;
	}
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
