/*======================================================================
 * File name    : wenddata.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/fat/common/rcs/wenddata.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: wenddata.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_writeEndData                                                 */
/*         ：                                                                 */
/* パラメタ：IN:  F_DWORD * 書込み開始セクタ番号                              */
/*         ：     F_DWORD * 新規取得最終クラスタ番号                          */
/*         ：     F_DWORD * 新規取得先頭クラスタ番号                          */
/*         ：     F_BYTE  * 現在参照中のFAT読込み領域番号                     */
/*         ：     F_CHAR    対象ドライブ番号                                  */
/*         ：                                                                 */
/* 戻 り 値：正常終了  DFMR_OK                                                */
/*         ：異常終了  DFMR_MEMFULL                                           */
/*         ：                                                                 */
/* 概    要：書込みデータ後部端数部を書き込む                                 */
/*         ：                                                                 */
/* 作 成 日：2004.05.25                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/

#include "fsbase.h"

F_INT FMR_writeEndData(
    F_DWORD * writesectnum,             /* 書込み開始セクタ番号               */
	F_DWORD * newbtmclstnum,            /* 新規取得最終クラスタ番号           */
	F_DWORD * newtopclstnum,            /* 新規取得先頭クラスタ番号           */
	F_BYTE  * fatareanum,               /* 現在参照中のFAT読込み領域番号      */
    F_CHAR    drvnum                    /* 対象ドライブ番号                   */
)
{
	F_DWORD l_work01;                   /* ワークエリア                       */
	F_DWORD l_work02;
	F_DWORD l_work03;
	F_DWORD l_work04;
	F_INT   l_drtn;                     /* サブルーチン戻り値                 */

	if( *( writesectnum ) != 0 )
	{
		/**********************************************************************/
		/* 端数データを連続書込み終了時クラスタ内のセクタに書込む             */
		/**********************************************************************/
		l_drtn = FMR_setDataSector(
			drvnum,
			*( writesectnum ),
			0
			);
	}
	else
	{
		/**********************************************************************/
		/* 端数を新規に取得するクラスタに書込む場合                           */
		/**********************************************************************/
		l_work01 = FMR_getEmptyCluster(
			drvnum,                     /* 対象論理ドライブ番号               */
			*( newbtmclstnum ) + 1,     /* 検索開始クラスタ番号               */
			*( fatareanum )             /* 検索FAT読込み領域                  */
			);
		if( l_work01 == DFMR_LNG )
		{
			/******************************************************************/
			/* FAT読込み領域内で空きクラスタが存在しなかった場合              */
			/******************************************************************/
			if( *( fatareanum ) != DFMR_REFFATAREA0 )
			{
				/**************************************************************/
				/* アクセス対象のFAT読込み領域が0以外の場合はFATを書込む      */
				/**************************************************************/
				l_drtn = FMR_setFatSector(
					MFMR_DRVINFO( drvnum ),/* 論理ドライブ構成情報            */
					MFMR_FATTABLE( drvnum, *( fatareanum ) ),
					                    /* FAT読込み領域アドレス              */
					*( fatareanum )     /* FAT読込み領域番号                  */
					);
				if( l_drtn != DFMR_OK )
				{
					return l_drtn;
				}
			}
			/* FATセクタ管理領域より空きクラスタを取得する */
			l_drtn = FMR_searchEmptyCluster(
				drvnum,                 /* 対象論理ドライブ番号               */
				&l_work01               /* 取得空きクラスタ番号               */
				);
			if( l_drtn != DFMR_OK )
			{
				return l_drtn;
			}
			/******************************************************************/
			/* 端数データを取得した空クラスタの先頭セクタに書込む             */
			/******************************************************************/
			l_work02 = FMR_getSectNum( l_work01, 0, drvnum );
			*( writesectnum ) = l_work02;
			l_drtn = FMR_setDataSector(
				drvnum,
				l_work02,
				0
				);
			if( l_drtn != DFMR_OK )
			{
				return l_drtn;
			}
			/******************************************************************/
			/* 連続書込処理で取得した最終クラスタ番号(*( newbtmclstnum ))の   */
			/* FATエントリに、上のFMR_searchEmptyClusterで取得した            */
			/* クラスタ番号(l_work01)を設定する                               */
			/******************************************************************/
			l_drtn = FMR_linkNewCluster(
				*( newbtmclstnum ),     /* リンク対象クラスタ番号             */
				&l_work01,              /* FATエントリ設定値                  */
				fatareanum,             /* 現在参照中のFAT読込み領域番号      */
				drvnum                  /* 対象ドライブ番号                   */
				);
		}
		else
		{
			/******************************************************************/
			/* FAT読込み領域内で空きクラスタが存在した場合                    */
			/******************************************************************/
			/******************************************************************/
			/* 端数データを取得した空クラスタの先頭セクタに書込む             */
			/******************************************************************/
			l_work02 = FMR_getSectNum( l_work01, 0, drvnum );
			*( writesectnum ) = l_work02;
			l_drtn = FMR_setDataSector(
				drvnum,
				l_work02,
				0
				);
			if( l_drtn != DFMR_OK )
			{
				return l_drtn;
			}
			/******************************************************************/
			/* 連続書込処理で取得した最終クラスタ番号(*( newbtmclstnum ))の   */
			/* FATエントリに、上のFMR_getEmptyClusterで取得した               */
			/* クラスタ番号(l_work01)を設定する                               */
			/******************************************************************/
			l_drtn = FMR_controlFatEntry(
				MFMR_DRVINFO( drvnum ), /* 論理ドライブ構成情報アドレス       */
				MFMR_FATTABLE( drvnum, *( fatareanum ) ),
				                        /* FAT読込み領域アドレス              */
				*( newbtmclstnum ),     /* クラスタ番号                       */
				&l_work01,              /* FATエントリ値                      */
				DFMR_FLGON              /* Read/Write種別：Write指定          */
				);
		}
		/* 新規取得最終クラスタ番号を更新 */
		*( newbtmclstnum ) = l_work01;
		if( *( newtopclstnum ) == 0 )
		{
			/******************************************************************/
			/* 新規取得先頭クラスタ番号がまだ未設定の場合                     */
			/******************************************************************/
			/* 取得した空きクラスタ番号を新規取得クラスタ番号に設定 */
			*( newtopclstnum ) = l_work01;
		}
	}
	return l_drtn;
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
