/*----------------------------------------------------------------------*
 * File name	: chkbcc.c		/ check BCC								*
 *----------------------------------------------------------------------*
 *$Header: p:/h8lib/custom/src/rcs/chkbcc.c 1.1 1996/01/19 10:49:20 kabumoto Exp $
 *$Log: chkbcc.c $
 * リビジョン 1.1  1996/01/19  10:49:20  kabumoto
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/
/* 説明                                    			              		*/
/*		buffで示されるバッファの指定バイト数をＥＸＯＲし、その			*/
/*		結果を返す。													*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		*buff		: ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ									*/
/*		len			: ﾊﾞｲﾄ数											*/
/*																		*/
/* 戻り値																*/
/*		unsigned char	: 計算結果										*/
/*----------------------------------------------------------------------*/

unsigned char
check_bcc(
	register unsigned char	*buff,
	register int			len
	)
{
	unsigned char			bcc = 0;

	for( ; len ; --len) {
		bcc ^= *buff;
		++buff;
	}
	return(bcc);
}
