/*----------------------------------------------------------------------*
 * File name	: chrcmp.c		/					 					*
 *----------------------------------------------------------------------*
 *$Header: p:/h8lib/custom/src/rcs/chrcmp.c 1.1 1996/01/19 10:49:31 kabumoto Exp $
 *$Log: chrcmp.c $
 * リビジョン 1.1  1996/01/19  10:49:31  kabumoto
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/
/* 説明                                             		     		*/
/*		buffで示されるバッファの指定バイト数すべてが、指定した			*/
/*		キャラクタ･データか否かをテストし、その結果を返す。				*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		*buff		: ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ									*/
/*		chr			: 指定ｷｬﾗｸﾀ											*/
/*		len			: ﾊﾞｲﾄ数											*/
/*																		*/
/* 戻り値																*/
/*		int			: 0	･･･ すべてchrと一致								*/
/*					  1	･･･ chr以外のデータ								*/
/*----------------------------------------------------------------------*/

typedef union uci {
	unsigned char	c[2];							/* charの配列データ	*/
	int				i;								/* intデータ		*/
} UCI;

int
chrcmp(
	register union uci	*buff,
	union uci			chr,
	register int		len
	)
{
	int			odd;								/* 奇数バイトか否か	*/

	chr.c[1] = chr.c[0];
	odd = len & 0x1;
	if(len >>= 1) {
		do {
			if(buff->i != chr.i)						return(1);
			++buff;
		} while(--len);
	}
	if(odd) {
		if(buff->c[0] != chr.c[0])						return(1);
	}
	return(0);
}
