/*----------------------------------------------------------------------*
 * File name	: cksmapl.c		/					 					*
 *----------------------------------------------------------------------*
 *$Header: p:/h8lib/custom/src/rcs/cksmalp.c 1.1 1996/01/19 10:50:34 kabumoto Exp $
 *$Log: cksmalp.c $
 * リビジョン 1.1  1996/01/19  10:50:34  kabumoto
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/
/* 説明                                             		     		*/
/*		buffで示されるバッファの指定バイト数の内アルファニューメ		*/
/*		リック･データのみをバイト加算し、その結果を返す。				*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		*buff		: ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ									*/
/*		len			: ﾊﾞｲﾄ数											*/
/*																		*/
/* 戻り値																*/
/*		unsigned char	: 計算結果										*/
/*----------------------------------------------------------------------*/

unsigned char
cksum_alpha(
	register unsigned char	*buff,
	register int			len
	)
{
	unsigned char		sum = 0;

	for( ; len ; --len) {
		if(*buff & 0xe0)  sum += *buff;
		++buff;
	}
	return(sum);
}
