/*----------------------------------------------------------------------*
 * File name	: cksmcpl.c		/					 					*
 *----------------------------------------------------------------------*
 *$Header: p:/h8lib/custom/src/rcs/cksmcpl.c 1.1 1996/01/19 10:50:46 kabumoto Exp $
 *$Log: cksmcpl.c $
 * リビジョン 1.1  1996/01/19  10:50:46  kabumoto
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/
/* 説明                                             		     		*/
/*		buffで示されるバッファの指定バイト数をバイト加算し、その		*/
/*		２の補数を返す。												*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		*buff		: ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ									*/
/*		len			: ﾊﾞｲﾄ数											*/
/*																		*/
/* 戻り値																*/
/*		unsigned char	: 計算結果										*/
/*----------------------------------------------------------------------*/

unsigned char
cksum_cpl(
	register unsigned char	*buff,
	register int			len
	)
{
	unsigned char		sum = 0;

	for( ; len ; --len) {
		sum += *buff;
		++buff;
	}
	return(-sum);
}
