/*======================================================================
 * File name : customid.c
 *----------------------------------------------------------------------
 * Function	 : ＩＤファイル
 *----------------------------------------------------------------------
 *$Header: p:/h8slib/custom/src/RCS/custmid.c 1.1 1970/01/01 00:00:00 yonetsu Exp $
 *$Log: custmid.c $
 * リビジョン 1.1  1970/01/01  00:00:00  yonetsu
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *				(c) Copyright 1993, ISHIDA CO., LTD.
 *				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *				SHIGA JAPAN
 *				(0775) 53-4141
 *======================================================================
 */

const char * const customid = "$Header: p:/h8slib/custom/src/RCS/custmid.c 1.1 1970/01/01 00:00:00 yonetsu Exp $";
