/*----------------------------------------------------------------------*
 * File name	: htoi.c		/ convert ascii hex to binary			*
 *----------------------------------------------------------------------*
 *$Header: p:/h8lib/custom/src/rcs/htoi.c 1.3 1996/04/04 18:58:02 minaguchi Exp $
 *$Log: htoi.c $
 * リビジョン 1.3  1996/04/04  18:58:02  minaguchi
 * htol関数がインテル系のメモリ配置対応であったので、これをモトローラ系の
 * メモリ配置対応にした。
 * 
 * リビジョン 1.2  1996/01/29  14:33:20  kabumoto
 * custim.hをincludesしﾌﾟﾛﾄﾀｲﾌﾟに引数を合わせる
 * 
 * リビジョン 1.1  1996/01/19  10:51:41  kabumoto
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*/
/*				(c) Copyright 1993, ISHIDA  CO., LTD.					*/
/*				959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN					*/
/*				SHIGA JAPAN												*/
/*				(0775) 53-4141											*/
/*----------------------------------------------------------------------*/

#include	<custom\custom.h>


/*----------------------------------------------------------------------*/
/*		htoi															*/
/*----------------------------------------------------------------------*/
/* 説明                                                  				*/
/*		4byteのHEX ASCIIをint型に変換する。								*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		*buff	: HEX ASCII文字列へのポインタ							*/
/*																		*/
/* 戻り値																*/
/*		int		: 変換後の値											*/
/*----------------------------------------------------------------------*/

int
htoi(
	void		*buf
	)
{
	unsigned char	*buff = buf;
	int				i, j;

	i = 0;
	for(j=0; j<4; j++) {
		if(*buff >= 'A')						   i= i*16 + *buff - 'A' + 10;
		else if((*buff >= '0') && (*buff <= '9'))  i= i*16 + *buff - '0';
		buff++;
	}
	return(i);
}

/*----------------------------------------------------------------------*/
/*		htoc															*/
/*----------------------------------------------------------------------*/
/* 説明                                             		     		*/
/*		2byteのHEX ASCIIをchar型に変換する。							*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		*buff	: HEX ASCII文字列へのポインタ							*/
/*																		*/
/* 戻り値																*/
/*		char	: 変換後の値											*/
/*----------------------------------------------------------------------*/

unsigned char
htoc(
	void		*buf
	)
{
	unsigned char	*buff = buf;
	int				i,j;

	i = 0;
	for(j=0; j<2; j++) {
		if(*buff >= 'A') 						  i= i*16 + *buff - 'A' + 10;
		else if((*buff >= '0') && (*buff <= '9')) i= i*16 + *buff - '0';
		buff++;
	}
	return(i);
}

/*----------------------------------------------------------------------*/
/*		htol															*/
/*----------------------------------------------------------------------*/
/* 説明                                     		             		*/
/*		8byteのHEX ASCIIをlong型に変換する。							*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*		*buff	: HEX ASCII文字列へのポインタ							*/
/*																		*/
/* 戻り値																*/
/*		long	: 変換後の値											*/
/*----------------------------------------------------------------------*/

long
htol(
	void		*buf
	)
{
	unsigned char	*buff = buf;
	union {
		unsigned long	l;
		unsigned char	c[sizeof(long)];
	}		u;
	int		i;

	for( i=0; i<sizeof(long); i++ ) {
		u.c[i] = ascii_hex(*buff)<<4;
		++buff;
		u.c[i] |= ascii_hex(*buff);
		++buff;
	}
	return((long)u.l);
}
