/*======================================================================
 * File name    : rzcmdid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: rzcmdid.c $
 * リビジョン 1.5  1970/01/01  00:00:00  kawamura
 * 2003/09/25  14:58
 * 符号拡張が正しく行われない不具合を修正する。
 * 
 * リビジョン 1.4  1970/01/01  00:00:00  chimura
 * 2003/08/05 compiler ver7 vup
 * 
 * リビジョン 1.3  1970/01/01  00:00:00  kawamura
 * 2003/05/30  14:45
 * キャストの方法が間違っていたので修正する。
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  kawamura
 * 2003/05/02  08:45
 * ワーニング対策
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Log: rzcmdid.c
 * リビジョン 1.9  1995/11/21  09:40:19  hiroe
 * Ver3用のテキストファイル（rzi009a, rzi010a, rzi013s, rzi014a, rzi017a,
 * rzi018a, rzr025a, rzr026a）を追加する。
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*rzcmdid = "$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzcmdid.c 1.5 1970/01/01 00:00:00 kawamura Exp $";
