/*======================================================================
 * File name    : rzi027.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	周辺異常発生テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzi027.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi027.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzi027.cv  1.1  94/02/07 19:53:14  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzi027.cv
 * Revision 1.1  94/02/07 19:53:14  ryoji
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzi027.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_pcuerr							*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	エラーテキストを構造体にセーブする。				*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_pcuerr(
	struct fmt_pcuerr	*buf
	)
{
	rzi027s.error = ascii_hex(buf->error);
	rzi027s.ptn = htol((char *)buf->ptn);
	return(0);
}
