/*======================================================================
 * File name    : rzi028.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	周辺異常発生テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzi028.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi028.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzi028.cv  1.1  94/02/07 19:53:56  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzi028.cv
 * Revision 1.1  94/02/07 19:53:56  ryoji
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzi027.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_pcuerr							*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	エラー構造体のデータをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_error)	･･･ 正常終了			*/
/*		  NULL			･･･ エラー			*/
/*----------------------------------------------------------------------*/

void *
rz_print_pcuerr(
	struct fmt_pcuerr	*txt,
	struct rzi027t		*pkt
	)
{
	txt->error = hex_ascii(pkt->error);
	ltoh((unsigned long)pkt->ptn, (char *)txt->ptn);
	return(++txt);
}
