/*======================================================================
 * File name    : rzi020.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	受信完了テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzi020.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi020.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzi020.cv  2.2  93/12/26 16:17:48  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzi020.cv
 * Revision 2.2  93/12/26 16:17:48  ryoji
 * チャンエル番号付加
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzi019.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_echo							*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	受信完了構造体のデータをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_echo)	･･･ 正常終了			*/
/*		  NULL			･･･ エラー			*/
/*----------------------------------------------------------------------*/

void *
rz_print_echo(
	struct fmt_echo		*txt,
	struct rzi019t		*pkt
	)
{
	txt->command = pkt->command;
	txt->ch_id = hex_ascii(pkt->ch_id);
	return(++txt);
}
