/*======================================================================
 * File name    : rzi035.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ネットワーク参加状態テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzi035.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi035.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmd/src/RCS/rzi035.c 1.2 1994/11/04 18:53:35 ohtani
 *Log: rzi035.c
 * リビジョン 1.2  1994/11/04  18:53:35  ohtani
 * マップ格納バッファをビット・マップ化する。
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<string.h>			/* ANSI std		*/
#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show rzcmd		*/
#define		STORAGE
#include	<rzcmd\rzi035.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_netmap							*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ネットワーク参加状態テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_netmap(
	struct fmt_netmap	*buf
	)
{
	unsigned char	*s,*t;
	int		i;

	rzi035s.brd_id = ascii_hex(buf->brd_id);
	rzi035s.dev_no = htoc((char *)buf->dev_no);
	s = rzi035s.net_map;
	t = buf->net_map;
	for ( i=0; i<32; i++ ) {
		*s++ = htoc((char *)t);
		t += 2;
	}
	rzi035s.recon = htoi((char *)buf->recon);
	return(0);
}
