/*======================================================================
 * File name    : rzi008.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	補正値テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzi008.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi008.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzi008.cv  2.1  93/11/02 19:09:18  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzi008.cv
 * Revision 2.1  93/11/02 19:09:18  ryoji
 * 第５版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzi007.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_cmpn_value						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	補正値自動更新結果の構造体データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_cmpn_val)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_cmpn_value(
	struct fmt_cmpn_value	*txt,
	struct rzi007t		*pkt
	)
{
	/* BYTE		*buf; */

	ctoh(pkt->cmpn_val, (char *)&txt->cmpn_val);
	return(++txt);
}
