/*======================================================================
 * File name    : rzi022.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	動作完了テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzi022.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi022.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzi022.cv  2.2  93/12/10 19:21:52  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzi022.cv
 * Revision 2.2  93/12/10 19:21:52  ryoji
 * 動作完了のチャンネル番号が文字化されていないバグ修正
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzi021.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_complete						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	動作完了構造体のデータをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_complete)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_complete(
	struct fmt_complete	*txt,
	struct rzi021t		*pkt
	)
{
	txt->command = pkt->command;
	txt->ch_id = hex_ascii(pkt->ch_id);
	return(++txt);
}
