/*======================================================================
 * File name    : rzi019.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	受信完了テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzi019.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi019.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzi019.cv  2.2  93/12/26 16:17:26  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzi019.cv
 * Revision 2.2  93/12/26 16:17:26  ryoji
 * チャンネル番号付加
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzi019.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_echo							*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	受信完了テキストを構造体にセーブする。				*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_echo(
	struct fmt_echo	*buf
	)
{
	rzi019s.command = buf->command;
	rzi019s.ch_id = ascii_hex(buf->ch_id);
	return(0);
}
