/*======================================================================
 * File name    : rzi023.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	システム異常発生テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzi023.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzi023.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzi023.cv  2.2  94/04/12 17:39:56  kabumoto
 *Log: P:/LIB/RZCMD/SRC/RCS/rzi023.cv
 * Revision 2.2  94/04/12 17:39:56  kabumoto
 * ワーニング除去
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<string.h>			/* ANSI std		*/
#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzi023.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_sys_fault						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	システムエラーテキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_sys_fault(
	struct fmt_sys_fault	*buf
	)
{
	rzi023s.len = htoc((char *)buf->len);
	strncpy((char *)&rzi023s.mes_str, (char *)&buf->mes_str, (size_t)rzi023s.len);
	return(0);
}
