/*======================================================================
 * File name    : rzr043.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	全排出停止テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr043.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr043.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr043.cv  2.1  93/11/02 19:22:14  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzr043.cv
 * Revision 2.1  93/11/02 19:22:14  ryoji
 * 第５版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr043.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_drain_stop						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	全排出停止テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_drain_stop(
	struct fmt_drain_stop	*buf
	)
{
	rzr043s.ch_id = ascii_hex(buf->ch_id);
	return(0);
}
