/*======================================================================
 * File name    : rzr036.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	スパン調整テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr036.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr036.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr036.cv  2.1  93/11/02 19:21:18  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzr036.cv
 * Revision 2.1  93/11/02 19:21:18  ryoji
 * 第５版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr035.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_span_adj						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	スパン校正構造体のデータをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_span_adj)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_span_adj(
	struct fmt_span_adj	*txt,
	struct rzr035t		*pkt
	)
{
	txt->ch_id = hex_ascii(pkt->ch_id);
	ctoh(pkt->nof_head, (char *)&txt->nof_head);
	ltoh((unsigned long)pkt->adj_head_ptn, (char *)&txt->adj_head_ptn);
	return(++txt);
}
