/*======================================================================
 * File name    : rzr041.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	全排出開始テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr041.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr041.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr041.cv  2.1  93/11/02 19:22:34  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzr041.cv
 * Revision 2.1  93/11/02 19:22:34  ryoji
 * 第５版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr041.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_drain_run						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	全排出開始テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_drain_run(
	struct fmt_drain_run	*buf
	)
{
	rzr041s.ch_id = ascii_hex(buf->ch_id);
	rzr041s.infeed = ascii_hex(buf->infeed);
	rzr041s.auto_zero = ascii_hex(buf->auto_zero);
	return(0);
}
