/*======================================================================
 * File name    : rzr048.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	手動計算排出テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr048.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr048.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr048.cv  2.1  93/11/02 19:24:40  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzr048.cv
 * Revision 2.1  93/11/02 19:24:40  ryoji
 * 第５版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr047.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_test_caldmp						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	テスト組み合わせ計算&排出構造体のデータをテキストに変換する。	*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_test_caldmp)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_test_caldmp(
	struct fmt_test_caldmp	*txt,
	struct rzr047t		*pkt
	)
{
	txt->ch_id = hex_ascii(pkt->ch_id);
	return(++txt);
}
