/*======================================================================
 * File name    : rzr049.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	エラー解除テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr049.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr049.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr049.cv  2.1  93/11/02 19:24:30  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzr049.cv
 * Revision 2.1  93/11/02 19:24:30  ryoji
 * 第５版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr049.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_error_cancel						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	エラー解除テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_error_cancel(
	struct fmt_error_cancel	*buf
	)
{
	rzr049s.ch_id = ascii_hex(buf->ch_id);
	return(0);
}
