/*======================================================================
 * File name    : rzr037.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	運転開始テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr037.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr037.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr037.cv  2.1  93/11/02 19:21:38  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzr037.cv
 * Revision 2.1  93/11/02 19:21:38  ryoji
 * 第５版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr037.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_prod_run						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	運転開始テキストを構造体にセーブする。				*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_prod_run(
	struct fmt_prod_run	*buf
	)
{
	rzr037s.ch_id = ascii_hex(buf->ch_id);
	rzr037s.infeed = ascii_hex(buf->infeed);
	return(0);
}
