/*======================================================================
 * File name    : rzr025a.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	Ver3用プログラム番号要求テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr025a.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr025a.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmd/src/RCS/rzr025a.c 1.1 1995/11/21 09:23:49 hiroe
 *Log: rzr025a.c
 * リビジョン 1.1  1995/11/21  09:23:49  hiroe
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr025a.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_req_prgno_v3						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	Ver3用プログラム番号の要求テキストを構造体にセーブする。	*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_req_prgno_v3(
	struct fmt_req_prgno_v3	*buf
	)
{
	rzr025s.brd_id = ascii_hex(buf->brd_id);
	rzr025s.dev_no = ascii_hex(buf->dev_no);
	rzr025s.node_id = htoc((char *)buf->node_id);
	return(0);
}
