/*======================================================================
 * File name    : rzr038.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	運転開始テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr038.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr038.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr038.cv  2.1  93/11/02 19:23:04  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzr038.cv
 * Revision 2.1  93/11/02 19:23:04  ryoji
 * 第５版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr037.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_prod_run						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	運転開始構造体のデータをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_prod_run)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_prod_run(
	struct fmt_prod_run	*txt,
	struct rzr037t		*pkt
	)
{
	txt->ch_id = hex_ascii(pkt->ch_id);
	txt->infeed = hex_ascii(pkt->infeed);
	return(++txt);
}
