/*======================================================================
 * File name    : rzr027.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	秤データ要求テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr027.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr027.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr027.cv  2.1  93/11/02 19:20:40  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzr027.cv
 * Revision 2.1  93/11/02 19:20:40  ryoji
 * 第５版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<rzcmd\rzr027.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	rz_scan_req_weidat						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	秤データの要求テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
rz_scan_req_weidat(
	struct fmt_req_weidat	*buf
	)
{
	rzr027s.ch_id = ascii_hex(buf->ch_id);
	rzr027s.head_no = htoc((char *)buf->head_no);
	return(0);
}
