/*======================================================================
 * File name    : rzr026a.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	Ver3用プログラム番号要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr026a.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr026a.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/rzcmd/src/RCS/rzr026a.c 1.1 1995/11/21 09:27:32 hiroe
 *Log: rzr026a.c
 * リビジョン 1.1  1995/11/21  09:27:32  hiroe
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr025a.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_req_prgno_v3						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	Ver3用プログラム番号要求の構造体データをテキストに変換する。	*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_req_prgno_v3)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_req_prgno_v3(
	struct fmt_req_prgno_v3	*txt,
	struct rzr025t		*pkt
	)
{
	txt->brd_id = hex_ascii(pkt->brd_id);
	txt->dev_no = hex_ascii(pkt->dev_no);
	ctoh(pkt->node_id, (char *)&txt->node_id);
	return(++txt);
}
