/*======================================================================
 * File name    : rzr026.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	プログラム番号要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/rzcmd/src/RCS/rzr026.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rzr026.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: rzr026.cv  2.1  93/11/02 19:20:56  ryoji
 *Log: p:/lib/rzcmd/src/rcs/rzr026.cv
 * Revision 2.1  93/11/02 19:20:56  ryoji
 * 第５版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<rzcmd\rzcmd.h>			/* Show Current		*/
#include	<rzcmd\rzr025.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	rz_print_req_prgno						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	プログラム番号要求の構造体データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_req_prgno)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
rz_print_req_prgno(
	struct fmt_req_prgno	*txt,
	struct rzr025t		*pkt
	)
{
	txt->dev_id = hex_ascii(pkt->dev_id);
	ctoh(pkt->head_no, (char *)&txt->head_no);
	return(++txt);
}
