/*----------------------------------------------------------------------*
 * File name	: scucls.c	/ scu close									*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/drive/scu/m66230/RCS/scucls.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: scucls.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------*
 *Header: p:/presto/shlib_v7/drive/scush3/RCS/scucls.c 1.1 1970/01/01
 *Log: scucls.c
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 *----------------------------------------------------------------------*/
/*		(c) Copyright 1988, ISHIDA SCALES MFG. CO., LTD.				*/
/*		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN							*/
/*		SHIGA JAPAN														*/
/*		(0775) 53-4141													*/
/*----------------------------------------------------------------------*/
/* 説明                                                  				*/
/*	SCUをクローズする。													*/
/*----------------------------------------------------------------------*/
/* 引き数																*/
/*	channel		: ﾁｬﾈﾙ･ﾅﾝﾊﾞｰ											*/
/*																		*/
/* 戻り値																*/
/*	int		: 0															*/
/*----------------------------------------------------------------------*/

#include	<rom\handle.h>						/* Show xlib			*/
#include	<drive\iofsys.h>					/*	"					*/
#include	"scuctl.h"							/* Show current			*/

int
m66230_close(
	int		channel
	)
{
	channel = channel;
	m66230_mode = -1;
	return(0);
}
