/*======================================================================
 * File name    : nzcmdid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: nzcmdid.c $
 * リビジョン 1.4  1970/01/01  00:00:00  chimura
 * 2003/08/05 compiler ver7 vup
 * 
 * リビジョン 1.3  1970/01/01  00:00:00  kawamura
 * 2003/05/30  15:11
 * 左辺のキャストの方法が間違っていたので修正する。
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  kawamura
 * 2003/05/01  08:36
 * ワーニング対策
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*nzcmdid = "$Header: p:/presto2/shlib_v7/nzcmd/src/RCS/nzcmdid.c 1.4 1970/01/01 00:00:00 chimura Exp $";
