/*======================================================================
 * File name    : nzr026.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	各種データ要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/nzcmd/src/RCS/nzr026.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: nzr026.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/nzcmd/src/rcs/nzr026.c 1.1 1999/05/27 16:52:14 kawamura
 *Log: nzr026.c
 * リビジョン 1.1  1999/05/27  16:52:14  kawamura
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<nzcmd\nzcmd.h>			/* Show Current		*/
#include	<nzcmd\nzr025.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	nz_print_req_info						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	各種データの構造体データをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_req_info)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
nz_print_req_info(
	struct fmt_req_info	*txt,
	struct nzr025t		*pkt
	)
{
	ctoh((unsigned char)pkt->info_no, (char *)&txt->info_no);
	ctoh((unsigned char)pkt->info_desc, (char *)&txt->info_desc);
	return(++txt);
}
