/*======================================================================
 * File name    : nzr020.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	重量波形データパラメータテキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/nzcmd/src/RCS/nzr020.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: nzr020.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/nzcmd/src/rcs/nzr020.c 1.1 1999/05/27 16:51:49 kawamura
 *Log: nzr020.c
 * リビジョン 1.1  1999/05/27  16:51:49  kawamura
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<nzcmd\nzcmd.h>			/* Show Current		*/
#include	<nzcmd\nzr019.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	nz_print_archive_parm						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	重量波形データパラメータの構造体データをテキストに変換する。	*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_archive_parm)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
nz_print_archive_parm(
	struct fmt_archive_parm	*txt,
	struct nzr019t		*pkt
	)
{
	ctoh( (unsigned char)pkt->wh_no, (char *)&txt->wh_no );
	txt->type = hex_ascii( pkt->type );
	return(++txt);
}
