/*======================================================================
 * File name    : nzr018.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ロジック波形データ要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/nzcmd/src/RCS/nzr018.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: nzr018.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/nzcmd/src/rcs/nzr018.c 1.1 1999/05/27 16:51:57 kawamura
 *Log: nzr018.c
 * リビジョン 1.1  1999/05/27  16:51:57  kawamura
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<nzcmd\nzcmd.h>			/* Show Current		*/
#include	<nzcmd\nzr017.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	nz_print_logic_parm						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ロジック波形データの構造体データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)	    		*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ		    			*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_logic_parm)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
nz_print_logic_parm(
	struct fmt_logic_parm	*txt,
	struct nzr017t		*pkt
	)
{
	itoh( (unsigned short)pkt->logic_interval, (char *)&txt->logic_intvl );
	txt->unit_no = hex_ascii( pkt->unit_no );
	return(++txt);
}
