/*======================================================================
 * File name    : nzr025.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	各種データ要求テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/nzcmd/src/RCS/nzr025.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: nzr025.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/nzcmd/src/rcs/nzr025.c 1.1 1999/05/27 16:52:11 kawamura
 *Log: nzr025.c
 * リビジョン 1.1  1999/05/27  16:52:11  kawamura
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<nzcmd\nzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<nzcmd\nzr025.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	nz_scan_req_info						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	各種データ要求テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
nz_scan_req_info(
	struct fmt_req_info	*buf
	)
{
	nzr025s.info_no = htoc((char *)buf->info_no);
	nzr025s.info_desc = htoc((char *)buf->info_desc);
	return(0);
}
