/*======================================================================
 * File name    : nzr017.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ロジック波形データ要求テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/nzcmd/src/RCS/nzr017.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: nzr017.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/nzcmd/src/rcs/nzr017.c 1.1 1999/05/27 16:52:00 kawamura
 *Log: nzr017.c
 * リビジョン 1.1  1999/05/27  16:52:00  kawamura
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<nzcmd\nzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<nzcmd\nzr017.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	nz_scan_logic_parm						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ロジック波形データ要求テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
nz_scan_logic_parm(
	struct fmt_logic_parm	*buf
	)
{
	nzr017s.logic_interval = (unsigned short)htoi((char *)buf->logic_intvl);
	nzr017s.unit_no = ascii_hex(buf->unit_no);
	return(0);
}
