/*======================================================================
 * File name    : nzr019.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	重量波形データパラメータテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/nzcmd/src/RCS/nzr019.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: nzr019.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: p:/lib/nzcmd/src/rcs/nzr019.c 1.1 1999/05/27 16:51:54 kawamura
 *Log: nzr019.c
 * リビジョン 1.1  1999/05/27  16:51:54  kawamura
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<nzcmd\nzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<nzcmd\nzr019.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	nz_scan_archive_parm						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	重量波形データパラメータテキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
nz_scan_archive_parm(
	struct fmt_archive_parm	*buf
	)
{
	nzr019s.wh_no = htoc((char *)buf->wh_no);
	nzr019s.type = ascii_hex(buf->type);
	return(0);
}
