/*======================================================================
 * File name    : intini.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/norti/userlib/dmu/RCS/intini.c 1.3 1970/01/01 00:00:00 sakaguti Exp $
 *$Log: intini.c $
 * リビジョン 1.3  1970/01/01  00:00:00  sakaguti
 * 2003/11/12 compiler ver7 vup
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  sakaguti
 * ﾀｲﾏをcre_isr()関数を用いて生成
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * SH2用NORTiユーザ初期化関数
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */
#include <kernel.h>


ER intini(void)
{
    return E_OK;
}
