/*======================================================================
 * File name    : n4userid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: n4userid.c $
 * リビジョン 1.3  1970/01/01  00:00:00  sakaguti
 * 2003/11/12 compiler ver7 vup
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  sakaguti
 * ﾀｲﾏをcre_isr()関数を用いて生成
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * SH2用NORTiユーザ初期化関数
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*n4userid = "$Header: p:/presto2/shlib_v7/norti/userlib/dmu/RCS/n4userid.c 1.3 1970/01/01 00:00:00 sakaguti Exp $";
