/*======================================================================
 * File name    : dzcmdid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: dzcmdid.c $
 * リビジョン 1.7  1970/01/01  00:00:00  kawamura
 * 2004/10/28  16:53
 * エアー駆動時、キャストミスでホッパが開かない不具合を修正。
 * 
 * リビジョン 1.6  1970/01/01  00:00:00  kawamura
 * 2003/09/25  14:41
 * 正しく符号拡張が行われない不具合を修正
 * 
 * リビジョン 1.5  1970/01/01  00:00:00  chimura
 * 2003/08/05 compiler ver7 vup
 * 
 * リビジョン 1.4  1970/01/01  00:00:00  kawamura
 * 2003/05/30  14:03
 * 左辺キャストの方法が間違っていたので修正する。
 * 
 * リビジョン 1.3  1970/01/01  00:00:00  kawamura
 * 2003/05/02  08:42
 * ワーニング対策
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/03/19 14:30
 * dzr211sの二重定義を回避する。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*dzcmdid = "$Header: p:/presto2/shlib_v7/dzcmd/src/RCS/dzcmdid.c 1.7 1970/01/01 00:00:00 kawamura Exp $";
