/*======================================================================
 * File name    : dzi203.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＡＦＶ係数テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/dzcmd/src/RCS/dzi203.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: dzi203.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: DZI203.Cv  1.2  94/02/18 16:43:44  ryoji
 *Log: P:/LIB/DZCMD/SRC/RCS/DZI203.Cv
 * Revision 1.2  94/02/18 16:43:44  ryoji
 * 第１版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<dzcmd\dzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<dzcmd\dzi203.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	dz_scan_afv_coeffi						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	ＡＦＶ係数テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
dz_scan_afv_coeffi(
	struct fmt_afv_coeffi	*buf
	)
{
	dzi203s.wh_no   = htoc( (char *)buf->wh_no );
	dzi203s.new_coeffi = htol((char *)buf->new_coeffi);
	dzi203s.old_coeffi = htol((char *)buf->old_coeffi);
	return(0);
}
