/*======================================================================
 * File name    : dzr203.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＡＦＶ調整テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/dzcmd/src/RCS/dzr203.c 1.2 1970/01/01 00:00:00 kawamura Exp $
 *$Log: dzr203.c $
 * リビジョン 1.2  1970/01/01  00:00:00  kawamura
 * 2003/09/25  14:40
 * 符号拡張時、正しく符号拡張が行われるようにする。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: dzr203.cv  1.1  94/05/19 09:47:44  sato
 *Log: p:/lib/dzcmd/src/rcs/dzr203.cv
 * Revision 1.1  94/05/19 09:47:44  sato
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<dzcmd\dzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<dzcmd\dzr203.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	dz_scan_afv_adj							*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	秤診断データ要求テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
dz_scan_afv_adj(
	struct fmt_afv_adj	*buf
	)
{
	dzr203s.ch_id = ascii_hex(buf->ch_id);
	dzr203s.adj_mode = (short)htoi((char *)&buf->adj_mode);
	return(0);
}
