/*======================================================================
 * File name    : dzr205.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	秤診断データ要求テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/dzcmd/src/RCS/dzr205.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: dzr205.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *Header: DZR205.Cv  1.2  94/02/18 17:16:32  ryoji
 *Log: P:/LIB/DZCMD/SRC/RCS/DZR205.Cv
 * Revision 1.2  94/02/18 17:16:32  ryoji
 * 第１版対応
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<dzcmd\dzcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<dzcmd\dzr205.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	dz_scan_diag_req						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	秤診断データ要求テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数	      							*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ		    		*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
dz_scan_diag_req(
	struct fmt_diag_req	*buf
	)
{
	dzr205s.ch_id = ascii_hex(buf->ch_id);
	dzr205s.head_no = htoc((char *)buf->head_no);
	return(0);
}
