/*======================================================================
 * File name    : mfsid.c
 * Original	: p:/presto/shlib/misc/fs/RCS/mfsid.c 1.5
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: mfsid.c $
 * リビジョン 1.2  1970/01/01  00:00:00  sakaguti
 * 2003/11/11 compiler ver7 vup
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * ファイル・システムとFLASH書込み
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*mfsid = "$Header: p:/presto2/shlib_v7/misc/fs/RCS/mfsid.c 1.2 1970/01/01 00:00:00 sakaguti Exp $";
