/*======================================================================
 * File name	: de2srid.c
 * Original	: p:/dacs_i/shdsplib/drive/e2srom/rcs/de2srid.c 1.1
 *----------------------------------------------------------------------
 * Function		: ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: de2srid.c $
 * リビジョン 1.3  1970/01/01  00:00:00  chimura
 * 2005/01/12 I/O操作関数の定義方法を変更
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/11/12 compiler ver7 vup
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * LOG MESSAGE
 * 
 *----------------------------------------------------------------------
 *				(c) Copyright 2002, ISHIDA CO., LTD.
 *				959-1 SHIMOMAGARI RITTO-CITY
 *				SHIGA JAPAN
 *				(077) 553-4141
 *======================================================================
 */

const char * const de2srid = "$Header: p:/presto2/shlib_v7/drive/e2srom/RCS/de2srid.c 1.3 1970/01/01 00:00:00 chimura Exp $";
