/*======================================================================
 * File name    : be2srid.c
 * Original	: p:/lib/biosif/e2srom/RCS/be2srid.c 1.1
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: be2srid.c $
 * リビジョン 1.3  1970/01/01  00:00:00  chimura
 * 2005/01/12 ベクター番号をPIOからE2SROMに変更する。
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/11/13 compiler ver7 vup
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * シリアルＲＯＭＩ／Ｆ
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*be2rid = "$Header: p:/presto2/shlib_v7/biosif/e2srom/RCS/be2srid.c 1.3 1970/01/01 00:00:00 chimura Exp $";
