/*======================================================================
 * File name	: prcmdid.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: prcmdid.c $
 * リビジョン 1.4  1970/01/01  00:00:00  kawamura
 * 2004/09/29  10:46
 * prr0022.cでループする変数を間違えていたので修正する。
 * 
 * リビジョン 1.3  1970/01/01  00:00:00  kawamura
 * prr0133.cで正しくデータが取得できない不具合を修正する。
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  kawamura
 * 2004/05/08  15:26
 * 新ＡＦＤに関するコマンドを追加する。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*prcmdid = "$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prcmdid.c 1.4 1970/01/01 00:00:00 kawamura Exp $";
