/*======================================================================
 * File name	: pri0023.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	システム異常発生テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/pri0023.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: pri0023.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmd/src/RCS/rzi023.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzi023.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<string.h>			/* ANSI std		*/
#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\pri0023.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_sys_fault						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	システムエラーテキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_sys_fault(
	struct fmt_sys_fault	*buf
	)
{
	pri0023s.len = htoc((char *)buf->len);
	strncpy((char *)&pri0023s.mes_str, (char *)buf->mes_str, (size_t)pri0023s.len);
	return(0);
}
