/*======================================================================
 * File name	: pri0033.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	金属検出機テスト結果テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/pri0033.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: pri0033.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmdx/src/RCS/rzi033.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzi033.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\pri0033.h>		/* Show Current		*/
#undef		STORAGE

/*----------------------------------------------------------------------*/
/*	pr_scan_metal_answer						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	金属検出機テスト結果テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_metal_answer(
	struct fmt_metal_answer	*buf
	)
{
	pri0033s.ch_id = ascii_hex(buf->ch_id);
	pri0033s.answer = ascii_hex(buf->answer);
	return(0);
}
