/*======================================================================
 * File name	: pri0027.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	周辺異常発生テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/pri0027.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: pri0027.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmd/src/RCS/rzi027.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzi027.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\pri0027.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_pcuerr							*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	エラーテキストを構造体にセーブする。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_pcuerr(
	struct fmt_pcuerr	*buf
	)
{
	pri0027s.error = ascii_hex(buf->error);
	pri0027s.ptn = htol((char *)buf->ptn);
	return(0);
}
