/*======================================================================
 * File name	: pri0022.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	動作完了テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/pri0022.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: pri0022.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmd/src/RCS/rzi022.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzi022.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\pri0021.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_complete						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	動作完了構造体のデータをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_complete)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_complete(
	struct fmt_complete	*txt,
	struct pri0021t		*pkt
	)
{
	txt->command = pkt->command;
	txt->ch_id = hex_ascii(pkt->ch_id);
	return(++txt);
}
