/*======================================================================
 * File name	: pri0034.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	金属検出機テスト結果テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/pri0034.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: pri0034.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmdx/src/RCS/rzi034.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzi034.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\pri0033.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_metal_answer						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	金属検出機テスト結果をテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_metal_answer)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_metal_answer(
	struct fmt_metal_answer	*txt,
	struct pri0033t		*pkt
	)
{

	txt->ch_id = hex_ascii(pkt->ch_id);
	txt->answer = hex_ascii(pkt->answer);
	return(++txt);
}
