/*======================================================================
 * File name	: pri0028.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	周辺異常発生テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/pri0028.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: pri0028.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmd/src/RCS/rzi028.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzi028.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\pri0027.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_pcuerr							*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	エラー構造体のデータをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_error)	･･･ 正常終了			*/
/*		  NULL			･･･ エラー			*/
/*----------------------------------------------------------------------*/

void *
pr_print_pcuerr(
	struct fmt_pcuerr	*txt,
	struct pri0027t		*pkt
	)
{
	txt->error = hex_ascii(pkt->error);
	ltoh((unsigned long)pkt->ptn, (char *)txt->ptn);
	return(++txt);
}
