/*======================================================================
 * File name	: pri0008.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	補正値テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/pri0008.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: pri0008.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmd/src/RCS/rzi008.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzi008.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\pri0007.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_cmpn_value						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	補正値自動更新結果の構造体データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_cmpn_val)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_cmpn_value(
	struct fmt_cmpn_value	*txt,
	struct pri0007t		*pkt
	)
{
	ctoh(pkt->cmpn_val, (char *)&txt->cmpn_val);
	return(++txt);
}
