/*======================================================================
 * File name	: prr0115.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	全排出時の自動零点制御データテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0115.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0115.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0115.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_drain_zero						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	全排出時の自動零点制御データテキストを構造体にセーブする。	*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_drain_zero(
	struct fmt_drain_zero	*buf
	)
{
	prr0115s.ch_id = ascii_hex(buf->ch_id);
	prr0115s.drain_zero = ascii_hex(buf->drain_zero);
	return(0);
}
