/*======================================================================
 * File name	: prr0116.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	全排出時の自動零点制御データテキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0116.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0116.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0115.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_drain_zero						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	全排出時の自動零点制御データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_drain_zero)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_drain_zero(
	struct fmt_drain_zero	*txt,
	struct prr0115t		*pkt
	)
{
	txt->ch_id = hex_ascii( pkt->ch_id );
	txt->drain_zero = hex_ascii( pkt->drain_zero );
	return(++txt);
}
