/*======================================================================
 * File name	: prr0113.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	供給機制御信号ＯＮ／ＯＦＦデータテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0113.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0113.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0113.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_infonoff						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	供給機制御信号ＯＮ／ＯＦＦデータテキストを構造体にセーブする。	*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_infonoff(
	struct fmt_infonoff	*buf
	)
{
	prr0113s.ch_id = ascii_hex(buf->ch_id);
	prr0113s.onoff_key = ascii_hex(buf->onoff_key);
	return(0);
}
