/*======================================================================
 * File name	: prr0047.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	手動計算排出テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0047.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0047.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmd/src/RCS/rzr047.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr047.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0047.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_test_caldmp						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	テスト組み合わせ計算&排出テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_test_caldmp(
	struct fmt_test_caldmp	*buf
	)
{
	prr0047s.ch_id = ascii_hex(buf->ch_id);
	return(0);
}
