/*======================================================================
 * File name	: prr0067.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	金属検出機テストのテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0067.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: prr0067.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmdx/src/RCS/rzr067.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr067.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0067.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_metal_text						*/
/*----------------------------------------------------------------------*/
/* 説明					  				*/
/*	金属検出機テストのテキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_metal_text(
	struct fmt_metal_text	*buf
	)
{
	prr0067s.ch_id = ascii_hex(buf->ch_id);
	prr0067s.nof_head = htoc((char *)&buf->nof_head);
	prr0067s.function = ascii_hex(buf->function);
	return(0);
}
