/*======================================================================
 * File name	: prr0072.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	ネットワーク参加状態要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0072.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0072.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmd/src/RCS/rzr072.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr072.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show prcmd		*/
#include	<prcmd\prr0071.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_req_netmap						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	ネットワーク参加状態要求の構造体データをテキストに変換する。	*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_req_netmap)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_req_netmap(
	struct fmt_req_netmap	*txt,
	struct prr0071t		*pkt
	)
{
	txt->brd_id = hex_ascii(pkt->brd_id);
	ctoh(pkt->dev_no, (char *)&txt->dev_no);
	return(++txt);
}
