/*======================================================================
 * File name	: prr0102.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	各種データ要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0102.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0102.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/nzcmd/src/rcs/nzr026.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: nzr026.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0101.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_req_info						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	各種データの構造体データをテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_req_info)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_req_info(
	struct fmt_req_info	*txt,
	struct prr0101t		*pkt
	)
{
	ctoh((unsigned char)pkt->info_no, (char *)txt->info_no);
	ctoh(pkt->info_desc, (char *)txt->info_desc);
	return(++txt);
}
