/*======================================================================
 * File name	: prr0103.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	ロジック波形データ要求テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0103.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0103.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/nzcmd/src/rcs/nzr017.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: nzr017.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0103.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_logic_parm						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	ロジック波形データ要求テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_logic_parm(
	struct fmt_logic_parm	*buf
	)
{
	prr0103s.logic_interval = htoi((char *)buf->logic_intvl);
	prr0103s.unit_no = ascii_hex(buf->unit_no);
	return(0);
}
