/*======================================================================
 * File name	: prr0070.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	サンプル排出仕様テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0070.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: prr0070.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmdx/src/RCS/rzr070.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr070.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0069.h>		/* Show Current		*/

/*----------------------------------------------------------------------*/
/*	pr_print_sample_dump						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	サンプル排出の構成仕様データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信テキスト・バッファへのポインタ			*/
/*	*pkt	: パラメータ・パケットへのポインタ			*/
/*									*/
/* 戻り値								*/
/*	int	: buf+sizeof(fmt_mch_construct)	･･･ 正常終了		*/
/*----------------------------------------------------------------------*/

void *
pr_print_sample_dump(
	struct fmt_sample_dump	*txt,
	struct prr0069t		*pkt
	)
{
	txt->ch_id = hex_ascii( pkt->ch_id );
	ctoh( pkt->sect_assign_ptn, (char *)txt->sect_assign_ptn );
	return(++txt);
}
