/*======================================================================
 * File name	: prr0071.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	ネットワーク参加状態要求テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0071.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0071.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmd/src/RCS/rzr071.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr071.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show prcmd		*/
#define		STORAGE
#include	<prcmd\prr0071.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_req_netmap						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	ネットワーク参加状態の要求テキストを構造体にセーブする。	*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_req_netmap(
	struct fmt_req_netmap	*buf
	)
{
	prr0071s.brd_id = ascii_hex(buf->brd_id);
	prr0071s.dev_no = htoc((char *)buf->dev_no);
	return(0);
}
