/*======================================================================
 * File name	: prr0104.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	ロジック波形データ要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0104.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0104.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/nzcmd/src/rcs/nzr018.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: nzr018.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0103.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_logic_parm						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	ロジック波形データの構造体データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_logic_parm)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_logic_parm(
	struct fmt_logic_parm	*txt,
	struct prr0103t		*pkt
	)
{
	itoh( pkt->logic_interval, (char *)txt->logic_intvl );
	txt->unit_no = hex_ascii( pkt->unit_no );
	return(++txt);
}
