/*======================================================================
 * File name	: prr0069.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	サンプル排出仕様テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0069.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: prr0069.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmdx/src/RCS/rzr069.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr069.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0069.h>		/* Show Current		*/
#undef		STORAGE

/*----------------------------------------------------------------------*/
/*	pr_scan_sample_dump						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	サンプル排出仕様を構造体にセーブする。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*----------------------------------------------------------------------*/

int
pr_scan_sample_dump(
	struct fmt_sample_dump	*buf
	)
{
	prr0069s.ch_id = ascii_hex( buf->ch_id );
	prr0069s.sect_assign_ptn = htoc( (char *)buf->sect_assign_ptn );
	return( 0 );
}
