/*======================================================================
 * File name	: prr0101.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	各種データ要求テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0101.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0101.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/nzcmd/src/rcs/nzr025.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: nzr025.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0101.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_req_info						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	各種データ要求テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_req_info(
	struct fmt_req_info	*buf
	)
{
	prr0101s.info_no = htoc((char *)buf->info_no);
	prr0101s.info_desc = htoc((char *)buf->info_desc);
	return(0);
}
