/*======================================================================
 * File name	: prr0129.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	運転中にホッパを取り外しての零点データテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0129.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0129.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<string.h>			/* ANSI std		*/
#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0129.h>		/* Show Current		*/
#undef		STORAGE


/*------------------------------------------------------------------------------*/
/*	pr_scan_fzero								*/
/*------------------------------------------------------------------------------*/
/* 説明										*/
/*	運転中にホッパを取り外しての零点データテキストを構造体にセーブする。	*/
/*------------------------------------------------------------------------------*/
/* 引き数									*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ					*/
/*										*/
/* 戻り値									*/
/*	int	: 0	･･･ 正常終了						*/
/*		  -1	･･･ エラー						*/
/*------------------------------------------------------------------------------*/

int
pr_scan_fzero(
	struct fmt_fzero	*buf
	)
{
	prr0129s.wh_nonactive = htol((char *)buf->wh_nonactive );
	prr0129s.ph_nonactive = htol((char *)buf->ph_nonactive );
	return 0;
}
