/*======================================================================
 * File name	: prr0132.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	予約番号データテキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0132.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0132.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<string.h>			/* ANSI std		*/
#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0131.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_preset_no						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	予約番号データの構造体をテキストに変換する。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_preset_no)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_preset_no(
	struct fmt_preset_no	*txt,
	struct prr0131t		*pkt
	)
{
	txt->ch_id = hex_ascii( pkt->ch_id );
	itoh(pkt->preset_no, (char *)txt->preset_no);
	return(++txt);
}
