/*======================================================================
 * File name	: prr0105.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	重量波形データパラメータテキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0105.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0105.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0105.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0105.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0105.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_archive_parm						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	重量波形データパラメータテキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_archive_parm(
	struct fmt_archive_parm	*buf
	)
{
	prr0105s.wh_no = htoc((char *)buf->wh_no);
	prr0105s.type = ascii_hex(buf->type);
	prr0105s.hopper_id = ascii_hex(buf->hopper_id);
	return(0);
}
