/*======================================================================
 * File name	: prr0114.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	スパン係数要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0114.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0114.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0113.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_infonoff						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	供給機制御信号ＯＮ／ＯＦＦデータをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_infonoff)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_infonoff(
	struct fmt_infonoff	*txt,
	struct prr0113t		*pkt
	)
{
	txt->ch_id = hex_ascii( pkt->ch_id );
	txt->onoff_key = hex_ascii( pkt->onoff_key );
	return(++txt);
}
