/*======================================================================
 * File name	: prr0124.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	リレー基板信号入力状態要求データテキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0124.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0124.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0123.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_ryin_check						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	リレー基板信号入力状態要求データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_ryin_check)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_ryin_check(
	struct fmt_ryin_check	*txt,
	struct prr0123t		*pkt
	)
{
	txt->brd_no = hex_ascii( pkt->brd_no );
	return(++txt);
}
