/*======================================================================
 * File name	: prr0130.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	運転中にホッパを取り外しての零点データテキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0130.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0130.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<string.h>			/* ANSI std		*/
#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0129.h>		/* Show Current		*/


/*------------------------------------------------------------------------------*/
/*	pr_print_fzero								*/
/*------------------------------------------------------------------------------*/
/* 説明										*/
/*	運転中にホッパを取り外しての零点データの構造体をテキストに変換する。	*/
/*------------------------------------------------------------------------------*/
/* 引き数									*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)				*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ						*/
/*										*/
/* 戻り値									*/
/*	int	: txt+sizeof(fmt_fzero)		･･･ 正常終了			*/
/*		  NULL				･･･ エラー			*/
/*------------------------------------------------------------------------------*/

void *
pr_print_fzero(
	struct fmt_fzero	*txt,
	struct prr0129t		*pkt
	)
{
	ltoh(pkt->wh_nonactive, (char *)txt->wh_nonactive);
	ltoh(pkt->ph_nonactive, (char *)txt->ph_nonactive);
	return(++txt);
}
