/*======================================================================
 * File name	: prr0106.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	重量波形データパラメータテキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0106.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0106.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/nzcmd/src/rcs/nzr020.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: nzr020.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0105.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_archive_parm						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	重量波形データパラメータの構造体データをテキストに変換する。	*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_archive_parm)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_archive_parm(
	struct fmt_archive_parm	*txt,
	struct prr0105t		*pkt
	)
{
	ctoh( pkt->wh_no, (char *)txt->wh_no );
	txt->type = hex_ascii( pkt->type );
	txt->hopper_id = hex_ascii( pkt->hopper_id );
	return(++txt);
}
