/*======================================================================
 * File name	: prr0085.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	スパン係数要求テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0085.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0085.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmdx/src/RCS/rzr085.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr085.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0085.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_span_call						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	スパン係数要求テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_span_call(
	struct fmt_span_call	*buf
	)
{
	prr0085s.pwb_no = ascii_hex(buf->pwb_no);
	prr0085s.range = ascii_hex(buf->range);
	return(0);
}
