/*======================================================================
 * File name	: prr0026.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	プログラム番号要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0026.c 1.1 1970/01/01 00:00:00 kawamura Exp $
 *$Log: prr0026.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kawamura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmd/src/RCS/rzr026a.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr026a.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0025.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_req_prgno						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	プログラム番号要求の構造体データをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_req_prgno)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_req_prgno(
	struct fmt_req_prgno	*txt,
	struct prr0025t	*pkt
	)
{
	txt->brd_id = hex_ascii(pkt->brd_id);
	txt->dev_no = hex_ascii(pkt->dev_no);
	ctoh(pkt->node_id, (char *)txt->node_id);
	return(++txt);
}
