/*======================================================================
 * File name	: prr0086.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	スパン係数要求テキスト作成
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0086.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0086.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmdx/src/RCS/rzr086.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr086.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#include	<prcmd\prr0085.h>		/* Show Current		*/


/*----------------------------------------------------------------------*/
/*	pr_print_span_call						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	スパン係数要求構造体のデータをテキストに変換する。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*txt	: 送信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ(char *)			*/
/*	*pkt	: ﾊﾟﾗﾒｰﾀ･ﾊﾟｹｯﾄへのﾎﾟｲﾝﾀ					*/
/*									*/
/* 戻り値								*/
/*	int	: txt+sizeof(fmt_span_adj)	･･･ 正常終了		*/
/*		  NULL				･･･ エラー		*/
/*----------------------------------------------------------------------*/

void *
pr_print_span_call(
	struct fmt_span_call	*txt,
	struct prr0085t		*pkt
	)
{
	txt->pwb_no = hex_ascii( pkt->pwb_no );
	txt->range = hex_ascii( pkt->range );
	return(++txt);
}
