/*======================================================================
 * File name	: prr0025.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	プログラム番号要求テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0025.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0025.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/rzcmd/src/RCS/rzr059.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: rzr059.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0025.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_req_prgno						*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	プログラム番号の要求テキストを構造体にセーブする。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_req_prgno(
	struct fmt_req_prgno	*buf
	)
{
	prr0025s.brd_id = ascii_hex(buf->brd_id);
	prr0025s.dev_no = ascii_hex(buf->dev_no);
	prr0025s.node_id = htoc((char *)buf->node_id);
	return(0);
}
