/*======================================================================
 * File name	: prr0055.c
 * Original	:
 *----------------------------------------------------------------------
 * Function	:
 *	ＡＦＶ調整テキスト解読
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/prcmd/src/RCS/prr0055.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: prr0055.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *header: p:/presto/shlib/dzcmd/src/RCS/dzr203.c 1.1 1970/01/01 00:00:00 chimura Exp
 *log: dzr203.c
 *----------------------------------------------------------------------
 *		(c) Copyright 2003, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

#include	<custom\typedefs.h>		/* Show xlib		*/
#include	<custom\custom.h>		/*	"		*/
#include	<prcmd\prcmd.h>			/* Show Current		*/
#define		STORAGE
#include	<prcmd\prr0055.h>		/* Show Current		*/
#undef		STORAGE


/*----------------------------------------------------------------------*/
/*	pr_scan_afv_adj							*/
/*----------------------------------------------------------------------*/
/* 説明									*/
/*	秤診断データ要求テキストを構造体にセーブする。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*buf	: 受信ﾃｷｽﾄ･ﾊﾞｯﾌｧへのﾎﾟｲﾝﾀ				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -1	･･･ エラー					*/
/*----------------------------------------------------------------------*/

int
pr_scan_afv_adj(
	struct fmt_afv_adj	*buf
	)
{
	prr0055s.ch_id = ascii_hex(buf->ch_id);
	prr0055s.adj_mode = (short)htoi((char *)buf->adj_mode);
	return(0);
}
