/*======================================================================
 * File name    : dethid.c
 * Original	: p:/dacs_i/shdsplib/drive/sh7615/sci/rcs/dethid.c 1.1
 *----------------------------------------------------------------------
 * Function		: ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: dethid.c $
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * dethid.c追加
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * dethid.c追加
 * 
 *----------------------------------------------------------------------
 *				(c) Copyright 2002, ISHIDA CO., LTD.
 *				959-1 SHIMOMAGARI RITTO-CITY
 *				SHIGA JAPAN
 *				(077) 553-4141
 *======================================================================
 */

const char * const dethid = "$Header: p:/presto2/shlib_v7/drive/sh7615/ether/rcs/dethid.c 1.1 1970/01/01 00:00:00 sakaguti Exp $";
