/*----------------------------------------------------------------------*
 * File name	: iniwdt.c	/ initialize register			*
 *----------------------------------------------------------------------*
 *$Header: p:/presto2/shlib_v7/biosif/init/RCS/iniwdt.c 1.1 1970/01/01 00:00:00 sakaguti Exp $
 *$Log: iniwdt.c $
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * _init_jump_to_reset新規追加
 * 
 *----------------------------------------------------------------------*/
/*		(c) Copyright 2002, ISHIDA CO., LTD.			*/
/*		959-1 SHIMOMAGARI RITTO-CITY				*/
/*		SHIGA JAPAN						*/
/*		(077) 553-4141						*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	ＷＤＴをカウントアップさせてリセットをかける。				*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	void					*/
/*									*/
/* 戻り値								*/
/*	なし							*/
/*----------------------------------------------------------------------*/

#include	<biosif\iosvc.h>		/* Show biosif		*/
#include	<umachine.h>			/* C:\usr\local\SH\5_1_0\INCLUDE */
#include	<dos.h>

void
_init_jump_to_reset(void)
{
	trapa_svc(VECTOR_INIT, 0x3);
}
