/*======================================================================
 * File name    : chgpri.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/chgpri.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: chgpri.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	CHG_PRI								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	タスク優先度の変更。システムコールの戻り値（エラーコード）をコ	*/
/*	ンバートして返す。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	tskaa	: タスクのアクセスアドレス				*/
/*	tskpri	: タスクの変更後の優先度				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -n	･･･ error code					*/
/*----------------------------------------------------------------------*/
int
CHG_PRI(
	unsigned int	tskaa,
	unsigned int 	tskpri
	)
{
	return( err_code( chg_pri( (ID)tskaa, (PRI)tskpri)));
}
