/*======================================================================
 * File name    : creflg.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/creflg.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: creflg.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	CRE_FLG								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	イベントフラグの生成。イベントフラグ生成情報のパケットにイベン	*/
/*	トフラグの属性、イベントフラグのビットパターンの初期値をセット	*/
/*	する。また、イベントフラグのアセスアドレスをイベントフラグＩＤ	*/
/*	とする。システムコールの戻り値（エラーコード）をコンバートして	*/
/*	返す。								*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*flgaa	: イベントフラグのアクセスアドレスを示すポインタ	*/
/*	flg_id	: イベントフラグＩＤ					*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -n	･･･ error code					*/
/*----------------------------------------------------------------------*/
int
CRE_FLG(
	unsigned int	*flgaa, 
	unsigned int	flg_id
	)
{
	T_CFLG		pk_cflg = { TA_WSGL, 0, ""};
	*flgaa = flg_id;
	return( err_code( cre_flg( (ID)flg_id, &pk_cflg)));
}
