/*======================================================================
 * File name    : crembx.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/crembx.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: crembx.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	CRE_MBX								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	メイルボックスの生成。メイルボックス生成情報のパケットにメイル	*/
/*	ボックスの属性、送信されるメッセージの優先度の最大値、優先度別	*/
/*	のメッセージキューヘッダ領域の先頭番地をセットする。また、メイ	*/
/*	ルボックスのアセスアドレスをメイルボックスＩＤとする。システム	*/
/*	コールの戻り値（エラーコード）をコンバートして返す。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	opt	: メイルボックスの待ち方を指定				*/
/*	*mbxaa	: メイルボックスのアクセスアドレスを示すポインタ	*/
/*	mbx_id	: メイルボックスＩＤ					*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -n	･･･ error code					*/
/*----------------------------------------------------------------------*/
int
CRE_MBX(
	unsigned int	opt, 
	unsigned int 	*mbxaa,
	unsigned int	mbx_id
	)
{
	T_CMBX		pk_cmbx = { TA_TFIFO, 1, NULL, ""};
	pk_cmbx.mbxatr = (ATR)((~opt) & (TA_TPRI|TA_MPRI));
	*mbxaa = mbx_id;
	return( err_code( cre_mbx( (ID)mbx_id, &pk_cmbx)));
}
