/*======================================================================
 * File name    : cresem.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/cresem.c 1.2 1970/01/01 00:00:00 chimura Exp $
 *$Log: cresem.c $
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/02/05 20:10
 * セマフォの資源数が設定されない不具合修正
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	CRE_SEM								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	セマフォの生成。セマフォ生成情報のパケットにセマフォの属性、セ	*/
/*	マフォの資源数の初期値、セマフォの最大資源数をセットする。また、*/
/*	セマフォのアセスアドレスをセマフォＩＤとする。システムコールの	*/
/*	戻り値（エラーコード）をコンバートして返す。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	opt	: セマフォの待ち方を指定				*/
/*	*semaa	: セマフォのアクセスアドレスを示すポインタ		*/
/*	sem_id	: セマフォＩＤ						*/
/*	cnt	: セマフォの最大資源数					*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -n	･･･ error code					*/
/*----------------------------------------------------------------------*/
int
CRE_SEM(
	unsigned int	opt,
	unsigned int 	*semaa,
	unsigned int	sem_id,
	unsigned int	cnt
	)
{
	T_CSEM		pk_csem = { TA_TFIFO, 0, 1, ""};
	pk_csem.sematr = (ATR)((~opt) & TA_TPRI);
	pk_csem.isemcnt = cnt;
	pk_csem.maxsem = cnt;
	*semaa = sem_id;
	return( err_code( cre_sem( (ID)sem_id, &pk_csem)));
}
