/*======================================================================
 * File name    : flgadr.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/flgadr.c 1.2 1970/01/01 00:00:00 chimura Exp $
 *$Log: flgadr.c $
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/04/10 15:00
 * フラグの存在に関係無く、正常終了としていたため、アプリケーション側でフラ
 * グの存在を確認し、存在すればフラグをセットする処理（自走タイマーの終了処
 * 理）でフラグが存在しないのにフラグをセットしエラーとなる不具合が見つかっ
 * た。
 * そこで、サービスコールref_flgを使用してフラグの存在を確認するように変更し
 * た。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	FLG_ADR								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	イベントフラグのアセスアドレスをイベントフラグＩＤとする。	*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*flgaa	: イベントフラグのアクセスアドレスを示すポインタ	*/
/*	flg_id	: イベントフラグＩＤ					*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*----------------------------------------------------------------------*/
int
FLG_ADR(
	unsigned int	*flgaa,
	unsigned int	flg_id
	)
{
	T_RFLG	trflg;
	*flgaa = flg_id;
	return( err_code( ref_flg((ID)flg_id, &trflg)));
}
