/*======================================================================
 * File name    : mbxadr.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/mbxadr.c 1.2 1970/01/01 00:00:00 chimura Exp $
 *$Log: mbxadr.c $
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/04/10 15:00
 * フラグのような問題は発生しなかったが、フラグと同じようにサービスコールで
 * 存在を確認するように変更した。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	MBX_ADR								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	メイルボックスのアセスアドレスをメイルボックスＩＤとする。	*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*mbxaa	: メイルボックスのアクセスアドレスを示すポインタ	*/
/*	mbx_id	: メイルボックスＩＤ					*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*----------------------------------------------------------------------*/
int
MBX_ADR(
	unsigned int	*mbxaa,
	unsigned int	mbx_id
	)
{
	T_RMBX	trmbx;
	*mbxaa = mbx_id;
	return( err_code( ref_mbx((ID)mbx_id, &trmbx)));
}
