/*======================================================================
 * File name    : mpladr.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/mpladr.c 1.2 1970/01/01 00:00:00 chimura Exp $
 *$Log: mpladr.c $
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/04/10 15:00
 * フラグのような問題は発生しなかったが、フラグと同じようにサービスコールで
 * 存在を確認するように変更した。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	MPL_ADR								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	メモリプールのアセスアドレスをメモリプールＩＤとする。		*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*mplaa	: メモリプールのアクセスアドレスを示すポインタ		*/
/*	mpl_id	: メモリプールＩＤ					*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*----------------------------------------------------------------------*/
int
MPL_ADR(
	unsigned int	*mplaa,
	unsigned int	mpl_id
	)
{
	T_RMPL	trmpl;
	*mplaa = mpl_id;
	return( err_code( ref_mpl((ID)mpl_id, &trmpl)));
}
