/*======================================================================
 * File name    : rsmtsk.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/rsmtsk.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: rsmtsk.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	RSM_TSK								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	強制待ち状態からの再開。サスペンド要求の解除回数の指定により、	*/
/*	システムコールを行う。システムコールの戻り値（エラーコード）を	*/
/*	コンバートして返す。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	opt	: サスペンド要求の解除回数の指定			*/
/*	tskaa	: タスクのアクセスアドレス				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -n	･･･ error code					*/
/*----------------------------------------------------------------------*/
int
RSM_TSK(
	unsigned int	opt,
	unsigned int	tskaa
	)
{
	if(opt)	return( err_code( frsm_tsk( (ID)tskaa)));
	return( err_code( rsm_tsk( (ID)tskaa)));
}
