/*======================================================================
 * File name    : semadr.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/semadr.c 1.2 1970/01/01 00:00:00 chimura Exp $
 *$Log: semadr.c $
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2003/04/10 15:00
 * フラグのような問題は発生しなかったが、フラグと同じようにサービスコールで
 * 存在を確認するように変更した。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	SEM_ADR								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	セマフォのアセスアドレスをセマフォＩＤとする。			*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	*semaa	: セマフォのアクセスアドレスを示すポインタ		*/
/*	sem_id	: セマフォＩＤ						*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*----------------------------------------------------------------------*/
int
SEM_ADR(
	unsigned int	*semaa,
	unsigned int	sem_id
	)
{
	T_RSEM	trsem;
	*semaa = sem_id;
	return( err_code( ref_sem((ID)sem_id, &trsem)));
}
