/*======================================================================
 * File name    : sndmsg.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/sndmsg.c 1.2 1970/01/01 00:00:00 chimura Exp $
 *$Log: sndmsg.c $
 * リビジョン 1.2  1970/01/01  00:00:00  chimura
 * 2004/05/31 11:45
 * メールボックス用に確保したポインタの先頭にはOS管理エリアが存在するため
 * OS管理エリアをマイナスしたポインタを送信するように変更する。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	SND_MSG								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	メイルボックスへの送信。システムコールの戻り値（エラーコード）	*/
/*	をコンバートして返す。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	mbxaa	: メイルボックスのアクセスアドレス			*/
/*	msg	: メイルボックスへの送信メッセージパケットへのポインタ	*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -n	･･･ error code					*/
/*----------------------------------------------------------------------*/
int
SND_MSG(
	unsigned int 	mbxaa,
	unsigned int	msg
	)
{
	return( err_code( snd_mbx( (ID)mbxaa, (T_MSG *)(msg-sizeof(T_MSG *)))));
	/* (snd_mbx -> v4_snd_mbx [KERNEL.H] : ER v4_snd_mbx(ID, VP) [NOKNL4.C]) */
}
