/*======================================================================
 * File name    : statsk.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/statsk.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: statsk.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	STA_TSK								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	タスクの起動。システムコールの戻り値（エラーコード）をコンバー	*/
/*	トして返す。							*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	tskaa	: タスクのアクセスアドレス				*/
/*	code	: タスクの起動コード					*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -n	･･･ error code					*/
/*----------------------------------------------------------------------*/
int
STA_TSK(
	unsigned int	tskaa,
	unsigned int	code
	)
{
	return( err_code( sta_tsk( (ID)tskaa, (VP_INT)code)));
}
