/*======================================================================
 * File name    : sustsk.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function 	:
 *	システムコールコンバート（ＩＴＲＯＮ１→μＩＴＲＯＮ４）
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/cnv/src/RCS/sustsk.c 1.1 1970/01/01 00:00:00 chimura Exp $
 *$Log: sustsk.c $
 * リビジョン 1.1  1970/01/01  00:00:00  chimura
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2001, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CHO KURITA-GUN
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
*/
#include	<rxif\rx116.h>			/* Show include		*/
#include	<kernel.h>
#include	"errcode.h"


/*----------------------------------------------------------------------*/
/*	SUS_TSK								*/
/*----------------------------------------------------------------------*/
/* 説明                                                  		*/
/*	強制待ち状態への移行。システムコールの戻り値（エラーコード）を	*/
/*	コンバートして返す。						*/
/*----------------------------------------------------------------------*/
/* 引き数								*/
/*	tskaa	: タスクのアクセスアドレス				*/
/*									*/
/* 戻り値								*/
/*	int	: 0	･･･ 正常終了					*/
/*		  -n	･･･ error code					*/
/*----------------------------------------------------------------------*/
int
SUS_TSK(
	unsigned int	tskaa
	)
{
	return( err_code( sus_tsk( (ID)tskaa)));
}
