/*======================================================================
 * File name    : frbitoff.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/utility/common/RCS/frbitoff.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: frbitoff.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_framBitOff                                                   */
/*         ：                                                                 */
/* パラメタ：IN:  F_DWORD クラスタ番号                                        */
/*         ：     F_BYTE * クラスタ使用状況展開領域                           */
/*         ：                                                                 */
/* 戻 り 値：なし                                                             */
/*         ：                                                                 */
/* 概    要：指定クラスタに対応するクラスタ使用状況展開領域のBitをOFFにする   */
/*         ：                                                                 */
/* 作 成 日：2004.09.02                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/
#include "fsbase.h"
#include "utility.h"

F_VOID FMR_framBitOff(
	F_DWORD clstnum,                    /* クラスタ番号                       */
	F_BYTE * ramaddr                    /* クラスタ使用状況展開領域           */
)
{
	F_BYTE l_readbuf;                   /* 対象Byte読込み領域                 */
	F_BYTE l_bitpos;                    /* 対象Bit位置                        */
	
	/* クラスタ使用状況展開領域の対象のBitが存在する領域を取得する */
	l_readbuf = *( ramaddr + sizeof( TFMR_SDWORKAREA ) 
		+ ( clstnum >> DFMR_SD_BITONCHAR ) );
	
	/* クラスタ番号より対象Bit位置を取得する */
	l_bitpos = clstnum & DFMR_SD_BITPOS;
	
	/* 対象のBitをOFFにする */
	l_readbuf &= ( F_CHAR )( ~( 1 << l_bitpos ) );
	
	/* クラスタ使用状況展開領域を更新する */
	*( ramaddr + sizeof( TFMR_SDWORKAREA ) 
		+ ( clstnum >> DFMR_SD_BITONCHAR ) ) = l_readbuf;
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
