/*======================================================================
 * File name    : gclstnum.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/fssvr60/utility/common/RCS/gclstnum.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: gclstnum.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
/******************************************************************************/
/* 関 数 名：FMR_getClstNum                                                   */
/*         ：                                                                 */
/* パラメタ：IN:  F_CHAR ドライブ番号                                         */
/*         ：     F_DWORD セクタ番号                                          */
/*         ：                                                                 */
/* 戻 り 値：クラスタ番号                                                     */
/*         ：                                                                 */
/* 概    要：セクタ番号よりクラスタ番号を取得する                             */
/*         ：                                                                 */
/* 作 成 日：2004.09.02                                                       */
/* 作 成 者：T.Tsuneyoshi                                                     */
/*                                                                            */
/******************************************************************************/
/*** 変更履歴 *****************************************************************/
/*  履歴               変    更    内    容                日 付    修 正 者  */
/******************************************************************************/
#include "fsbase.h"
#include "utility.h"

F_DWORD FMR_getClstNum(
	F_CHAR drvnum,                      /* ドライブ番号                       */
	F_DWORD sectnum                     /* セクタ番号                         */
)
{
	F_DWORD l_clstnum;                  /* クラスタ番号                       */
	
	l_clstnum = sectnum - MFMR_DATATOP( drvnum );
	l_clstnum = l_clstnum / MFMR_SECTPERCLST( drvnum );
	l_clstnum += DFMR_TOPCLSTNUM;
	
	return l_clstnum;
}
/******************************************************************************/
/*      Unpublished Copyright (C) 2004      ウェスコム株式会社                */
/******************************************************************************/
