/*======================================================================
 * File name    : brtcid.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: brtcid.c $
 * リビジョン 1.3  1970/01/01  00:00:00  chimura
 * 2003/11/12
 * compiler ver7 vup
 * TRAP中の割り込み禁止処理をやめる。
 * 
 * リビジョン 1.2  1970/01/01  00:00:00  sakaguti
 * trapa中は、外部割込み禁止にした
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  sakaguti
 * LOG MESSAGE
 * 
 *----------------------------------------------------------------------
 *		(c) Copyright 2002, ISHIDA CO., LTD.
 *		959-1 SHIMOMAGARI RITTO-CITY
 *		SHIGA JAPAN
 *		(077) 553-4141
 *======================================================================
 */

char	*brtcid = "$Header: p:/presto2/shlib_v7/biosif/rtc/RCS/brtcid.c 1.3 1970/01/01 00:00:00 chimura Exp $";
