/*======================================================================
 * File name    : apimisc.c
 * Original     :
 *----------------------------------------------------------------------
 *$Header: p:/presto2/shlib_v7/drive/rcs/apimisc.c 1.1 1970/01/01 00:00:00 kagatume Exp $
 *$Log: apimisc.c $
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2002, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */
#define	__APIMISC_C__

#include	<kernel.h>
#include	<stdio.h>
#include	"s60fat.h"

/*======================================================================
 *	fmr_fgets															
 *----------------------------------------------------------------------
 *	ファイルから文字列を読み込む										
 *----------------------------------------------------------------------
 *	引き数																
 *		char	*s				文字列を入力するバッファのアドレス		
 *		int		n				文字列を入力するバッファのバイト数		
 *		int		filehandle		ファイルのハンドル（≧０）				
 *	戻り値																
 *		char	*				正常: ファイル終了の時NULL				
 *									  ファイル終了でない時lineのアドレス
 *								異常: NULL								
 *----------------------------------------------------------------------
 */
char *fmr_fgets(char *s, int n, int fhdl)
{
	int i;
	int ch;

	if(n < 1)	return NULL;

	for(i=0; i < (n-1); ) {
		ch = fmr_fgetc(fhdl);
		if(ch == EOF)	break;
		s[i++] = (char)ch;
		if(ch == '\n')	break;
	}

	s[i] = '\0';
	if(ch != '\n')	return NULL;
	else			return s;
}

/*======================================================================
 *	fmr_fgetc															
 *----------------------------------------------------------------------
 *	ファイルから１文字読み込む											
 *----------------------------------------------------------------------
 *	引き数																
 *		int		fhdl			ファイルのハンドル（≧０）				
 *	戻り値																
 *		int						正常: ファイルの終了の時EOF(-1)			
 *									  ファイルの終了でない時入力した文字
 *								異常: EOF(-1)							
 *----------------------------------------------------------------------
 */
int fmr_fgetc(int fhdl)
{
	static unsigned char ch;

	if (FMR_Read(fhdl,&ch,1) <= 0) {
		return EOF;
	}
	return (int)ch;
}

/*======================================================================
 *	fmr_fputs															
 *----------------------------------------------------------------------
 *	ファイルへ文字列を書き込む											
 *----------------------------------------------------------------------
 *	引き数																
 *		const char	*s				出力する文字列のアドレス			
 *		int			fhdl			ファイルのハンドル（≧０）			
 *	戻り値																
 *		int							正常: 0								
 *									異常: EOF(-1)						
 *----------------------------------------------------------------------
 */
int fmr_fputs(const char *s, int fhdl)
{
	char ch;
	int ercd;
	char *buf = s;

	while ((ch = *buf++) != '\0') {
		ercd = fmr_fputc((int)ch, fhdl);
		if(ercd == EOF)	return EOF;
	}
	return DFMR_SUC;
}

/*======================================================================
 *	fmr_fputc															
 *----------------------------------------------------------------------
 *	ファイルへ１文字書き込む										
 *----------------------------------------------------------------------
 *	引き数																
 *		int		ch					書き込む文字						
 *		int		fhdl				ファイルのハンドル（≧０）			
 *	戻り値																
 *		int							正常: 書き込んだ文字				
 *									異常: EOF(-1)						
 *----------------------------------------------------------------------
 */
int fmr_fputc(int ch, int fhdl)
{
	static unsigned char wrch;
	
	wrch = (unsigned char)ch;
	if (FMR_Write(fhdl,&wrch,1) <= 0) {
		return EOF;
	}
	return DFMR_SUC;
}

/*======================================================================*/
/*====                   ***** END OF FILE *****                    ====*/
/*======================================================================*/
