/*======================================================================
 * File name    : fsutl2id.c
 * Original	: 
 *----------------------------------------------------------------------
 * Function	:
 *	ＩＤファイル
 *----------------------------------------------------------------------
 *$Log: fsutl2id.c $
 * リビジョン 1.2  1970/01/01  00:00:00  kagatume
 * 2006/04/21 16:00
 * SRAMデータが不定な状態で、電断対策バックアップを行うと、
 * 不定なアドレスを参照してしまう不具合の対策を以下のように行う。
 * ・biosfile.c
 * 　　SramFormat()、CfFormat()を実行時にバックアップパラメータ、
 * 　　バックアップ領域のクリアを実行するように変更。
 * ・powfail.c
 * 　　ClearBackupArea()の新規作成。
 * 　　Store_BackupData()内のsecnumが負の値の場合、BACKUP_MEMFULL
 * 　　とするように変更。
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 * リビジョン 1.1  1970/01/01  00:00:00  kagatume
 * 初期リビジョン
 * 
 *----------------------------------------------------------------------
 *			(c) Copyright 2006, ISHIDA CO., LTD.
 *			959-1 SHIMOMAGARI RITTO-CITY
 *			SHIGA JAPAN
 *			(077) 553-4141
 *======================================================================
 */ 

char	*fsutl2id = "$Header: p:/presto2/shlib_v7/drive/rcs/fsutl2id.c 1.2 1970/01/01 00:00:00 kagatume Exp $";
